[{"text": "NBA officially proposes lowering draft age to 18 link Huh, I always thought it wasn’t an age thing, but a requirement to be 1 year removed from High School", "class": "r/nba"}, {"text": "[Wojnarowski] New York has agreed with Dallas on trade that includes Kristaps Porzingis, Courtney Lee, Tim Hardaway Jr., for Wesley Matthews, Dennis Smith Jr. and DeAndre Jordan, league sources tell ESPN. Players and agents are being notified of particulars. Deal may include more draft assets. link Yes officer this trade right here", "class": "r/nba"}, {"text": "Charles Barkley: \"I don't like the fan's vote. What happened last time when we let them make a big decision? White House.\" link Civil discussion as always guys, bans will be handed out where appropriate.\n\nHad to lock, sorry guys.", "class": "r/nba"}, {"text": "The Big 3 together one more time! link Manu’s like “these fuckers didn’t even try to dress up for TV”", "class": "r/nba"}, {"text": "Toronto fans cheering as KD goes down hurt link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Report: Warriors' Durant expected to miss entire 2019-20 season link >Golden State Warriors superstar Kevin Durant is expected to miss the entire 2019-20 season after undergoing surgery for a ruptured right Achilles tendon, reports ESPN’s Adrian Wojnarowski.\n\n>The two-time NBA Finals MVP and 2014 regular-season MVP revealed the severity of his injury in an Instagram post Wednesday, two days after getting hurt during the Warriors’ Game 5 win over the Toronto Raptors. It was his first game in more than a month after being sidelined with a right calf strain.\n\n\n>Despite the news, Wojnarowski cited league sources indicating that the Brooklyn Nets and the New York Knicks remain interested in signing soon-to-be free agents Durant and Kyrie Irving into max salary slots.", "class": "r/nba"}, {"text": "[Feldman] 7-foot-5 Tacko Fall entered concussion protocol because he hit his head on 'low ceiling' link This is an incredible headline that is totally expected for someone that is Tacko's height, but also hilarious.", "class": "r/nba"}, {"text": "Melo just lays on the court, nobody gives a fuck and play goes on. link I watched that twice and didn't notice Melo at all.", "class": "r/nba"}, {"text": "[Wojnarowski] Sacramento has agreed to trade DeMarcus Cousins to the New Orleans Pelicans, league source tells @TheVertical. link So my roommate is a kings fan. How do I ask him for march rent before he kills himself?", "class": "r/nba"}, {"text": "[Wojnarowski] Golden State’s Klay Thompson has suffered a torn ACL in his left knee, his agent Greg Lawrence tells ESPN. link At this rate it's almost better there wasn't a Game 7; Curry would have been hit by a bolt of lightning.", "class": "r/nba"}, {"text": "[Wojnarowski] Kevin Durant is planning to sign with the Brooklyn Nets, league sources tell ESPN. link Kyrie to KD: what does the word government mean to you?\n\nKD: I’ve made a huge mistake", "class": "r/nba"}, {"text": "[Wojnarowski] New York has agreed to a deal to send Carmelo Anthony to OKC for Enes Kanter, Doug McDermott and a draft pick. link Kanter: \"OKC is the best organization in the NBA.\"\n\n*OKC trades him*", "class": "r/nba"}, {"text": "Max Kellerman on Lebron: \"It's called selling out. It's very easy to take a stand when there is low to no cost. When there is a real price to pay, then who will stand up? Mohammad Ali did. Not Lebron James\" link Mohammad Ali is the perfect example. Dude lost years of his prime over protesting what he thought was right. I mean, shit, he took it to the US Supreme Court since he was the one with the money and could afford to take a stance against the US Government.", "class": "r/nba"}, {"text": "Carmelo puts OKC up by 1 before Wiggins wins it at the buzzer link that crowd went 100 to 0 real fucking quick", "class": "r/nba"}, {"text": "Kobe to Shaq alley-oop, Game 7 of the 2000 Western Conference Finals. link Pippen should have gone back to being invisible after getting crossed up that bad", "class": "r/nba"}, {"text": "Every Phoenix Suns player starts running at the exact same moment link 9-2 is such a promising start, i wonder how the rest of the game went", "class": "r/nba"}, {"text": "[Wojnarowski] The Clippers have agreed to a deal to send Blake Griffin to the Detroit Pistons, league sources tell ESPN. link Trade as we know it currently: \n\n**Clippers send:** \n\n* Blake Griffin (PF)\n* Willie Reed (C) \n* Brice Johnson (PF)\n\n**Pistons send:** \n\n* Tobias Harris (F)\n* Avery Bradley (SG)\n* Boban Marjonovic (C)\n* 2018 1st Round Pick ^[1](https://twitter.com/wojespn/status/958121789179203585)\n* 2019 2nd Round Pick", "class": "r/nba"}, {"text": "Pop has the most total wins as a head coach with 1,413. Here's his reaction after he got the first one, on December 14, 1996. link Pop was a crazy lad. Fired the head coach back then and said I've got this", "class": "r/nba"}, {"text": "[Rovell] Girl named Riley Morrison asks @StephenCurry30 why his sneakers don’t come in girls sizes. Steph responds. link My man really said #RUINTHEGAME lmao ", "class": "r/nba"}, {"text": "New NBA fan with a question. I was watching the Cavs practice tonight, why were there some people running around in Celtics jerseys? Hey sorry if it's a dumb question, I was just wondering why the practice was getting interrupted and no one was doing anything about it? It didn't really seem to mess them up though which is why I guess security didn't do anything. You know it's bad when we have off season level shitposting during the conference finals.", "class": "r/nba"}, {"text": "DeAndre Ayton forgot to change his sample text link \"I hate this fucking game #BlackOps4 #CallofDutyPartner\"", "class": "r/nba"}, {"text": "LeBron forgets he's not on the Heat anymore link If Norris Cole passes him the ball off that screen do you think he takes the shot?\n\nThat'd be the funniest moment in NBA history.", "class": "r/nba"}, {"text": "Kawhi sents Raptors to ECF - SNET = link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "[Wright] Spurs coach Gregg Popovich was asked why he thinks it’s important to give back to the community: “Because we’re rich as hell and we don’t need it all, and other people need it. Then, you’re an ass if you don’t give it. Pretty simple.” link He always tips waiters thousands of bucks whenever the spurs are in town ", "class": "r/nba"}, {"text": "Lebron James response to Kyle Lowry and Warriors part-owner incident link The face of the NBA has spoken. This will now be dealt with properly by Silver.", "class": "r/nba"}, {"text": "With 4 minutes and 20 seconds left in the 4th quarter this was the score during the Warriors vs. Clippers summer league game : link Why has nobody pointed out it was a COX Scoreboard? ", "class": "r/nba"}, {"text": "Lou Williams eats nachos after dropping 36 points in the biggest comeback in NBA Playoff history link Na-cho night dubs fans", "class": "r/nba"}, {"text": "Kareem Abdul-Jabbar is auctioning off his championship rings and MVP trophies for charity: \"When it comes to choosing between storing a championship ring or trophy in a room, or providing kids with an opportunity to change their lives, the choice is pretty simple. Sell it all.\" link Can you fuckin imagine having Kareem’s MVP trophy sitting in your display case", "class": "r/nba"}, {"text": "Paul Pierce admits to shitting his pants in the NBA finals against the Lakers, and faking a knee injury to go to the bathroom [VIDEO] link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Dirk Nowitzki’s Full Page Thank You to Dallas in Today’s Paper link 21 fucking seasons with the same team. Props to the front office not fucking that up, absolute class act and loyalty all around.", "class": "r/nba"}, {"text": "[Windhorst] Kyrie Irving asked the Cavs to trade him in a meeting last week, sources told ESPN. link Shit they just said on NBA radio that Kyrie doesn't want to play with LeBron anymore. Holy shit ", "class": "r/nba"}, {"text": "Body Worn Camera Video Release of Sterling Brown Arrest link EDIT: 14 hours is long enough. Comment quality has degraded to the point where we're going to close it down. \n\nWe know this is a hot button topic, as it should be. We ask that commenters  follow [our rules](http://www.reddit.com/r/NBA/wiki/rules) and act respectful towards each other. \n\nRule breaking comments may result in a suspension. \n\n_____\n\n[Milwaukee Police Press Release](http://imgur.com/1mqt3YW)\n\n[Sterling Brown Press Release](https://pbs.twimg.com/media/Dd6kQ2hV4AA8ZKA.jpg)\n\n[Milwaukee Bucks Press Release](https://www.nba.com/amp/bucks/news/bucks-organization-statement-sterling-brown)", "class": "r/nba"}, {"text": "[Klein] Hawks are all-in on fan experience.. 1st NBA team to offer fan friendly concession prices: $1 Chips; $2 Candy, pretzel's, bottled water; $3 Fries, hot dogs, nachos $4 pizza, bottomless popcorn, bottomless soda; $5 beer link So living in LA, it would almost be cheaper to fly to Atlanta to go to a game.  OK OK", "class": "r/nba"}, {"text": "After the departure of Phil Jackson from the Lakers in 2004, Shaq went on TV and declared \"If a coach takes a team to the Finals 4 out of 5 years, I'll kiss his feet. With cheese on it. I will. It'll never be done again.\" Since then, Steve Kerr has taken the Warriors to 5 straight Finals. link **Replays/alternate angles**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Lakers/Raptors fans should turn the Kawhi situation into something positive. Winning team's fan base makes donations to other city's children's hospital? Toronto and Boston had something like this going during the NHL playoffs. Could be something nice coming out of all this increased attention.\n\nWow this blew up quick. I'm going to turn off mailbox replies lol.\n\nI'm a Toronto fan so I'll be making a $20 donation to https://www.chla.org/ if Kawhi signs with Toronto. I hope others do the same.\n\nToronto's Childrens Hospital is Sick Kids Hospital - https://www.sickkids.ca/\n\nI've cross posted this to both /r/torontoraptors and /r/lakers as well to get more eyes on it.\n\nFINAL EDIT: \n\nSo this is a turn of events. Clippers got him. I honestly thought they weren't really in the running anymore and it was a toss up between Lakers and Raptors. As I've said in comments I never meant any disrespect to Clippers fans and congrats to them! When they were brought up I really didn't know how to do a 3 way deal between 2 cities. Now that here here though...\n\nThe spirit of the wager was the winning team donates to the other teams kids hospital. Clippes fans have wanted to be in this so much I'm hoping now they step up. I'd suggest donating to either city's kids hospital. You want to keep your donation local give to CHLA, want to show Toronto some love give to Sick Kids in Toronto. for Lakes and Raptors fans I'm suggesting they each give to the other charity. As a Raptors fan I'm still going to give to CHLA. There is no reason not to in my mind.\n\nI'm glad my post could bring people together in a positive way and I know some good has come out of it.\n\nFINAL FINAL EDIT:\n\nI know this post is old now but I wanted to show that I put my money where my mouth is:\n\nhttps://imgur.com/FgGVGgL\n\nI hope others did as well. So you implying clippers dont even have fans? lol", "class": "r/nba"}, {"text": "Damian Lillard quotes Sun Tzu's The Art of War “It is the unemotional, reserved, calm, detached warrior who wins, not the hothead seeking vengeance and not the ambitious seeker of fortune.” [https://www.instagram.com/p/BwpUza1gmIc/](https://www.instagram.com/p/BwpUza1gmIc/) Damian Lillard, they're already dead", "class": "r/nba"}, {"text": "Michael Jordan hits a Triple Clutch Layup link My favorite part about this was the Net’s bench reaction", "class": "r/nba"}, {"text": "Charles: I really feel sad for Russell Westbrook. This kid gives 150% every single game and all he does is get criticized.. Is he the perfect basketball player, no. But that guy gives maximum effort every single night. And as an old player and a fan, I'm going to always admire that man link imagine telling r/nba a week ago that Rocket fans would be defending and complimenting Westbrook in the near future", "class": "r/nba"}, {"text": "Bad officiating calls in Warriors-Rockets G7 Strap in boys, it's gonna be a ride. So I've basically reviewed the whole game last night, and here are the questionable plays which I thought should have been calls/were called wrongly.\n\n#Calls going against Rockets:\n\n1. [Wrong travelling call against Capela](https://streamable.com/cso98), didn't lift up his pivot foot.\n\n2. [Slight push on PJ Tucker no call, KD gets the call on the other end](https://streamable.com/boqtv). Probably a superstar call.\n\n3. [Harden might have gotten shoved in the back by Looney](https://streamable.com/7189z), no call.\n\n4. [Capela called for a goaltend for what seemed to be a clean block](https://streamable.com/qtz8u).\n\n5. [Harden fouled on the landing](https://streamable.com/4d9r6), no call. [Slowmo](https://streamable.com/s06jh)\n\n6. [Harden fouled on three attempt](https://streamable.com/bzjys), no call. [Slowmo](https://streamable.com/alpcm)\n\n7. [Ref disallows continuation on Harden's three](https://streamable.com/vhads). [Slowmo](https://streamable.com/lydp2)\n\n8. [Eric Gordon fouled by Draymond](https://streamable.com/zynw6), no call.\n\n#Calls going against Warriors:\n\n1. [Klay gets called for an early 2nd foul which didn't look like much contact](https://streamable.com/e0s94), looked like ball just slipped out of EG's hands.\n\n2. [Curry's hip gets pushed by Gerald Green](https://streamable.com/o4nk6), even falls on the ground. No call.\n\n3. [Jordan Bell raked across the arm by Harden](https://streamable.com/s2n6m), no call. (pro tip: right click and select 1/4 speed to see the contact)\n\n4. [Klay gets hand checked by Tucker and loses the ball](https://streamable.com/pqylu). No call. [Slowmo](https://streamable.com/j8f9c)\n\n5. [KD gets pushed into Harden by Ryan Anderson](https://streamable.com/n27zm), foul on KD. Similar to [this play](https://streamable.com/nhcep), albeit less egregious by Anderson.\n\n6. [Klay gets a point removed by Scott Foster](https://streamable.com/0nhtk).\n\nA major theme which showed itself was the fact that Ryan Anderson literally (I'm not kidding) hand checked Curry every time he was switched onto him. And the Warriors forced that switch A LOT. Here's ALL the plays where Anderson guarded Curry:\n\nhttps://streamable.com/el34r\n\nhttps://streamable.com/vtmzu\n\nhttps://streamable.com/uv829\n\nhttps://streamable.com/9fqlg\n\nhttps://streamable.com/junss\n\nhttps://streamable.com/2peej\n\nhttps://streamable.com/53mhy\n\nhttps://streamable.com/cuojo\n\nhttps://streamable.com/07r5o\n\nBonus Harden trying to draw foul when there was none & just looking like a fool:\n\nhttps://streamable.com/ca5v5\n\nhttps://streamable.com/jffyc\n\nOh and, inb4 Rockets fans accuse me of bias again, and calling me a Warriors fan. Would a Warrior fan post these?\n\nhttps://www.reddit.com/r/nba/comments/8lyh34/ariza_gets_called_for_a_blocking_foul_on_durant/\n\nhttps://www.reddit.com/r/nba/comments/8ly16n/curry_draws_3_free_throws_from_capela/\n\nhttps://www.reddit.com/r/nba/comments/8lfvoo/draymond_going_back_to_his_bad_habits/\n\nThe entire game is freely available online, if you're so angry why don't you make your own compilation? And u/unklebuckets, still waiting for [your refs lowlights thread](https://www.reddit.com/r/nba/comments/8mf8tv/post_game_thread_the_golden_state_warriors_33/dzn4mpy/?context=3), or any of the 1+ million subscribers to make one.\n\nEdit: [Summary of the night](https://i.imgur.com/fHlyNne.jpg) lol. Credits to u/wetjumpshot\n\n Although this might get deleted because ref bashing, nice amount of research done here. Kudos\n\nEdit: Still up, wew", "class": "r/nba"}, {"text": "[Highkin] Awful news from San Antonio: Spurs announce that Gregg Popovich's wife, Erin, passed away today. link [Spurs GM RC Buford on the passing of Erin Popovich: \"We mourn the loss of Erin. She was a strong, wonderful, kind, intelligent woman who provided love, support and humor to all of us.\"](https://twitter.com/wojespn/status/986762877959884800)\n\n[Full statement from the Spurs](https://pbs.twimg.com/media/DbGtlf0WsAEvCEp.jpg)", "class": "r/nba"}, {"text": "Donald Trump just called Warriors head coach Steve Kerr a \"little boy\" for not calling out China No idea what to think but this should be left up as a thread on the sub. It's related to basketball & honestly, as much as I hate to say it but he does have a point\n\n[streamable link here to the video](https://streamable.com/lnlia) As with every thread, please be mindful of the [rules](https://www.reddit.com/r/nba/wiki/rules). All are still in effect, and bans will be handed out where necessary.\n\nHad to lock, as thread is getting brigaded and comments straying from relevance.", "class": "r/nba"}, {"text": "J.R. Smith runs out the clock and then keeps running link Sometimes I wish I was alive for Picasso, Van Gogh, or Michelangelo. Then I see posts like this and realize that great art is still among us", "class": "r/nba"}, {"text": "Joe Harris comments on the financial implications of Darryl Morey’s tweet: “I already get paid too much to play a game...” Full quote:\n\n\nJoe Harris on whether or not he is worried about the financial implications of Daryl Morey’s tweets: “I already get paid too much to play a game. So, not really.”\n\nPer Malika Andrews: \nhttps://twitter.com/malika_andrews/status/1184541643229335553?s=21\n\nJoe Harris is a man of the people and he presumably supports democracy. Joe Harris has a rocking beard and slangin dong\n\nEdit: for those of you in this thread comparing Joe to Lebron, here’s a YES Network side by side comparison of the two roughly 2 years ago. \nhttps://www.reddit.com/r/nba/comments/872u4d/yes_network_side_by_side_comparison_of_lebron/?utm_source=share&utm_medium=ios_app&utm_name=iossmf Bolder than 90% of the nba players and coaches", "class": "r/nba"}, {"text": "[BR] Adam Silver on Daryl Morey: \"We were being asked to fire him by the Chinese government. … We said there’s no chance that’s happening. There’s no chance we’ll even discipline him.\" (via @TIME) link Who knew China was such a little bitch ?", "class": "r/nba"}, {"text": "[Spears] “I believe he was misinformed and not educated on the situation,” LeBron James said on the Morey tweet. LeBron added Morey’s tweet was dangerous. LeBron said he is uncertain about the future ramifications of the Morey tweet with the NBA and players. link [[Spears]LeBron James was referring to the ramifications of Daryl Morey’s tweet on China and the events it unleashed when the Lakers star said the Rockets GM was misinformed, a source told Undefeated](https://twitter.com/MarcJSpearsESPN/status/1183924147958640642)\n\n[[Oram] LeBron just addressed the team’s trip to China, including saying he felt Daryl Morey was misinformed. He later clarified he meant “misinformed” of the ramifications of such a comment as opposed to the issue of Hong Kong’s sovereignty.](https://twitter.com/billoram/status/1183923098627657729?s=21)\n\n\n[[Faigan] Here is LeBron on his belief that Daryl Morey \"wasn't informed\" on the situation in China, and his thoughts on the consequences that come with free speech](https://twitter.com/hmfaigen/status/1183920065499942912?s=21) Transcript of what LeBron said", "class": "r/nba"}, {"text": "Caller on Stephen A. Smith's show mentions that all is not lost for the Knicks because Carmelo Anthony is available. Stephen A. Smith replies: \"Oh go to hell. Bye\", and drops the phone call link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Doncic sends the game in OT link LEBRON DINNER WITH DONCIC CONFIRMED", "class": "r/nba"}, {"text": "Kobe Bryant wins the Oscar for \"Dear Basketball\" in the animated short film category. link [Kobe's acceptance speech video](https://streamable.com/ytq4n)", "class": "r/nba"}, {"text": "James Harden gives the Rockets a one point lead with one second left! - TNT link ### Replays/alternate angles\n\nIf this post is a highlight, reply to this comment with replays, alternate angles, and other accompanying media. \n\nIf your highlight is removed or doesn't show up in the new queue, it was likely removed as a duplicate or for failing to meet quality standards.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Why LeBron would sign with every NBA team **Atlanta Hawks**\n\nLeBron is secretly a huge Twister fan. He will join the Hawks so he can film Twister 2 with their owner’s wife on their off days.\n\n**Boston Celtics**\n\nLeBron misses Kyrie. He wants to play basketball with his friend and that means playing for the Celtics.\n\nOR\n\nLeBron wants to troll Kyrie. He will go to Boston management and ask them to trade Kyrie back to Cleveland if they want him to join. Danny Ainge will agree because he has no heart.\n\n**Brooklyn Nets**\n\nLeBron loves NY. He will go to New York to sign with the Knicks to play in historic Madison Square Garden. However, during the drive to the stadium, his driver makes a wrong turn and they end up in Brooklyn. LeBron realizes the mistake, but shrugs his shoulders and signs with the Nets instead, because he will have the same results with either the Knicks or Nets.\n\n\n**Charlotte Hornets**\n\nLeBron wants to prove he’s better than Michael Jordan. He will sign with the Hornets to taunt MJ directly. He will win the Finals in 2019 with the Hornets and won’t let MJ touch the trophy. After the season, LeBron will buy out MJ’s shares and he will become majority owner. He will then trade himself to a better team because Dwight is too annoying and nobody will agree to LeBron’s trade proposals involving Dwight.\n\n**Chicago Bulls**\n\nLeBron wants to prove he’s better than Michael Jordan. He will sign with the Bulls so he can win 7 championships to pass what MJ did.\n\n\n**Cleveland Cavaliers**\n\nLeBron loves Cleveland as much as he hates moving. LeBron will re-sign with the Cavs, because it’s more convenient than moving to a different city.\n\n**Dallas Mavericks**\n\nLeBron is still haunted by the 2011 Finals. He will go to Dallas to learn from the true GOAT Dirk Nowitzki. There, LeBron will lead the Mavs all the way to the number 1 seed in the West, only to lose to the Warriors in the first round after KD leaves for India to re-join his snek charmer friend.\n\n**Denver Nuggets**\n\nLeBron loves chicken nuggets. He will sign with Denver, only to be disappointed. He then will retire and start his own chicken nugget company.\n\n**Detroit Pistons**\n\nLeBron will become the new Pistons President of Basketball Operations. His first act in his new role will be to sign himself as the head coach/starting SF. His second transaction will be to trade Blake Griffin to the Cavs for the 8th pick in the draft and salary filler, because LeBron will blackmail Dan Gilbert into doing it.\n\n**Golden State Warriors**\n\nLeBron wants all the ringz. He will sign with the Warriors for the veteran minimum so he can win not 1, not 2, not 3, not 4, not 5, not 6, not 7, not 8, not 9, but 10 championships.\n\n**Houston Rockets**\n\nLeBron loves space. He will sign with the Rockets so he can go to NASA and fly an actual rocket into space to find better competition on other planets. Mike Dan Tony will be confused why LeBron doesn’t show up to their games. Mike, he’s in space, deal with it.\n\n**Indiana Pacers**\n\nLeBron loves pace. He will sign with the Pacers so he can out-pace the other NBA players and win a championship. He will also become best friends with Lance Stephenson and the two will call out plays to each other by blowing in each other’s rear, I mean ear.\n\n**LA Clippers**\n\nLeBron wants to live in Hollywood, but doesn’t want to be under the shadow of Laker greats. If he can just lead the Clippers to the conference finals, they would rename their franchise LeBron’s Clippers.\n\n**LA Lakers**\n\nLeBron wants to live in Hollywood, but doesn’t want to be under the shadow of Clipper goods. He also wants to learn from the great Lavar Ball on how to play basketball as good as him.\n\n**Memphis Grizzlies**\n\nLeBron will not sign with the Memphis Grizzlies.\n\n**Miami Heat**\n\nLeBron will go back to Miami because he left his white headband there and wants it back.\n\n**Milwaukee Bucks**\n\nLeBron loves freaks. He will join the Greek Freak and sign with the Bucks. Then they will sign Rick James to preform every halftime so he can sing LeBron’s favorite song “Super Freak”\n\n**Minnesota Timberwolves**\n\nLeBron wants to learn from former MVP Derrick Rose. He also wants to torture his body and allow Coach Thibs to play him all 48 minutes for all 82 games.\n\n**New Orleans Pelicans**\n\nLeBron loves smoothies. He will join the Brow and sign with the Pelicans, so he can get unlimited smoothies at the Smoothie King Center.\n\n**New York Knicks**\n\nLeBron loves NY. He will go to New York to sign with the Knicks to play in historic Madison Square Garden. During the drive to the stadium, his driver makes the correct turn and they end up in MSG. LeBron realizes this and signs with the Knicks.\n\n**OKC Thunder**\n\nLeBron will sign with the Thunder so he can play with Russell Westbrook for one season, then leave after that and become an even better player.\n\n**Orlando Magic**\n\nLeBron will take his talents to Central Florida. He will sign with the Magic and lead them to another Finals lost.\n\n**Philadelphia 76ers**\n\nLeBron will sign with the 76ers because he trusts the process. LeBron will single handedly play bad for 3 seasons and tank so that the 76ers will get more draft picks to add to their squad. Then by age 37, LeBron will have what he needs to win another Eastern Conference Finals.\n\n**Phoenix Suns**\n\nLeBron loves hot-related teams. He will sign with the Suns and win 2 championships to prove to Pat Riley that he isn’t so special with his so called “Heat” for the “Suns” are the hottest thing in the universe.\n\n**Portland Trail Blazers**\n\nLeBron loves Nike. He will sign with the Blazers so that he can spend his off days at Nike headquarters creating new shoes.\n\n**Sacramento Kings**\n\nLeBron is the King. He will sign with the Kings, because that’s where he belongs.\n\n**San Antonio Spurs**\n\nLeBron loves Coach Pop. He will sign with the Spurs to learn from him, only to find out Coach Pop actually has no idea what he’s doing and is just really lucky. LeBron will use that luck to convince Kawhy? To stay and they will win a championship every other year in 2019, 2021, and 2023.\n\n**Toronto Raptors**\n\nLeBron will sign with the Raptors just to check up on them and make sure they are ok.\n\n**Utah Jazz**\n\nLeBron loves jazz. He will sign with Utah only to find out they don’t actually have jazz. He will then force a trade to New Orleans to be close to real jazz and because he remembered that he loves smoothies.\n\n**Washington Wizards**\n\nLeBron loves politics. He will sign with the Wizards so he can play basketball and also become the next president of the United States in 2020.\n\n\n\n**EDIT**\n\nSome of you have been asking for this, so here you go...\n\n**Seattle Supersonics**\n\nLeBron won't sign with this team because it doesn't exist. >doesn’t want to be under the shadow of Laker greats\n\n>doesn’t want to be under the shadow of Clipper goods", "class": "r/nba"}, {"text": "enjoy. www.chanceraps.com\n\n You did a good ass job, Chance.", "class": "r/hiphopheads"}, {"text": "[ORIGINAL] This is what a $2 Lil B feature got me link “The person on the first verse sucks, I got on the song because he sucks. Let’s get it.”\n\nIncredible.", "class": "r/hiphopheads"}, {"text": "My brother Rogét Chahayed, who wrote and played the keys in the intro of SICKO MODE link Those keyboards were so distinctive and made he song recognizable. ", "class": "r/hiphopheads"}, {"text": "[FRESH] Kanye West ft. Kendrick Lamar - No More Parties In LA link did not expect \"very very extremely soon\" to be 4 in the morning damn", "class": "r/hiphopheads"}, {"text": "Tekashi 6ix9ine Pleads Guilty to Nine Counts link He could have gone out in style by requesting another 60 counts. ", "class": "r/hiphopheads"}, {"text": "[SHOTS FIRED] T.I responds to Donald Trump calling out Snoop Dogg link They say that every time a black person faces an injustice [TI's hat moves another 8 degrees](http://ima.ulximg.com/image/500x500/cover/1453648398_ec82197794b0119747066153584bbedd.jpg/009953b706565436b312fec8fb2d59e1/1453648252_926539534e078aa03af9b584efccb709.jpg) in defiance of gravity.\n\nEdit: Somebody put this on twitter an TI retweeted it so I've technically ghostwritten for TI.  Hi mom.", "class": "r/hiphopheads"}, {"text": "Rich Brian is the first Asian artist in history, to ever reach #1 on the ITunes Hip Hop Chart. link MIA or Far East Movement never did it?", "class": "r/hiphopheads"}, {"text": "Pusha-T - The Story of Adidon link The clear and precise enunciation on \"YOU ARE HIDING A CHILD\" gotta be one of the most hilarious diss lines ever. \n\nPush sounded like he wanted the classroom to repeat after him.", "class": "r/hiphopheads"}, {"text": "Prodigy from Mobb Deep has passed away link ~~Still awaiting confirmation from his publicist~~ \n\n[XXL] (http://www.xxlmag.com/news/2017/06/prodigy-dies-at-42/) has gotten confirmation\n\nFurther confirmation from [TMZ] (http://www.tmz.com/2017/06/20/prodigy-dead-mobb-deep/)\n\nOfficial statement is as follows\n\n>It is with extreme sadness and disbelief that we confirm the death of our dear friend Albert Johnson, better known to millions of fans as Prodigy of legendary NY rap duo Mobb Deep. Prodigy was hospitalized a few days ago in Vegas after a Mobb Deep performance for complications caused by a sickle cell anemia crisis. As most of his fans know, Prodigy battled the disease since birth. The exact causes of death have yet to be determined. We would like to thank everyone for respecting the family’s privacy at this time.\n\n\n\nCondolences from [Havoc] (https://www.instagram.com/p/BVklGdbhLuU/?hl=sv)\n\n[HHDX article] (http://www.hiphopdx.com/editorials/id.3794/title.reactions-to-prodigys-death-are-pouring-in) with other reactions\n\nMuch more below to show just how huge of a hit this is to hip-hop\n\nRIP to a legend", "class": "r/hiphopheads"}, {"text": "Denzel Curry freestyles while the show is stopped due to sound problems tonight in Austin link [Q&A](https://youtu.be/moJNWvJ_EyU) (thanks /u/Jared_Rollins)", "class": "r/hiphopheads"}, {"text": "Anderson .Paak Announces New Album; Ventura out April 12th link Anderson .Paak is for the people.", "class": "r/hiphopheads"}, {"text": "ScHoolboy Q takes Mac Miller on a date after he was feeling depressed link Q doing the barrel roll through the lasers is still one of the funniest things I’ve ever seen ", "class": "r/hiphopheads"}, {"text": "[FRESH] Kendrick Lamar - The Blacker The Berry link damn this is like the angriest song about pacifism I've ever heard", "class": "r/hiphopheads"}, {"text": "[SHOTS FIRED] Eminem BET Hip Hop Awards Cypher Trump Diss link releasing a censored Eminem freestyle is like watching an NBA game and closing your eyes for all the dunks", "class": "r/hiphopheads"}, {"text": "The Immortal Legacy of Seba Jun, known to many as Nujabes, a legendary Japanese hip-hop producer who kickstarted what could be considered the modern lo-fi movement, alongside Dilla, Madlib, and others. I've spent the last 9 months interviewing those close to him, for further insight. link This is absolutely incredible. Thank you for your hard work- tracking all these people down and doing all this research.\n\n&#x200B;\n\nLike most people I've been a fan of Nujabes since Samurai Champloo and I feel like I've rediscovered him through all the new content in your interviews.\n\n&#x200B;\n\nI mean.. you have the fucking notes that Shing02 used to write Luv Sic. I'm blown away.", "class": "r/hiphopheads"}, {"text": "Joey Bada$$ owes me money and it’s sad cuz I fw him sincerely :( [My story via twitter](https://twitter.com/acehashimoto/status/1108359002486796288?s=21)\n\nAs some of y’all know, my name is brandUn DeShay. I produced a lot of songs over the years but the ones we’re talking about today are “School High” & “Last Cypher”.\n\nIt's been almost 2 MONTHS since I heard from Joey Bada$$ yall....\nI wanna give him the benefit of the doubt that he's a much busier man than me these days, but I've also reached out to his label management over the last 5 months and still no reply.\n\nThese beats I produced for Joey were done when I was 2 or 3 yrs in and for years these songs remained FREE mixtape downloads and I had no problem with that. I never asked for bread because technically no one was getting paid.\n\nUntil recently (December 12/23/18) Joey re-released the PEEP the Aprocalypse mixtape on all streaming platforms. Therefore generating bread off streams and DID NOT ask my permission, did not do splits or even work out a deal to just buy my share of the publishing from me.\n\nTo me, if you making money off the work/effort of another man, make sure that man eating too 🤷‍♂️🤷‍♂️🤷‍♂️\n\nAnd I hate takin shit like this public cuz usually i think that shit is corny asf... butttt I'm still tryna avoid taking this to court to retrieve the 💰. \n\nI hope Joey reaches back so we can figure this out... the \"producer x rapper\" relationship in Hip-Hop deserves some success stories.\n\nPlease retweet or share if this resonates at all. \n\n\n\n\n I wanna add one more thing. \n\nThis EXACT situation happened with me and Mac Miller before he passed (RIP to malcom cuz he was an angel).\n\nMac wanted to re-release his mixtape “Macadelic” for free and you know what he did? \n\nHe contacted me first about “Aliens Fighting Robots” and sent me paperwork!!!\nWe agreed on a price, permissions, splits and that was it. Everyone went home happy and you can now stream Macadelic on Spotify rn. \n\nMac Miller handled his business properly. Be like Mac Miller. ", "class": "r/hiphopheads"}, {"text": "Kanye West Donates $150,000 to Family of Chicago Security Guard Killed By Cops link thanks Kanye Very cool!\n\nNo its cool that Kanye is trying to help ", "class": "r/hiphopheads"}, {"text": "LIFE OF PABLO DOWNLOAD LINK [TIDAL] link Stream: http://listen.tidal.com/album/57273408", "class": "r/hiphopheads"}, {"text": "Kanye West tweets about his upcoming album TLDR: \n\nPusha T's album \"King Push\" - May 25th\n\nKanye's solo album: June 1st\n\nKanye & Kid Cudi's joint album \"Kids See Ghost - Kids See Ghost\" - June 8th\n\nTeyana Taylor's album - June 22nd\n\n\n\n# first tweet \nhttps://twitter.com/kanyewest/status/987049500177920000\n> my album is 7 songs\n\nscreenshot: https://imgur.com/iABCGw0\n\n# second tweet: \n\n\nhttps://twitter.com/kanyewest/status/987049937434112000\n\n> June 1st\n\nscreenshot: https://imgur.com/EY4hM1T\n\n# third tweet:\n\nhttps://twitter.com/kanyewest/status/987051337782181889\n\n> me and Cudi album June 8th\n\nscreenshot: https://imgur.com/4Cm1BL4\n\n# fourth tweet\n\nhttps://twitter.com/kanyewest/status/987052001023279104\n\n> it's called Kids See Ghost. That's the name of our group\n\nscreenshot: https://imgur.com/4tm8Y62\n\n# FIFTH AND SIXTH TWEETS// KING PUSHA ALBUM MAY 25th! \n\n5. https://twitter.com/kanyewest/status/987069464687489024\n\n6. https://twitter.com/kanyewest/status/987069631696289792\n\n\n> Teyana Taylor June 22nd\n\n> Pusha T May 25th\n\nscreenshot: https://imgur.com/DdfS0yd\n\n\nEDIT: \n\nnot to sound condescending but i'm just gonna add a couple of discussion questions here incase y'all get tired of 'father stretch my anus' jokes and lyric chains:\n\nWhat direction do you think ~~this album is~~ these albums are going to take? What direction would you like to see them take? Do you think the length of the album is good or bad? What influences are we supposed to see on the album? Do you think he's gonna release it in time?\n\n\nWe know he's let Charlamagne hear some of it, and I believe Nas reportedly was working on something with Kanye too, what do you think it is? \n\nedit 2: \n\nwhy didn't kanye tweet the name of his own album? I'm assuming the second one is Kids See Ghost - Kids See Ghost\n\nWhy is ghost singular? do you expect both the drop? which one do you think will sell more? \n Keep your shitposts contained to here thx lads^^^hopethealbumsaregood", "class": "r/hiphopheads"}, {"text": "[FRESH VIDEO] Childish Gambino - Feels Like Summer link Isn't Gambino about to leave the rap game? Video kind of seems like he's taking one last stroll through the rap scene and reminiscing about everything that's been happening before he goes home and puts it all behind him. ", "class": "r/hiphopheads"}, {"text": "21 Savage arrested by ICE https://mobile.twitter.com/MarkWinneWSB/status/1092155141636214784\n\n*ICE spokesman Bryan Cox: “U.S. Immigration and Customs Enforcement (ICE) arrested unlawfully present United Kingdom national Sha Yaa Bin Abraham-Joseph AKA ‘21 Savage’ during a targeted operation with federal and local law enforcement partners early Sunday in metro Atlanta.”*\n\n**Original tweet**: https://mobile.twitter.com/MarkWinneWSB/status/1092154199096418310\n\n*Breaking: ICE has arrested  #21Savage official confirms \n@wsbtv*\n\n**Update**: \"https://mobile.twitter.com/MarkWinneWSB/status/1092155899559534599\"\n\n*\"Mr. Abraham-Joseph was taken into ICE custody as he is unlawfully present in the U.S. and also a convicted felon. Mr. Abraham-Joseph initially entered the U.S. legally in July 2005, but subsequently failed to depart under the terms of his nonimmigrant visa”, Cox emailed*\n\n**Update #2**: https://mobile.twitter.com/MarkWinneWSB/status/1092157166172233731\n\n*More from ICE spokesman: “Mr. Abraham-Joseph is presently in ICE custody in Georgia and has been placed into removal proceedings before the federal immigration courts. ICE will now await the outcome of his case before a federal immigration judge to determine future actions.”*\n\n**Update #3**: https://twitter.com/CNNValencia/status/1092159977781972992 (Okay, I really don't know what to make of this one)\n\n*BREAKING- @ICEgov spokesman tells me @21savage was taken into custody by ICE. “His whole public persona is false. He actually came to the U.S. from the U.K. as a teen and overstayed his visa.”  MORE COMING*\n\n**Update #4**: https://twitter.com/CNNValencia/status/1092162339250544640\n\n*BREAKING- @21savage initially entered the U.S. legally in July 2005, but subsequently failed to depart under the terms of his nonimmigrant visa and he became unlawfully present in the U.S. when his visa expired in July 2006: @ICEgov*\n\n**Update #5**: https://twitter.com/MarkWinneWSB/status/1092176534666907649\n\n*Important new info on #21Savage arrest: am told it was NOT part of a SuperBowl -related ICE operation, that he was in car with another hip hop artist who was subject of a local police bust @wsbtv*\n\n**Comment from 21 Savage's Attorney**: https://variety.com/2019/music/news/21-savage-arrested-by-ice-deported-1203127294/#xcess\n\n*The rapper’s attorney, Dina LaPolt, told Variety: “We are working diligently to get Mr. Abraham-Joseph out of detention while we work with authorities to clear up any misunderstanding. Mr. Abraham-Joseph is a role model to the young people in the country — especially in Atlanta, Georgia and is actively working in the community leading programs to help underprivileged youths in financial literacy.”*\n\n**Update #6**: https://twitter.com/CNNValencia/status/1092193076553138176\n\n*BREAKING- @21savage was in the car with another rapper who was the target of a criminal arrest. 21 was taken into custody by law enforcement after they learned of his immigration status. “There is no misunderstanding. 21 Savage is a British National.”: Law Enforcement source*\n\n**Update from DJ Akademiks**: https://twitter.com/Akademiks/status/1092197261881368578 (credit to /u/Happy_Viper)\n\n*Spoke to 21 savage team... this whole situation a big misunderstanding ... hope it gets cleared up quickly. There’s a logical explanation behind everything as well... but until then them U.K. jokes gonna fly.  When the real story comes out a lot will identify with it .* >There is no misunderstanding. 21 Savage is a British National.\n\nthis is the funniest line i heard this decade", "class": "r/hiphopheads"}, {"text": "Machine Gun Kelly plays the guitar for a cute little fan after she tells him that he didn't play her favorite song at the show link Do you think maybe he said that he forgot the words or whatever because he didn’t want to serenade a 4 year old with “spent a night at the strip club”?", "class": "r/hiphopheads"}, {"text": "[SHOTS FIRED] \"You got a 100k floating around for info? Can’t no amount of money create skeletons that don’t exist... #ImUpset 🤣\" - Pusha T https://twitter.com/PUSHA_T/status/1002370704652800002?s=19\n\nhttps://i.imgur.com/vIctXR0.png \"The budget for this beef was 100k... we gave it all away\"\n", "class": "r/hiphopheads"}, {"text": "This pill popping culture needs to end now. We don’t need to Loose anybody else. link I've been on a path to educate people on benzodiazepine (Xanax, Klonopin, Valium, etc) withdrawals IRL and on the internet. **I really hope this post gets some attention because the info is important.**\n\n\n**Benzos and alcohol are the only two classes of drugs that can kill you when withdrawing from them.**\n\n\nI'll try to keep it simple. Benzos (and alcohol) work by making a neurotransmitter, GABA, more effective when it binds to the brain. GABA basically reduces how strong/powerful nerve impulses are, so when you're anxious and on edge, these drugs will sedate and chill you out by reducing the excitability of the brain cells associated with anxiety, muscle stiffness, etc.\n\n\nWhen you take both drugs for a long time and suddenly stop, you start with rebound anxiety. Your neurons start going into hyperactive mode because the GABA is less effective after you artificially strengthened them by taking Xanax and drinking a lot. A few days later, your brain starts going really hyperactive and you can experience things like delirium tremens, seizures, and die. **It's long suspected that rappers like Lil Wayne and G Herbo have had seizures due to benzo dependence.**\n\n\nWhat's worse? Benzos can cause post acute withdrawal symptoms that can start days or weeks after your last dose. You think you're fine and recovered until you start experiencing awful symptoms of anxiety, panic, tetany, and even seizures depending on how much you were dosing and how often. **I know from personal experience with friends who are still struggling with withdrawal issues 2 years after quitting.**\n\n\n**Xanax is not cool. Percocets are not cool.** They are big pharma literally making you dependent on them for life for $$$. No matter how much of a badass you think you are, you are absolutely fucked if you take these drugs for a long period of time. \n\n\nIf you are taking more than 4 mg of Xanax, 4 mg of Klonopin, or 40 mg of Valium a day, you can die if you miss your doses. **PLEASE GET HELP NOW**. Seriously, do not quit cold turkey. You need a professional to help you taper and when you do go get help, mention something known as the **Ashton Manual created by Dr. Heather Ashton**. It will limit your chance of seizing and dying by titrating your dose down.\n\n\nThere's a ton more info I can provide on this topic through my years of drug education and research. Please PM me if you need help. I'm very cognizant of drugs I put in my body and I whole heartedly believe that benzos are the next major epidemic for our generation and that the effects of this class of drugs are going to lead to way more issues than the opiate epidemic we have right now.\n\n\n&nbsp;\n\n&nbsp;\n\n\n\n\n**EDIT: I see this post is blowing up so I want to clarify a few things!**\n\n\n**1)** I'm not a licensed medical professional. I am an engineer with a lot of self-taught knowledge on psychology, neurology, and biochemistry. **The number 1 piece of advice for anyone who feels like they are in a serious situation is to go to a doctor. Check yourself into an inpatient ER if you need to. But make sure you discuss that you are fearing seizures/withdrawals and you need to be checked in and monitored**.\n\n\n**2)** I did not mean to downplay the severity of opiate withdrawals. There have been a few documented cases of opiate withdrawal related seizures and deaths. It is just far more likely to occur when withdrawing from GABAergic drugs. This means that sleeping pills, RC benzo/thienodiazepines (like Etizolam), GHB/GBL, barbiturates can all manifest themselves into benzo withdrawal symptoms. Please get help if you think you need it!\n\n\n**3)** I'm going to put together a list of resources and supplements in a document so I can post it here later. Please do not use it as medical literature, but it is there to help those of you who are really struggling at least cope a bit better. \n\n\n**4)** I know about fake presses, fent getting into pills, etc. I also understand Peep had a polydrug overdose. However, that doesn't take away from the fact that both drugs he took can be lethal by themselves. It also emphasizes the importance of not buying fake presses online and for harm reduction purposes, trying a small amount before dosing large quantities of pills.\n\n\n**5)** While I put together my resources, here are a few pointers that are quick wins:\n\na) CBD and Magnesium supplements helped me quite a bit. Everyone can be different but there is sound research out there supporting this. Calcium deficiencies may also cause some of your symptoms. The best idea is to get some lab work done to see if you are deficient.\n\nb) Do not go cold turkey if you're on any dose of benzos. Talk to your doctor before making any decision to stop taking your drugs.\n\nc) Beta blockers do a good job of stopping physical anxiety symptoms. They are also not habit forming and not addictive. Talk to your doctor about this.\n\n\n\n**REMEMBER: You all matter and deserve to break free from your demons. You're not alone in your battles and if you're struggling, know that you have amazing people ready to listen and support you even if it doesn't seem like it. Please find good providers who listen to you and use medical intervention when necessary. I've been getting tons of messages and trying to get back to all of them but if I miss yours, please don't feel bad! I'm extremely busy with life right now so I may not get to everything right away. Cheers people and stay safe :)**\n", "class": "r/hiphopheads"}, {"text": "Kanye tweets “My eyes are now wide open and now realize I’ve been used to spread messages I don’t believe in. I am distancing myself from politics and completely focusing on being creative !!!” The first tweet that sparked it said...\n\nKanye - “I introduced Candace to the person who made the logo and they didn’t want their name on it so she used mine. I never wanted any association with Blexit. I have nothing to do with it.”\n\nhttps://twitter.com/kanyewest/status/1057382888520499201?s=21\n\nSecond tweet which is in the title.\n\nhttps://twitter.com/kanyewest/status/1057382916760707072?s=21\n\nMore screenshots of Kanye’s earlier tweets talking a little about his beliefs. \n\nhttps://imgur.com/a/4kFoRMt [More tweets](https://twitter.com/kanyewest) (add these to the OP):\n\n>I support creating jobs and opportunities for people who need them the most, I support prison reform, I support common-sense gun laws that will make our world safer.\n\n>I support those who risk their lives to serve and protect us and I support holding people who misuse their power accountable.\n \n>I believe in love and compassion for people seeking asylum and parents who are fighting to protect their children from violence and war.\n\n>I would like to thank my family, loved ones, and community for supporting my ACTUAL beliefs and my vision for a better world.\n\n[TMZ story about the tweets as some new info](http://www.tmz.com/2018/10/30/kanye-west-donald-trump-used-blexit-candace-owens/).\n\n>Kanye contacted us to make it clear he did not mention Donald Trump in his tweets, and he's getting out of politics altogether.\n\n>As for being \"used\" ... he says he was specifically referencing Blexit, and that's it.\n\n", "class": "r/hiphopheads"}, {"text": "[Fresh Video] Kendrick Lamar - DNA. link I lowkey thought Q was bout to hit us with a verse.", "class": "r/hiphopheads"}, {"text": "[FRESH] Pusha T - THE STORY OF ADIDON ( Drake Diss) link Between the cover pic and the bars, this is a fucking bodybag. \n\nUnless Drake exposes Pusha as a pedophile or something, I don't see how he can come back from this. ", "class": "r/hiphopheads"}, {"text": "21 Savage says he saw guns & lights when then they arrested him and then said \"We got Savage.\" link [Full Interview](https://abcnews.go.com/GMA/Culture/video/rapper-fears-deportation-ice-arrest-61096248)", "class": "r/hiphopheads"}, {"text": "Kanye West and his family will compete on an upcoming episode of Family Feud link There's gonna be a bar in his next album about how we like to watch his family feud. \n\nYe Just doing it for the material.", "class": "r/hiphopheads"}, {"text": "Jaden Smith’s foundation is bringing clean water to Flint link This is incredibly unfair for those in Flint, and should’ve been prevented, with that said, we are where we are. We need to just keep working on replacing pipes. \n\nIt is an enormous task; so far > 8,000 pipes have been replaced to date, about 11,000 more are tasked to be replaced by mid-2019. \n\nProgress! It’s only getting better from here. ", "class": "r/hiphopheads"}, {"text": "Travis Scott Required NFL to Make Charitable Contribution in Super Bowl Halftime Deal link My least favorite trend in music journalism is when they refer to artists by their most popular song “the sicko mode star”\n\nI remember once they referred to Kanye as “the Fade rapper” like over a year after TLOP came out ", "class": "r/hiphopheads"}, {"text": "Mac Miller Dead at 26 link My worst fears for Mac have come true. His verse from “God Speed” has come to fruition:\n\n“They don’t want me to OD and have to talk to my mother\nTelling her they could have done more to help me\nAnd she’ll be crying saying that she’ll do anything to have me back”\n\nThis is so terrible. Gone way too soon. RIP Mac, he will live on through his music from this day forward.", "class": "r/hiphopheads"}, {"text": "[FRESH VIDEO] Drake - Gods Plan link More Drake and Antonio Brown dancing scenes", "class": "r/hiphopheads"}, {"text": "21 Savage Released on Bond Pending ICE Deportation Hearing link >[Turns out #21Savage was granted a bond, but will not been released from immigration custody until Wednesday morning. #ICE agents him arrested nine days ago.](https://twitter.com/PortiaFOX5/status/1095439024553160710)", "class": "r/hiphopheads"}, {"text": "LiL PeeP reported overdosed at Tuscon show https://www.reddit.com/r/G59/comments/7da0t7/dont_know_where_else_to_post_this_but_lil_peep/\n____________________________\n\nFINAL UPDATE : https://pbs.twimg.com/media/DOy3ycfVQAAD_Gx.jpg:large\n\nseeing alot of reports about this chick \"mariah being arrested for it\". This is alleged mind you, but I'm gonna post it here.\n\nAll information regarding mariah: https://everipedia.org/wiki/mariah-bons/\n______________________________________\n\nLiL PeeP died from a drug overdose at estimated 22:00 local time. For those of you that don't know, Lil Peep was a soundcloud rapper who blended alt rock with rap. His music helped alot of people through depression and other hard times. \n_______________________________\n\nIf you dont know who LiL PeeP is, heres one of his most popular songs https://www.youtube.com/watch?v=qwzQPh7dW_4 \n\nand a short interview: https://noisey.vice.com/en_uk/article/a3dedg/first-date-lil-peep-interview\n____________________________________________________\nFrom /u/theBindingOfAsac : \"Bus is caution taped off, fire and ambulance left, cops guarding bus, staff telling people not to record, threatening to take people's phones, saying recording is disrespectful\"\n\n\"Bexxy (one of PeeP's best friends) is outside the venue crying saying this ain't happening and he doesn't want to be alive\"\n\n\n___________________________________________________\nPlaces you can get help (please feel free to list what resources helped you, include country if it applies):\n\nhttp://pillreports.net/\n\nhttps://rollsafe.org/\n\nhttps://www.addaction.org.uk/\n\nUSA:\n\n[Substance Abuse and Mental Health Services Administration 24/7 helpline\n](https://www.samhsa.gov/find-help/national-helpline)\n\nUK: http://www.urban75.com/Drugs/helpline.html\n\nFrance:\n\nhttp://www.drogues-info-service.fr/\n\nAustralia: \n\n Crisis support and suicide prevention - https://www.lifeline.org.au/\n\n__________________________\n\ntweets (including underground artists):\n\nplayboi carti : https://twitter.com/playboicarti/status/931066783670329344\n\nlil uzi vert : https://mobile.twitter.com/LILUZIVERT/status/931261399027740672\n\nel-p :https://twitter.com/therealelp/status/931152572290711553\n\nbella thorne : https://twitter.com/bellathorne/status/931055012570021889\n\ndiplo : https://twitter.com/diplo/status/931058607596044288\n\nchxpo : https://twitter.com/CHXPO/status/931087036718768128\n\nclams casino : https://twitter.com/clammyclams/status/931070833308532737\n\nchetta : https://twitter.com/J_Chetta/status/931042719086055425\n\nmikey the magician : https://twitter.com/_MXTXM/status/931050442527772672\n\nkirblagoop : https://twitter.com/KirbLaGoop/status/931141069084987393\n\npouya : https://twitter.com/Pouyalilpou/status/931112507900645376\n\nxavier wulf : https://twitter.com/XavierWulf/status/931049934672994304\n\npewdiepie : https://twitter.com/pewdiepie/status/931092169133305856\n\nyung pinch : https://twitter.com/yungpinch/status/931054039206281216\n\nyung goth : https://twitter.com/yunggoth300/status/931045158941900801\n\ncoldheart : https://twitter.com/Coldh4rt/status/931053779427803136\n\nmackned : https://twitter.com/NedsWorld/status/931025176925372418\n\nrozz dyliams : https://twitter.com/ROZZDYLIAMS/status/931070603301236736\n\nj green : https://twitter.com/JGRXXN/status/931066401330118656\n\nomenxiii : https://twitter.com/omenxiii/status/931050855536648192\n\njuicy j : https://twitter.com/therealjuicyj/status/931062299632328705\n\nmakonnen : https://twitter.com/iLoveMakonnen5D/status/931078822560129024\n\n\nhorsehead : https://twitter.com/RealHorseHead/status/931061899201978368\n\nnedarb : https://twitter.com/NEDARBNAGROM/status/931055017695596544\n\nastari : https://twitter.com/astari/status/931043954337882112\n\ngetter : https://twitter.com/GetterOfficial/status/931067019608260608\n\nsimmie : https://twitter.com/275YUNGSIMMIE/status/931054984447299585\n\nshakewell : https://twitter.com/ShakeWell818/status/931067855524659200\n\nblack smurf : https://twitter.com/IAmHustleGod/status/931059533715329031\n\npete wentz : https://twitter.com/petewentz/status/931071510114050048\n\nmax beck : https://twitter.com/MaxDotBam/status/931052115945910272\n\ntravis barker : https://twitter.com/travisbarker/status/931058294495444993\n\nriff raff : https://twitter.com/JODYHiGHROLLER/status/931050717028036608\n\nbexey : https://twitter.com/BEXEYSWAN/status/931043873979187200\n\nbexey 2 : https://twitter.com/BEXEYSWAN/status/931057963787096066\n\nbexey 3: https://twitter.com/BEXEYSWAN/status/931068690564464645\n\nbexey 4 : https://twitter.com/BEXEYSWAN/status/931070038584582144\n\nbexey 5: https://twitter.com/BEXEYSWAN/status/931199459572162560\n\njoji : https://twitter.com/sushitrash/status/931053361323040768%5D(joji)\n\npost malone : https://twitter.com/PostMalone/status/931045155502661632\n\nlil yachty : https://twitter.com/lilyachty/status/931046326820884480\n\nnight lovell : https://twitter.com/nightlovell/status/931052100133498880\n\nmarshmello : https://twitter.com/marshmellomusic/status/931040657308651520\n\nlil pump: https://twitter.com/lilpump/status/931046396819529729?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet\n\nhttps://twitter.com/KenshinTravis/status/931052327116603392\n\nfather: https://twitter.com/father/status/931052240713932800\n\ngeorge orozco :https://twitter.com/George_Orozco/status/931051745358184448\n\nbobby raps : https://twitter.com/bobbyraps/status/931055523016749056\n\nruby da cherry : https://twitter.com/suicideLEOPARD/status/931056376054345729\n\nlil b : https://twitter.com/LILBTHEBASEDGOD/status/931056318340743168\n\nasap ant : https://twitter.com/ygAddie/status/931054070709633024\n\ndenzel curry : https://twitter.com/denzelcurry/status/931055214370549760\n\nyung bans : https://twitter.com/YUNGBANS/status/931053412761907200\n\nty dolla sign : https://twitter.com/tydollasign/status/931054288670924800\n\nmelon : https://twitter.com/theneedledrop/status/931051199389978624\n\nfat nick : https://twitter.com/_FatNick/status/931052685800935424\n\n\n____________________________\n\n\"Guys CSI and Coroner just showed up, sorry everyone\" Seems like PeeP is dead. I'll edit if he isnt but atm im heartbroken. please pm me if you have any info regarding his life status\n__________\nhttps://imgur.com/CNmWx8b\n\nhttps://imgur.com/zhwzGOG\n\nhttps://imgur.com/HBatGbU\n\n\n\n__________________\n\nhttps://youtu.be/b7F8HNxSjMY video of coroners going through his tour bus\n\nhttps://www.youtube.com/watch?v=JHXsAiFusac video of corner van driving awy\n\n___________________\n\nif you are struggling with drug addiction or mental illness please seek help, there are many resources and people out there who can help you. i love you all im sorry to bring you this news thank you to /u/theBindingOfAsac for all the informatrihon. please dont post disrespectful comments im trying to read all the comments and the people that are hurting from this dont want to read your hate.\n_______________\n\nhere are some of my favorite peep song, they helped me through lot\n\nhttps://youtu.be/mxHxEEGN9KM\n\nhttps://youtu.be/heJNHYCSsIc\n\nhttps://youtu.be/1OW9K84EbU4 \"ive got a feeling im not gonna be here for next year\"\n\nhttps://youtu.be/ZzdtFiq36XI\n\nhttps://youtu.be/Y8dihA5xuKg\n\n__________________________\n\n/u/fluorideboyzzz \"I live in AZ. Word on the street is he got counterfeit M-Box 30mg oxycodones and mixed with benzos, down here almost every 30 is counterfeit and full of fentanyl. Never seen an MBox30 that isn't fent.\"\n\n_____\n\nAfter 10 hours of updating, im not updating this anymore. PM me if you really want something added to the post, but I'm not going to be reading comments anymore. Thank you for anyone who showed support to peep and his family.\n\n Please keep your disrespectful comments to yourself.\n\nThank you to OP for keeping us updated.\n\nRIP", "class": "r/hiphopheads"}, {"text": "[OFFICIAL] Mac Miller Memorial Thread This is the official memorial thread for Mac Miller\n\n- **There will be zero tolerance for disrespectful comments in this thread.**\n- All songs by the artist and non-news posts about the artist (e.g. reactions, tributes, etc.) should be posted within this thread, any posted outside of this thread will be removed whether or not they violate subreddit rules.\n\nR.I.P Mac Miller, 1992 - 2018  \n\n\n**UPDATE 9/12**:\n\n[Mac Miller Vigil in BSP](https://www.youtube.com/watch?v=aYQrwXdRNHY)\n\n[Kendrick Lamar speak on Mac](https://twitter.com/ComplexOpenLate/status/1039985229828698113)\n\n**UPDATE**:\n\n[Shane Powers says goodbye to Mac](https://soundcloud.com/shaneshow/091018-shane-says-goodbye-to-mac-miller)\n\n[Earl Sweatshirt - Mac spirit allowing me to fuck with my music rn and im THANKFUL](https://twitter.com/earlxsweat/status/1039086608740315136)\n\n--\n  \n[Wiz Khalifa - Praying for Mac’s family and that he rest easy 👼🏽 #pgh #412](https://twitter.com/wizkhalifa/status/1038159375301402624)  \n  \n[Jaden Smith - \"Long Live Mac Miller, Rest In Peace We Love You](https://twitter.com/officialjaden/status/1038165566521978881)  \n  \n[Chance the Rapper - \"I dont know what to say Mac Miller took me on my second tour ever. But beyond helping me launch my career he was one of the sweetest guys I ever knew. Great man. I loved him for real. Im completely broken. God bless him.\"](https://twitter.com/chancetherapper/status/1038165803370270720)  \n  \n\n[Soulja Boy - \"RIP Mac Miller 🙏🏽\"](https://twitter.com/souljaboy/status/1038170342697533440)  \n  \n\n[Rex Orange County - \"this is incredibly sad. mac miller was a great person and my friend rip :(\"](https://twitter.com/rexorangecounty/status/1038170482355392512)  \n  \n\n[JPEGMAFIA - \"RIP Mac Miller. I can’t believe this shit\"](https://twitter.com/darkskinmanson/status/1038170279921381378)  \n  \n\n[Q-Tip - \"Damn.... @MacMiller we worked pn sum fire a while back he had tribe tatooed on his arm. Super sweet dude man. Comfolences to his fam 🙏🏽🙏🏽\"](https://twitter.com/QtipTheAbstract/status/1038170997504008196)  \n  \n\n[Shawn Mendes - \"Unreal. So sad. RIP Mac Miller ❤️\"](https://twitter.com/ShawnMendes/status/1038167188203397120)  \n  \n\n[J. Cole - \"Rest In Peace to the great soul Mac Miller\"](https://twitter.com/JColeNC/status/1038171577110544385)  \n  \n\n[YBN Nahmir - \"I remember staying up late af & always hearing “Donald Trump” by @MacMiller on @MTV at like 5AM when I was younger. Sad to see a legend pass away.\"](https://twitter.com/YBNNahmir/status/1038171789430587397)  \n  \n\n[Alison Wonderland - \"RIP Mac Miller 😔](https://twitter.com/awonderland/status/1038171474937434114)  \n  \n\n[Skyzoo - \"RIP to the homey @MacMiller. Super cool dude who was a good friend and a true hip hop head. Always showed wild love when we’d link. Smh.\"](https://twitter.com/skyzoo/status/1038171944754061313)    \n  \n\n[Father - \"RIP Mac man, what the fuck\"](https://twitter.com/father/status/1038165548847136768)  \n  \n[Earl Sweatshirt - \"bro plz\"](https://twitter.com/earlxsweat/status/1038164300362203136)/[\"THE MAN WAS TOO GENEROUS ! HE EXTENDED HIS HOME TO ALL OF US . PEACE TO THE MILLER FAMILY AND THE WHOLE EXTENDED FAMILY. WE HURTIN\"](https://twitter.com/earlxsweat/status/1038175960707657729)  \n  \n[Domo Genesis - \"My heart is broken af, that’s my fucking bro man.\"](https://twitter.com/DamierGenesis/status/1038170479192768513)  \n  \n[Zack Fox - \"we all felt supported and loved by Mac and that’s incredible, thank you for supporting me, thank you for the music, we was just roasting russ, I told you to go on a date with betty white to make everybody mad, enjoy your peace brother\"](https://twitter.com/zackfox/status/1038171406347857920)  \n  \n[ZOMBIE Juice - \"Dam Rip Mac Always showed us  love\"](https://twitter.com/ZOMBIEJuicee/status/1038172855089995777)  \n  \n[Desus Nice - \"Rip Mac Miller. Damn\"](https://twitter.com/desusnice/status/1038169422333206530)  \n  \n[ICYTWAT - \"man, i deadass smoked my first or second blunt to k.i.d.s at 12 lmao hiding in my backyard playing that shit off my zune mp3 :-( rip Mac.\"](https://twitter.com/ICYTWAT/status/1038169095039053824)  \n  \n[AKTHESAVIOR - \"Rip to the young legend Mac miller thanks for all the love you showed us man can’t believe this shit. Our generation needs to open up there eyes and see there’s only one ending result to drug abuse and there’s no coming back. I love all of you. Tired of loosing our leaders to drugs.\"](https://www.instagram.com/p/BncFzgqAOJW/?utm_source=ig_twitter_share&igshid=klic83fwxq0m)  \n  \n[Mick Jenkins - \"peace be on his closest friends and loved ones..rip Mac\"](https://twitter.com/mickjenkins/status/1038165397806219267)  \n  \n[Pusha T - \"😔🙏🏿 #RIP @MacMiller\"](https://twitter.com/PUSHA_T/status/1038171078928097280)  \n  \n[Joey Fatts - \"@MacMiller RIP Bro, was just by the old crib yesterday. You will be missed.\"](https://twitter.com/JoeyFatts/status/1038164575160393728)  \n  \n[Logic - \"Mac I Love You! You were a huge inspiration on my come up. Thank you for the countless hours of fun listening to your music with my homies! This has me so fucked up! You will be missed and always remembered #KIDS\"](https://twitter.com/Logic301/status/1038174899142107136)  \n  \n[El-P - \"oh man. rest in peace Mac Miller.\"](https://twitter.com/therealelp/status/1038167519004188672)  \n  \n[Bodega Bamz - \"Wowowowowowowowowoowowow DAMN MAC\"](https://twitter.com/BodegaBAMZ/status/1038166139338153986)  \n  \n[Casey Veggies - \"Rest Easy @MacMiller aka MAC Meezy. Can’t believe I’m typing this. This one hurt bad..you really like a brother to me. I’ll never forget you bro, You will live forever. 🙏🏽\"](https://twitter.com/CaseyVeggies/status/1038163959612751872)  \n  \n[Post Malone - \"God fucking dammit. You were such an incredible person. You changed so many lives. Had so much love in your heart. You inspired me throughout highschool, and I wouldn't be where I was today without you. Never a more kind and sincere and beautiful person. I fucking love you mac.\"](https://twitter.com/PostMalone/status/1038172663301066753)  \n  \n[The Internet - \"Love you brother. you gave so much to this world. Rest easy Malcolm.\"](https://twitter.com/intanetz/status/1038166287703261186)  \n  \n[Lupe Fiasco - \"RIP Mac Miller Condolences to your family and friends. May God have mercy on your soul.\"](https://twitter.com/lupefiasco/status/1038176679200542720?s=21)  \n  \n[Future - \"My guy MAC MILLER...rest up bro 🙏🏿\"](https://twitter.com/1future/status/1038176657452937216)  \n  \n[Rich Brian - \"This is unbelievable. RIP Mac Miller, thank you for your beautiful work while you were here, this shit has got to stop happening.\"](https://twitter.com/richbrian/status/1038176825879420928?s=21)  \n  \n[Bun B - \"I just talked to this kid like 3 weeks ago. This is so fucked up. Such a talented guy. Always had great energy. God bless you Mac. Rest In Peace.\"](https://www.instagram.com/p/BncFjHzgXmA/?utm_source=ig_twitter_share&igshid=1ouks8qw1bcyr)  \n  \n[Da$h - \"Took this picture when I saw you a 2 weeks ago. I love you dawg. Can’t ever thank you enough for being you. See when I get there.\"](https://www.instagram.com/p/BncJMRRFg0R/?utm_source=ig_web_button_share_sheet)/[\"MALCOLM IS SOME ONE I COULD NEVER THANK ENOUGH FOR BEING WHO HE WAS AND LOOKING OUT THE WAY HE DID. IM GOING TO MISS HIM EVERYDAY. Q, JIMMY, PEANUT SEND MY LOVE TO YALL NIGGAS.   MACWORLD.\"](https://twitter.com/heirdash/status/1038192066705022976?s=21)  \n\n  \n[Joey Bada$$ - \"Breaks my heart every time we lose one... I will forever appreciate you bro you supported me and gave me a shot from the very beginning. Because of you a 17 year old and his friends from Brooklyn got to play in front of 5000 after a day of school. That shit changed my life. I wish we got to hang out more and make more music.... Life is way too short appreciate everyone every moment. ❤️ R.I.P. MAC MILLER\"](https://www.instagram.com/p/BncH2S6BX1G/?utm_source=ig_web_button_share_sheet)  \n  \n[Aminé - \"you always congratulated me on the little shit i did and made me feel great about my work. i can’t believe this right now. a true artist and true friend. you will be remembered as one of the greats. love you mac, rest easy.\"](https://www.instagram.com/p/BncGwNugjR9/?utm_source=ig_web_button_share_sheet)  \n  \n[A-Trak - \"I'm really hurting. Mac always showed love. He was always supportive and genuinely curious. I can't believe it. We just spoke last weekend. I loved watching his growth, this guy could do anything he wanted musically. Please watch his NPR Tiny Desk concert it's so good. 💔💔💔💔 RIP\"](https://www.instagram.com/p/BncG2tLAgyY/?utm_source=ig_web_button_share_sheet)  \n  \n[Jonwayne - \"Don't read the news.  Read this.  This is the man I knew.\"](https://twitter.com/jonwayne/status/1038174744061739009)  \n  \n[A$AP Rocky - \"REST IN PEACE KING, LOVE BROSAY 🙏🏿\"](https://www.instagram.com/p/BncHJn5gZJ1/?hl=en&taken-by=asaprocky)  \n  \n[Lil Xan - \"I don’t wanna do this shit no more,rest in peace to my hero\"](https://www.instagram.com/p/BncFKaNnlGB/?utm_source=ig_embed)  \n  \n[Snoop Dogg - \"So sad u gone home young Mac I had to post this to smile and think about the good Time we had on the set of this movie man god bless ya family. Pittsburg we lost a real one today 🌟 @macmiller 🙏🏾\"](https://twitter.com/snoopdogg/status/1038180214851788801?s=21)  \n  \n[Open Mike Eagle - \"goddamn. rest in peace Mac Miller\"](https://twitter.com/mike_eagle/status/1038179838740185088?s=21)  \n  \n[?uestlove - \"Mac was one of the nicest, coolest dudes man. This is sad man.\"](https://twitter.com/questlove/status/1038162610926088193)  \n  \n[Kehlani - \"WE WERE SUPPOSED TO GO TO OHANAS THIS WEEK I WAS SUPPOSED TO COME THIS WEEKEND WE WERE SHOOTING YOUR VIDEO NEET WEEK WE HAD TO FINISH YOUR NEW FAVORITE SHOW NO NO NO NO U GOT THE SATURN TATOO AFTER I DID UR CHART THIS IS TOO MUCH\"](https://twitter.com/Kehlani/status/1038164407388319744)  \n  \n[Chevy Woods - \"Wow bro ... Rest easy @MacMiller Damn cuz 😢](https://twitter.com/CHEVYWOODS/status/1038165739373379584)  \n  \n[Solange - \"Rest in your peace Mac Miller. \nAlways exuded so much kindness and goodness.  \nThank you for sharing your gifts with us all.\"](https://twitter.com/solangeknowles/status/1038172867739836416)  \n  \n[Lil Dicky - \"so sad. mac miller was a great dude. when i began my career he went out of his way to talk to me on the phone and give me advice. an amazing artist and human being\"](https://twitter.com/lildickytweets/status/1038173033423233024)  \n  \n[Alessia Cara - \"shocked & sad about Mac Miller. such a talented guy with so much life ahead. RIP.\"](https://twitter.com/alessiacara/status/1038170492639895555)  \n  \n[Khalid - \"this hurts my heart man RIP bro @MacMiller\"](https://twitter.com/thegreatkhalid/status/1038163221914431489)  \n  \n[Swae Lee - \"Woke up to some bullshit RIP Mac Miller\"](https://twitter.com/goSwaeLee/status/1038165526084808704)  \n  \n[Russ - \"Damn wtf...rip Mac miller\"](https://twitter.com/russdiemon/status/1038165164204457984)  \n  \n[A$AP Ferg - \"Rest in Paradise. You embraced me before I was I was signed. You brought a Belt I made back in the days and linked me with “Daily breads “ to do a collab with your friends brand. I hope you felt no pain in your transition! Love always. Very sad news\"](https://www.instagram.com/p/BncGZP9HgiF/?hl=en&taken-by=asapferg)  \n  \n[MadeInTYO - \"I love you brother .... you gave me good advice & you was my friend & you jumped on my album  I miss you bro , I really doooo , this one is really never gonna feel the same. you told me to come over this week but I was in Paris .... I’m sorry ... I wish I was around more bro ... Malcolm I love you ! Pray for the world & Mac’s family !\"](https://www.instagram.com/p/BncF22bBwYO/?hl=en)  \n  \n[Bebe Rexha - \"I am so deeply saddened to hear of the passing of @MacMiller. Sending love and light to all of his friends, family and fans.\"](https://twitter.com/BebeRexha/status/1038179132272721920)  \n  \n[Cher Lloyd - \"I’m lost for words. This is such shocking news. We’ve lost another true talent. Rip Mac Miller\"](https://twitter.com/CherLloyd/status/1038180292446642176)  \n  \n[Lil Yachty - \"Rest In Peace Big Mac. Amazing Energy. solid & postive. So many things we was pose to do... one day we still will brother....Live on brother !!!!!!!\"](https://www.instagram.com/p/BncHMpKhPBf/?utm_source=ig_embed)  \n  \n[Juicy J - \"I’m so fucked up right now this is so sad I can’t believe it  R.I.P. MAC MILLER\"](https://twitter.com/therealjuicyj/status/1038169032371798016)  \n  \n[John Mayer - \"I’m so sad that you couldn’t stay, Mac. I’m so terribly sad.\"](https://www.instagram.com/p/BncKT3Hn9Jl/?utm_source=ig_embed)  \n  \n[Miguel - \"Man, I don’t want this to be true. Mac was ALWAYS good energy. INSANELY talented and never got the credit he deserved. The utmost love for you Mac man. Sending my love and condolences to your mom, the sweetest ever, and your family and friends. Lightwaves on your journey my friend 🙏🏾🖤🖤🖤\"](https://www.instagram.com/p/BncLyH4h2TS/?utm_source=ig_embed)  \n  \n[Ugly God - \"Remember when Mac dropped his Album the same night Astroworld dropped and yall were saying “y’all hear sum?” “who still listens to him” & “tell him keep it”? We had a whole convo about it & he literally told me if he died people would act like they never said it. fuck yall. RIP.\"](https://twitter.com/UglyGod/status/1038175850275975169?s=20)  \n  \n[Kid Cudi - \"Really fucked up about Mac\"](https://twitter.com/KidCudi/status/1038181990015459328)  \n  \n[Peter Rosenberg - \"No words for how much I loved this kid...so much on my mind ...and so many others...he was SUCH A PART of this hip hop world we all take part in...he was such a sweet person...and he was year by year becoming more and more of a complete musical genius....I could go on forever about why this hurts so many people so badly....but plain and simple...I love you bro...we all did..see you on the other side\"](https://www.instagram.com/p/BncH_iZB3G2/?utm_source=ig_web_button_share_sheet)  \n  \n[Westside Gunn - \"FUUUUUUUUCK HOMIE!!!! Guess Now they’ll give u your Roses smh a true musician, we lost a GREAT 1 and you still have the Illest Shit Out 🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾 #RIPMACMILLER Fun Fact he heard me and Conway was the illest and invited us right over had a good time wit the Homie you’ll be missed\"](https://www.instagram.com/p/BncEj3ynYNr/?utm_source=ig_web_button_share_sheet)  \n  \n[Lucki - \"Rest In Peace\"](https://twitter.com/LUCKI6BELOW/status/1038170593567420416)  \n  \n[Chief Keef - \"R.I.P my dude aka LFisherman BKa Mac Miller\"](https://twitter.com/ChiefKeef/status/1038185690159173632)  \n  \n[Curren$y - \"Damn bruh u fucked errbody day up ... love u my young homie!\"](https://twitter.com/CurrenSy_Spitta/status/1038185040402935808)  \n  \n[Fashawn - \"Rest easy Mac. 😢\"](https://twitter.com/fashawn/status/1038186548091486208?s=21)  \n  \n[Chuck Inglish - \"I love you Man.   I always called to check on u.  You were my lil brother... I wish I had a pass w god to give u another chance.   I’m not ready for u to be gone bro.. I’m hurt.\"](https://twitter.com/Chuckisdope/status/1038169621432397824)  \n  \n[Jay Electronica - \"May Allah be pleased w Mac Miller. He was a brother and friend of mine. This news has saddened me.\"](https://twitter.com/JayElectronica/status/1038184302394175489)  \n  \n[Pouya - \"how much more can we take\"](https://twitter.com/Pouyalilpou/status/1038177422166962176)  \n  \n[Abra - \"pure hearts don't die\"](https://twitter.com/abra/status/1038177841953890306)  \n  \n[Evidence - \"Fuck\"](https://www.instagram.com/p/BncKS8XAJ_b/?utm_source=ig_share_sheet&igshid=1nhs2fybyi95z)  \n  \n[Kevin Abstract - \"Fuck man\"](https://twitter.com/kevinabstract/status/1038171722728579073?s=20)  \n  \n[J.I.D. - \"fuck we just lost a full musical genius and a great person, sending prayers and love to his family.. tell someone you love them today\"](https://twitter.com/jidsv/status/1038198547433193472?s=21)  \n  \n[Lil B - \"Mac miller my brother I love you - Lil B\"](https://twitter.com/lilbthebasedgod/status/1038203251945074691?s=21)  \n  \n[Seth Rogen - \"RIP Mac. I was texting with him one week ago about trying to be in his video, which was so nice and exciting because I was a fan of him as an artist and a person. This is surreal and terrible.\"](https://twitter.com/Sethrogen/status/1038251733367971840)  \n  \n[Joe Budden - \"I’m really fucked up over Mac’s passing. Prayers to his family, loved ones and fans… Rest In Peace @MacMiller\"](https://twitter.com/JoeBudden/status/1038194060622802944)  \n  \n[Robb Bank$ - \"RIP MAC MILLER\"](https://twitter.com/RobbBanks/status/1038242993554247680)/[\"A LEGEND AND AN INSPIRATION FOR ME TO MAKE CALENDARS](https://twitter.com/RobbBanks/status/1038243222135496704)  \n  \n[Tyler, the Creator - \"rest easy macaroni\"](https://twitter.com/tylerthecreator/status/1038449297409245184)  \n  \n[Pharrell - \"Can’t believe it was six years ago, we were working in Miami on Pink Slime. I just wanted to make the hardest records with you. And then I discovered you could sing too. And I kept telling you you could sing, but you didn’t want to hear it. And your latest project has all the singing... Very happy for you, but can’t believe that this is the moment I got to tell you that. Sending deepest condolences to your family. RIP Mac Miller.\"](https://www.instagram.com/p/Bncuj8IBqRF/)  \n  \n[Maxo Kream - \"RIP bro we just met at a Cole concert and I wanted to get you on my next album. Fightin dese demons not easy tell my nicca Fredo I love em\"](https://www.instagram.com/p/BnceSkBBvKs/)  \n  \n[Christian Clancy - \"i don’t know what to say. it’s not real yet. you were more alive recently than i’ve seen in awhile. i feel like u kept things away from me at times, which ud never admit, but the shift was palatable.. it felt real... the clarity and purpose in your voice about life and ur future... joking about how close ur abs were to a 6 pack (debatable)..... perfect? no. who is. but the demons weren’t steering and the smiles were genuine. maybe at least until u were alone. you were as selfless a human being as i’ve ever known. everyone else’s happiness came first. never rocked the boat. maybe u should of. but that wasn’t ur style. my favorite thing about you is how u treated chloe. that said everything. i think youth had that innocence you craved, free from all the heaviness inside you.. the heaviness that got you. it’s a lesson for those of us that cook our emotions on the inside. a lesson to those who still feel invincible. this is gonna take awhile. you were an incredible human with an incredible family and friends who were all excited about the path you were on. you were so proud of “swimming” - it was the album you wanted to make. u did that and it’s brilliant. i’m heartbroken. i’m angry. but i love you and im gonna feel instead of cook this time. i’m grateful to have known such a beautiful human being whose main goal in life outside of his art was to make everyone around him ok. love u, malcolm.\"](https://www.instagram.com/p/BneN1yOBACL/)  \n  \n[Nardwuar - \"R.I.P. Mac Miller. Gone far too soon.\"](https://www.instagram.com/p/Bncsd3NHFFF/)  \n  \n[The Kid Mero - \"RIP HOMIE YOU COULD TAKE A JOKE AND U WERE A REAL ASS HUMBLE DUDE. BLESS\"](https://www.instagram.com/p/BncfANIgI9d/)  \n  \n[Clams Casino - \"RIP Mac! There are a lot of special memories and good times I will have in my heart forever...thank you for all of those. Mac always stood out to me because he was a genuinely kind and down to earth person that would go out of his way to look out for people. I’m happy for the music we made together and thank you for impacting so many peoples lives.\"](https://www.instagram.com/p/BncmKNigKG1/)  \n  \n[MixedByAli - \"Woke up sick thinking damn how could I have helped. Can’t believe this . Until we meet again my boy . I’m sorry\"](https://www.instagram.com/p/BneBjy2lO40/)  \n  \n[Vince Staples - “I must’ve died and went to heaven...currently in shock it’ll hit me in a second. What’s your question? You need a blessing right? Or you just wondering what heavens like.” I’ll see you soon. Thank you for everything... for all of this. I love you.](https://www.instagram.com/p/BncmUd-n3dG/)  \n  \n[Julia Kelly - \"Today I gained the most beautiful angel. My heart is hurting. Shattered. Today I lost one of the most amazing humans that has ever entered my life. Malcolm McCormick, I would give anything to have you back. Our memories will never be erased. I am forever grateful for you. Thank you for your laughter and endless amounts of love. You brought me out of my shell and broke me free from my shyness. The most gentle soul. Your mind was like no other. Waking up next to you was a dream. Thank you for always making me feel at home. I’m going to miss your sweet forehead kisses and affection. I would give anything to talk to you one last time and express my love. I love you forever, Malcolm.\"](https://www.instagram.com/p/Bncah67l2Hq/)  \n  \n[Asher Roth - \"this one hurts\"](https://twitter.com/asherroth/status/1038175625473740800)  \n  \n[The Weeknd - \"Rest In Peace Mac Miller. It’s a sad day.\"](https://twitter.com/theweeknd/status/1038200179265024000)  \n  \n[Tory Lanez - \"R.I.P Mac wtf !!!!!! Too soon man too fucking soon !!!! This is unreal\"](https://twitter.com/torylanez/status/1038164188462546944)  \n  \n[YG - \"RIP MAC MILLER\"](https://twitter.com/YG/status/1038190985501495296)  \n  \n[Rapsody - \"I love you always, Mac! Forever the most dope. Thank you for helping to change my life. And so many in this culture. .....so unreal.\"](https://twitter.com/rapsody/status/1038276720250507265)  \n  \n[Machine Gun Kelly - \"Mac. this just fucked us all up. u were too rare...damn. from eating frozen chicken wings in my basement to ur voice speaking to a generation. u did it homie. wish this wasn’t even a conversation. @Innerviewq i love u and am here for u.\"](https://twitter.com/machinegunkelly/status/1038171637529694210)  \n  \n[Ty Dolla $ign - \"I don’t know if people get what these comments will do to a person . Y’all talk so much shit behind a fake account and never show your face . Rip my brother Mac life is too short . Tell someone u love them today . Please\"](https://twitter.com/tydollasign/status/1038450163784798208)  \n  \n[Rich the Kid - \"Rip Mac Miller\"](https://twitter.com/richthekid/status/1038185865011286016)  \n  \n[Carnage - Love you brother @MacMiller\"](https://twitter.com/djcarnage/status/1038181855592296448)  \n  \n[Loaded Lux - \"👁♥️\"](https://www.instagram.com/p/BncokMwAK1I/?utm_source=ig_twitter_share&igshid=11yiu5stoh36g)  \n  \n[Charlamagne the God - \"I had a lot of great conversations with this young man on and off air. All we did was clown each other. Even deep convos ended with a joke. Rest Easy To My Pal Mac.\"](https://www.instagram.com/p/BncYUXnFabe/?utm_source=ig_twitter_share&igshid=1ohhdots9yfnu)  \n  \n[Angela Yee - \"Heartbroken to hear the news about Mac Miller. My condolences to his family and loved ones, and I feel blessed to have known him\"](https://www.instagram.com/p/BncecavnYaj/?utm_source=ig_twitter_share&igshid=8iga4o0i4w1p)  \n  \n[Diplo - \"My first day on tour in Australia I saw Mac in the lobby .. he was having a small fling with one of my dancers and asked her to dye his hair pink before tour started.. and then he wrote this dope song called pink bathwater (one of thousand songs you probably will never hear) . He drank whiskey at major lazer after-party is til 4 am.. went back to festival at midday .. played piano like Mozart with the sun blazing down on him.. throw up on stage . Cry a bit, rap some more then pass out in the grass and text me a few hours like where we going next .. next five years I see this guy everywhere .. best people I could always count on.. we made a lot of music in my first studio in Burbank.. he kept getting better and better .. this dude lived so hard was so amazing and talented and still extremely missunderstood.. another video is me and @skrillex on New year's Eve at MSG and Mac just came out at midnight like he was he headliner in his Riddler suit. Fuck I couldn't stop laughing .. he was always there in the middle of the best moments .. and if there wasn't a vibe he created it and made the room brighter .. he radiated positivity, but there wasn't a balance.. the other side was he was deeply insecure and always found substitution for what was missing in his life .. For a second think about the people around you and make sure they are always aware of the love .. don't take a second forgranted. They might need you and you don't even notice it because your too busy .. always gonna love you Mac\"](https://www.instagram.com/p/Bncn-NpgdZL/?hl=en&taken-by=diplo)\n\n____\n\nVideos:\n\n[J. Cole in concert dedicating \"Love Yourz\" to Mac.](https://www.youtube.com/watch?v=57G7Laxopzw)\n\n[*Watching Movies With The Sound Off* Visual Album](https://vimeo.com/202080451) by /u/Chadbraham. \"imma live forever cause a legend never dies\" RIP.", "class": "r/hiphopheads"}, {"text": "Vince Staples announces \"Mac Miller: A Celebration of Life\" on October 31 -- a show with performances by Vince, Travis Scott, Earl, Chance, Q, SZA and more https://twitter.com/vincestaples/status/1047186005525032960\n\n**Date:** October 31\n\n**Location:** The Greek Theatre, LA\n\n**Alphabetical order:**\n\nAction Bronson\n\nAnderson Paak\n\nChance the Rapper\n\nDomo Genesis\n\nDylan Reynolds\n\nEarl Sweatshirt\n\nJID\n\nJohn Mayer\n\nMiguel (can't believe i didn't notice him at first ffs)\n\nNjomza\n\nScHoolboy Q\n\nSZA\n\nThundercat\n\nTravis Scott\n\nTy Dolla $ign\n\nVince Staples\n\n... and more I really hope they have a livestream for this. Miss you Mac, forever one of my favourite rappers/people ❤", "class": "r/hiphopheads"}, {"text": "R. Kelly Dropped by Sony Music link \"We at Sony have zero tolerance for sexual abuse as long as the public outrage is big enough to where it might hurt our image.\"", "class": "r/hiphopheads"}, {"text": "Common Free styling in the streets of New Orleans link What a beautiful display of hip hop.", "class": "r/hiphopheads"}, {"text": "[FRESH ALBUM] Young Thug - So Much Fun [APPLE MUSIC](https://music.apple.com/us/artist/young-thug/81886939) | [SPOTIFY](https://open.spotify.com/album/1bnHPO4dKK7IjvgrtVBcQh) | [TIDAL](https://listen.tidal.com/album/115464504) | [YOUTUBE](https://www.youtube.com/watch?v=bIyXEs2TBFs&list=PLHiCeIV7logH_Nf2mcCTrDHWUulnHYU-F)\n\n---\n\n#TRACKLIST\n\n1.\t**Just How It Is** [prod. Wheezy]\n\n2.\t**Sup Mate** (feat. Future) [prod. ATL Jacob & DY Krazy]\n\n3.\t**Ecstasy** [prod. DY Krazy & 12 Hunna]\n\n4.\t**Hot** (feat. Gunna) [prod. Wheezy]\n\n5.\t**Light It Up** [prod. Pi'erre Bourne]\n\n6.\t**Surf** (feat. Gunna) [prod. Pi'erre Bourne]\n\n7.\t**Bad Bad Bad** (feat. Lil Baby) [prod. Wheezy]\n\n8.\t**Lil Baby** [prod. Pi'erre Bourne]\n\n9.\t**What's The Move** (feat. Lil Uzi Vert) [prod. BL$$D & Chef]\n\n10. **I Bought Her** (feat. Lil Duke) [prod. DJ Durel]\n\n12. **Jumped Out The Window** [prod. Supah Mario]\n\n13. **I'm Scared** (feat. 21 Savage & Doeboy)[prod. Pi'erre Bourne]\n\n14. **Cartier Gucci Scarf** (feat. Lil Duke) \n\n15. **Big Tipper** (feat. Lil Keed) [prod. TM88 & Southside]\n\n16. **Pussy** [prod. TM88, PyrexTurnMeUp & Southside]\n\n17. **Circle Of Bosses** (feat. Quavo) [prod. Wheezy]\n\n18. **Mannequin Challenge** (feat. Juice WRLD) [prod. J. Cole & T-Minus]\n\n19. **Boy Back** (feat. NAV) [prod. Mustard]\n\n20. **The London** (feat. J Cole & Travis Scott) [prod. T-Minus]\n\n---\n\n[Hi resolution cover art](http://press.atlanticrecords.com/wp-content/uploads/2019/08/SMF-PA-Uncompressed.jpg) Wouldn't be a solid Thugger album without those \"?\"s in the RapGenius lyrics lmaooo", "class": "r/hiphopheads"}, {"text": "Joey Badass settles the rumor of him being blinded by the eclipse link Holy shit lmfaooooooo", "class": "r/hiphopheads"}, {"text": "Lil Wayne Carter V Website Coundtown!!! link [IMPORTANT VIDEO](https://www.youtube.com/watch?v=pKWrzGKZoaQ)\n\nALBUM ON FRIDAY", "class": "r/hiphopheads"}, {"text": "Meek is Free link A statement from the man himself\n\n[I’d like to thank God, my family, and all my public advocates for their love, support and encouragement during this difficult time. While the past five months have been a nightmare, the prayers, visits, calls, letters and rallies have helped me stay positive.] (https://twitter.com/MeekMill/status/988871657111498752)\n\n[To the Philly District Attorney’s office, I’m grateful for your commitment to justice. I understand that many people of color across the country don’t have that luxury and I plan to use my platform to shine a light on those issues.] (https://twitter.com/MeekMill/status/988871671565008896)\n\n[In the meantime, I plan to work closely with my legal team to overturn this unwarranted conviction and look forward to reuniting with my family and resuming my music career.] (https://twitter.com/MeekMill/status/988871793032118272)\n\n[mirror] (https://i.imgur.com/0fHvKkR.png)\n\nRinging the [bell] (https://streamable.com/b636v) before the 76ers/Heat game tonight\n\n76ers win!", "class": "r/hiphopheads"}, {"text": "[Potentially Misleading] Donald Glover allegedly stole \"This Is America\" from another artist Here is the song in question, American Pharaoh by Jase Harley: https://www.youtube.com/watch?v=whcr-JiOJCA&feature=youtu.be\n\nSoundcloud mirror: https://soundcloud.com/jaseharley/american-pharaoh-produced-by-jase-harley\n\nObviously, here is This Is America: https://www.youtube.com/watch?v=VYOjWnS4cMY\n\n**Fam Rothstein, from Gambino's team, has responded to the allegations and claims This Is America has been under wraps for around 3 years: https://twitter.com/famlikefamily/status/1011244111754506240**\n\nhttps://imgur.com/Vp2elrl\n\n**\"The internet is a place of no consequences. I hate that every Toronto Akademiks/white blogger can say something as gospel and y'all take it. This song is 3 years old, and we have Pro Tools files to prove it. But fuck you and your moms, and your future fetuses. Stay blessed.\"**\n\nJase Harley has commented on the matter himself, no animosity. Just wishes he could've gotten a shoutout:\n\nhttps://i.imgur.com/W8gtyCo.png\n\n\"lol word a shout out would be cool 🤷🏾‍♂️ all good tho.. he’s a great artist, dope I could’ve had some influence on the record\"\n\nhttps://i.imgur.com/tJtRydc.png\n\n\"I always felt my song inspired it lol from the first time I heard it\"\n\n\"yeaaa lol it’s cool tho.. glad they liked my song. It’s all love\"\n\nhttps://i.imgur.com/f3YeQMp.png\n\n\"all artist get inspired by others.. artists being thirsty for bread is why ppl don’t wanna credit anyone for inspiration. It’s all love and support from me, glad if my record influenced his 🙏🏾\"\n\nSource: https://www.instagram.com/p/BkNi0sNAtBp\n\nThanks to u/sPLATTYYY for posting the Instagram comments.\n\n\nThe instrumental is quite similar and the subject matter, inflection, and flow is uncannily similar.\n\nThoughts? “Don’t catch you slippin up”", "class": "r/hiphopheads"}, {"text": "Mac Miller - Dang! (feat. Anderson .Paak) link Easiest karma of this mans life", "class": "r/hiphopheads"}, {"text": "[FRESH ALBUM] Lil Wayne - Tha Carter V [Apple Music Link](https://itunes.apple.com/us/album/tha-carter-v/1437591818)\n\n[Spotify Link](https://open.spotify.com/album/50yFYgKdwJANZ5O9MIbMkg)\n\n[Deezer Link](https://www.deezer.com/en/album/74284842)\n\n[Tidal Link](https://listen.tidal.com/album/95823940)\n\n[Pandora Link](https://www.pandora.com/artist/lil-wayne/tha-carter-5-explicit/ALXmffnh297dJKX?corr=12391784&part=ug)\n\n[Google Play Music Link](https://play.google.com/music/preview/Br3vhxqzktqkt4shgguu3g543cm?PAffiliateID=1l3varo&nomobilenative=1&u=0#)\n\n[Genius](https://genius.com/albums/Lil-wayne/Tha-carter-v)\n\n\n\nTRACKLIST:\n\n1. I Love You Dwayne\n\n2. Don't Cry (ft. XXXTENTACION)\n\n3. Dedicate\n\n4. Uproar\n\n5. Let It Fly (ft. Travis Scott)\n\n6. Can't Be Broken\n\n7. Dark Side of the Moon (ft. Nicki Minaj)\n\n8. Mona Lisa (ft. Kendrick Lamar)\n\n9. What About Me (ft. Sosamann)\n\n10. Open Letter\n\n11. Famous (ft. Reginae Carter)\n\n12. Problems\n\n13. Dope Niggaz (ft. Snoop Dogg)\n\n14. Hittas\n\n15. Took His Time\n\n16. Open Safe\n\n17. Start This Shit Off Right (ft. Ashanti & Mack Maine)\n\n18. Demon\n\n19. Mess\n\n20. Dope New Gospel (ft. Nivea)\n\n21. Perfect Strangers\n\n22. Used 2\n\n23. Let It All Work out\n\n\n\n\nEDIT: Fixed Spotify Link my bad lol\n\nEDIT 2: I dont think its out on spotify yet guys, i keep posting fakes sorry\n\nEDIT 3: FIXED is waynes spotify crashed for anyone else? damn lol", "class": "r/hiphopheads"}, {"text": "XXXTentacion Sent to Jail, Facing 7 New Witness Tampering Charges link Apparently some fans showed up to the hearing and were sending threatening letters to the judge prior to it. Don't know what they figured that would do, but it didn't seem to work.", "class": "r/hiphopheads"}, {"text": "[Fresh Audio ]Machine Gun Kelly - Rap Devil (Eminem Diss) link [Video](https://www.youtube.com/watch?v=Fp0BScQSSvg&feature=youtu.be)\n\n[bizzare reacts](https://twitter.com/bizarresworld/status/1036667679216685056?s=19)\n\n[Vince weighs in](https://www.youtube.com/watch?v=PzesoqKl8qI&feature=youtu.be)", "class": "r/hiphopheads"}, {"text": "KANYE WEST on Twitter: \"Swish February 11 16\" link I decided at the beginning of this week i was gonna relisten to all of Kanyes discography and i finished Yeezus this morning so i like to think im responsible for this", "class": "r/hiphopheads"}, {"text": "Hey, this is Chance, #ColoringBook is out! Ask Me Anything. AMA starts at 9:30pm Central Time. \n\nListen to #ColoringBook at http://bit.ly/Chance3Reddit SKIP TO NO PROBLEMS", "class": "r/hiphopheads"}]