[{"text": "[Highlight] Austin Rivers begging for his dad to get a Technical Foul link **Replays/alternate angles**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Journalist gets quickly shut down when she asked James Harden, Russell Westbrook if they would refrain from speaking out on politics/social justice after China debacle link NBA release a statement regarding this situation\n\n>During today's Houston Rockets media availability, a team representative inappropriately interjected to prevent CNN's Christina Macfarlane from recieving an answer to her question. We've apologized to Ms. Macfarlane as this was inconsistent with how the NBA conducts media event\n\n[Andrew Marchand's tweet](https://twitter.com/AndrewMarchand/status/1182359083199979526?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1182359083199979526&ref_url=https%3A%2F%2Fwww.reddit.com%2Fr%2Fnba%2F)\n\n[Tim Reynolds tweet](https://twitter.com/ByTimReynolds/status/1182357718432145413?s=19)\n\n[Reddit thread](https://www.reddit.com/r/nba/comments/dg26uz/reynolds_nba_comment_on_rockets_postgame_in_japan/)", "class": "r/nba"}, {"text": "Joakim Noah with one of the worst free throws in the history of basketball link \"You can have the weirdest form you want, as long as it goes in....oh shit.\"", "class": "r/nba"}, {"text": "Karl Anthony-Towns' haunted kicks tonight link That...is really creative", "class": "r/nba"}, {"text": "I made a flowchart to help everyone find a playoff bandwagon to hop on, even for the most casual basketball fan! link Mitchell vs Simmons is an old story.\n\nLiberty Bells vs Jingle Bells is where the real rivalry is at.", "class": "r/nba"}, {"text": "Jeremy Lamb throws up the desperation heave from half-court and makes it at the buzzer to win the game! link Somehow automod failed us today\n\nPost ALTERNATE ANGLES/REPLAYS here", "class": "r/nba"}, {"text": "Worst National Anthem of All-Time? What the fuck was that by Fergie?! \n\nPower rank all time worst anthems “Let’s play some basketball!”", "class": "r/nba"}, {"text": "Three years ago, Fred VanVleet goes to the front of his draft party to tell everyone he went undrafted: \"My story don't end here. It's just the beginning. It wouldn't really make sense for my story if I did get picked. I've been against the odds my whole life. It's not gone stop now.\" link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Antetokoumpo accidentally whips a ball at Harden then Ilyasova drains a triple - ESPN link ### Replays/alternate angles\n\nIf this post is a highlight, reply to this comment with replays, alternate angles, and other accompanying media. \n\nIf your highlight is removed or doesn't show up in the new queue, it was likely removed as a duplicate or for failing to meet quality standards.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "[Post Game Thread] The Toronto Raptors defeat the Golden State Warriors, 118-109, take a 1-0 lead. **[](/GSW) GSW**|**Min**|**FG**|**FT**|**3PT**|**+/-**|**OR**|**Reb**|**A**|**Blk**|**Stl**|**TO**|**PF**|**Pts**|\n|:---|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|\nJ. Bell|11:38|1-2|0-0|0-0|-4|1|3|1|0|0|0|0|2|\nD. Green|40:20|2-9|6-6|0-2|-8|0|10|10|0|1|6|5|10|\nS. Curry|40:15|8-18|14-14|4-9|-9|1|5|5|0|1|3|4|34|\nK. Thompson|39:19|8-17|2-2|3-6|-10|2|5|1|0|0|2|3|21|\nA. Iguodala|29:11|3-7|0-0|0-4|-8|2|6|7|1|0|2|3|6|\nK. Looney|28:20|4-5|1-2|0-0|-4|1|3|1|0|1|1|5|9|\nS. Livingston|17:30|2-6|2-2|0-1|-2|1|4|1|1|1|0|3|6|\nQ. Cook|9:17|2-4|1-1|1-2|-2|0|0|1|0|0|0|1|6|\nA. McKinnie|8:26|2-4|0-0|2-3|+4|0|1|0|0|0|1|1|6|\nD. Cousins|8:03|0-2|3-4|0-1|-1|0|0|2|0|2|1|2|3|\nJ. Jerebko|7:36|2-4|0-0|2-3|-1|1|1|0|0|0|0|0|6|\nJ. Evans III|0:04|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nM. Derrickson|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nD. Jones|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nD. Lee|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nK. Durant|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nA. Bogut|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nTotals|240|34-78(.436)|29-31(.935)|12-31(.387)|-|9|38|29|2|6|16|27|109|\n\n**[](/TOR) TOR**|**Min**|**FG**|**FT**|**3PT**|**+/-**|**OR**|**Reb**|**A**|**Blk**|**Stl**|**TO**|**PF**|**Pts**|\n|:---|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|\nM. Gasol|29:43|6-10|6-6|2-4|+8|0|7|1|1|2|0|6|20|\nK. Leonard|43:04|5-14|10-12|3-6|+11|1|8|5|0|1|2|3|23|\nP. Siakam|39:45|14-17|2-2|2-3|+4|3|8|5|2|1|2|3|32|\nK. Lowry|36:14|2-9|2-2|1-5|+11|0|6|9|0|1|3|5|7|\nD. Green|29:41|4-9|0-0|3-7|+2|1|2|1|2|1|0|1|11|\nF. VanVleet|33:06|5-8|4-6|1-4|+11|0|1|2|0|0|1|3|15|\nS. Ibaka|17:03|2-7|1-2|0-2|-1|2|3|1|1|0|2|3|5|\nP. McCaw|6:50|1-2|0-0|1-1|-3|0|0|1|0|0|0|0|3|\nN. Powell|4:35|0-1|2-2|0-1|+2|0|1|0|0|0|0|2|2|\nO. Anunoby|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Loyd|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nM. Miller|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nC. Boucher|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Lin|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Meeks|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nE. Moreland|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nTotals|240|39-77(.506)|27-32(.844)|13-33(.394)|-|7|36|25|6|6|10|26|118|\n\n||\n|:-:|\n|^[nbaboxscoregenerator.com](http://www.nbaboxscoregenerator.com) ^by ^/u/Obi-Wan_Ginobili| Marc gasoline", "class": "r/nba"}, {"text": "LeBron proudly shows off photo of Stone Cold on his flip phone link Oh man that's a gif waiting to happen.\n\njust put anything in that flip phone and zoom out to smiling LeBron.", "class": "r/nba"}, {"text": "[Charania] Dirk Nowitzki says he is indeed retiring. Twenty-one seasons with the Dallas Mavericks. Future Hall of Famer. What a career. link And like that, the remnants of 2000s basketball are gone. \n\n\nSike Vince Carter still going strong", "class": "r/nba"}, {"text": "[The Onion] Knicks confident they have the cap space to ruin 2 or 3 promising careers https://sports.theonion.com/knicks-confident-they-have-the-cap-space-to-ruin-2-or-3-1832729578 > Mills, who noted that the 2019 free agency class was “absolutely loaded” with superstar players that could blow out their knees, feud with the front office, or languish in a coaching system that doesn’t fit their talents.\n\nWhat’s the chances any of that could happen here in NY?\n\n😳", "class": "r/nba"}, {"text": "Old lady brutally roasts Robert Sarver in front of the Phoenix city council link Theres nothing like being told off by an elderly lady.", "class": "r/nba"}, {"text": "Raptors for every team link  The little nba logo on the bottom left is the best one imo", "class": "r/nba"}, {"text": "Fan gets caught with his side chick in Rockets pre-game b-roll link The funniest part is if they stayed calm and didn't do anything, nobody would have noticed them. But since they did what they did they're on the front page of a 500,000 subscriber community forum.", "class": "r/nba"}, {"text": "LeBron buzzer beater to win it link [Higher quality](https://streamable.com/j7eid)\n\n[Replays](https://streamable.com/ztuxw)", "class": "r/nba"}, {"text": "High school students discover owner of TD Garden has skipped out on holding 70+ youth fundraisers (required legally as part of the deal authorizing construction of the arena) link And another reason why public funds shouldn't be used for private stadiums and arenas ", "class": "r/nba"}, {"text": "Reminder: The women is “exposing” Dwight Howard did the same thing to Playboi Carti in 2016, creating fake DMs and audio and sent them to his GF In 2016, this Masin girl (who is a YouTuber tryna gain clout) made fake DMs and Audio about carti hooking up with trans :\n\nand sent them to his gf, Rubi Rose who went off on Twitter.  Later it was found that the DMs and Audio was fake and she apologized.\n\nDon’t just jump to conclusions with this Dwight bs this girl is a clout chaser who has lied before about the same thing \n\nhttps://mtonews.com/41563-2-playboi-carti-atlanta\n\nMore information (to get post reapproved)\n\nhttps://youtu.be/Cf4w54EELUM\n\nI’m not sure if there are any articles it was a while ago but for now that’s what I’ve found \n\nHere is the original post of the SAME bitch who exposes Dwight\n\nhttps://youtu.be/6lt1AIg0YsA\n\nHere are the fake texts that carti was accused with \n\nhttps://youtu.be/DbKcCmJZZ6A\n\nDMS are fake : \n\nhttps://twitter.com/scusemyfrenchhh/status/1066736386093576192\n\n\nThese DMs were fakes in 15 mins to show how easy it is (credit to /u/DeerOnTheRocks):\n\nhttps://streamable.com/7y0gb\n\nCan’t believe the other post got 7 silvers and 14 golds... thanks for the silver !!!\n\nFive silvers awesome!!  Still a shame that other post has so many lmao they don’t deserve a single one.  \n\nTHANKS FOR MY FIRST GOLD After internal discussion, this thread has been removed due to a lack of proof. There is no evidence that we know of that the allegations against Carti were proven false, or that an apology was made as OP alleges. If OP can provide evidence of this the thread will be re-approved. In the meantime, please direct discussion to the original thread.\n\nEDIT: OP has provided links, thread is back up. ", "class": "r/nba"}, {"text": "LeBron: I'm coming back to Cleveland link \"Miami, for me, has been almost like college for other kids.\" Best quote.", "class": "r/nba"}, {"text": "Russell Westbrook has achieved a double-triple-double, with 20 points, 20 rebounds and 21 assists Absolutely insane game from Russell Westbrook, who has been on fire since the first quarter, where he scored 10 assists and 7 rebounds.\n\nAccording to Royce Young, the only other 20-20-20 game in history was Wilt Chamberlain on Feb 2, 1968. 21 assists, two turnovers :o", "class": "r/nba"}, {"text": "Rachel Nichols and the ESPN crew were extremely disrespectful last night I’m not sure if this has been posted by someone already, but I just wanted to say that the things they let Rachel Nichols and Woj say during the draft lottery were blatantly disrespectful to all of the teams, save for maybe the Knicks, to all of the other draft picks, and to the Pelicans. Not to mention the fact that everything they were saying was being blasted throughout the entire venue. \n\nFirst off, there were over a dozen teams in attendance last night. The only one that they chose to talk about: the Knicks. They talked unbelievably liberally about Zion going to NY, as if they had already won it. However, as I doubt any of them realized, the Knicks had the same chance of obtaining the #1 pick as the Cavs and the Suns, the latter of which I don’t even think was mentioned once on the broadcast.\n\nThen, there was Zion. Rachel Nichols kept referring to the #1 pick as “who gets Zion.” Every time she said that or mentioned the kid, the camera would cut to the embarrassed 18 y/o who was just there to see what team picks where. There is no guarantee that Zion will go #1 overall. It is very very likely, but not guaranteed. Not to mention that they did this in front of a large number of draft prospects in attendance. What does all of this coverage and press mean to them if it’s only going to Zion?\n\nAnd finally, the Pelicans. Woj made every team’s case for a possible AD trade that night. Whenever a team with chances of getting a top 10 pick was mentioned, Woj had to slip in that they may be looking to use that pick as an “asset” to trade for AD. I’m honestly very happy the Pelicans won because the disrespect they were receiving the whole night was greatly trumped when they won the first pick.\n\nNow I get all of these things are said ten times over on any other sports news broadcast. However, as I said, Rachel Nichols audio was blasted for everyone at the event to hear, including the draft prospects and team representatives. After watching this, I asked my dad if there was ever a time where the media would be able to speak this liberally about sports in front of all of those people. He said “no.”\n\nEDIT: Apparently, there are rumors circulating that Rachel Nichols was drunk. Honestly...that’s not surprising [deleted]", "class": "r/nba"}, {"text": "Simmons shoots his first 3 of the season link ### Replays/alternate angles\n\nIf this post is a highlight, reply to this comment with replays, alternate angles, and other accompanying media. \n\nIf your highlight is removed or doesn't show up in the new queue, it was likely removed as a duplicate or for failing to meet quality standards.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "\"If you're uninformed and uneducated, how do you call someone else uninformed and uneducated? You need to be informed and educated in order to call someone that.\" Shannon Sharpe link Wow Shanon talked bad about Lebron!", "class": "r/nba"}, {"text": "I analyzed James Harden's performance in every NBA city to see if there is a correlation between his box score and the city's average strip club rating. Everyone knows James Harden has a particular affinity for the Canadian ballet, aka strip clubs. After the Rocket's dismal performance in Miami last week, and the city's reputation for high quality tit-shacks, I became increasingly curious to see just how much James Harden's vice affects his game.  So here we are, I spent the better part of the week on this, hope y'all enjoy!\n\n**Hypothesis**: James Harden's box score declines in cities with high quality strip clubs\n\n**Test**: Analyze James Harden's performance in every NBA city and correlate with those cities' reputation for strip clubs to see if there is any discernible relationship.\n\n&#x200B;\n\n**Methodology/Steps**:\n\n* First I extracted all of James Harden's game logs for the past 4 seasons from Basketball Reference, cleaned up the data a bit (a bunch), and appended it into a single worksheet.\n* Next, I filtered out all Home games and all games Harden was inactive or DNP. For the purpose of this analysis we did not look at home games.\n* **Poor Performances** were determined by variances in 6 stats: Points, FG%, 3PT%, FT%, Assists and Turnovers. For each of these stats I compared Harden's *overall* season average to the *city-specific* season average. I identified 2 categories of poor performances:\n\n1. Sub-Par - Harden performed WORSE than season average, and\n2. Very Sub-Par - Harden performed 20%+ WORSE than season average.\n\n* I analyzed his poor performances across each of the NBA’s 28 different cities (did not look at home games so no Houston, there are 2 teams in LA, and I distinguished between Brooklyn and NYC = 28 cities).\n* **City Strip Club Rating** was determined by the average google review rating for the first 10 strip clubs in each city based on the google search “\\[CITY\\] Strip Clubs” (e.g., “Detroit Strip clubs”). Yes, this did involve me making like 30+ searches for strip clubs on my cpu...\n* Finally, I put the City Strip Club Rating into the pivoted game log data, performed a regression analysis and visualized it into charts.\n\n&#x200B;\n\n**Conclusion**:\n\n>!I have proven, to a statistically significant degree, that James Harden’s game performance declines in cities with higher rated strip clubs. !<\n\n>!Correlation Coefficient - r - (between avg strip club rating and total # of sub-par games) = .4575!<\n\n* >!Given the nature of the subject matter, this would be considered a moderate-to-strong correlation. !<\n\n>!Coefficient of Determination - r2 - (between avg strip club rating and total # of sub-par games) = .21!<\n\n* >!This means that James Harden’s box score is 20% predictable based on the quality of a city’s strip clubs !<\n\n>!Other interesting facts: !<\n\n* >!Harden’s best performance comes in city with the worst strip clubs - Toronto!<\n* >!Harden’s worst performance comes in city with the best strip clubs - Miami!<\n* >!Salt Lake city has the 3rd-ranked strip clubs of all NBA cities lol!<\n\n&#x200B;\n\n[Link to all my work](https://docs.google.com/spreadsheets/d/1hwDoaHcXqncb_l24NrxLCWTxE5pLaeKlU8r1Jnp39GQ/edit?usp=sharing)\n\nThe charts won’t upload perfectly to google docs so I have included [screenshots here](https://imgur.com/a/JEhHxkH)\n\n&#x200B;\n\ne. haha well this bl**e**w up. Just wanted to take the opportunity to say how much I appreciate r/NBA for being the best fucking sub on this site (**d**espite y'all nephews calling my boy *hitler*), than**k**s to all my fellow redditors for t**h**e nice words and the ridiculous amount of gold. Here is Darren Rovell from the Action Network tweeting about it: https://twitter.com/darrenrovell/status/1192513721014345729", "class": "r/nba"}, {"text": "Joel Embiid 0 points, 0-11 FG, 0-4 from deep, 0-3 from the line, 4 turnovers, 5 fouls, all Lowlights! link I have to admit if I wasn’t a sixers fan I’d be laughing my ass off at this shit.\n\nEdit: ok maybe I’m laughing anyway", "class": "r/nba"}, {"text": "Amazing defensive effort by the Suns link Holy shit, that is five well-paid athletes giving zero shits", "class": "r/nba"}, {"text": "The NBA Chooses China’s Money Over Hong Kong’s Human Rights link Daryl Morey: \"Free Hong Kong!\"\n\nNBA: \"Shut up and dribble.\"", "class": "r/nba"}, {"text": "Rondo game winner at the buzzer | TNT link ### **Replays/alternate angles**\n                \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "THE LOS ANGELES LAKERS HAVE BEEN ELIMINATED FROM PLAYOFF CONTENTION With their loss tonight to the Nets, the Lakers are now officially eliminated from making the playoffs.\n\n\n-----\n\n\nThis is the first time in 14 years that Lebron has missed the playoffs, and marks the end of his streak of 8 consecutive NBA Finals appearances.  \n\n\n-----\n\n\nFade' em Faded.", "class": "r/nba"}, {"text": "[Post Game Thread] The Toronto Raptors (3-1) defeat the Golden State Warriors (1-3), 105-92, can close out series at home **[](/TOR) TOR**|**Min**|**FG**|**FT**|**3PT**|**+/-**|**OR**|**Reb**|**A**|**Blk**|**Stl**|**TO**|**PF**|**Pts**|\n|:---|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|\nM. Gasol|27:49|3-8|2-2|1-4|+1|2|7|3|0|1|1|2|9|\nP. Siakam|41:20|6-14|7-8|0-2|+5|1|5|1|1|0|1|0|19|\nK. Leonard|40:34|11-21|9-9|5-9|+11|0|11|2|1|4|0|4|36|\nK. Lowry|37:18|3-12|4-4|0-4|+5|0|2|7|0|3|2|4|10|\nD. Green|29:44|1-8|0-0|1-7|+11|1|3|1|0|3|2|5|3|\nF. VanVleet|28:56|3-9|0-0|2-5|+10|0|4|6|0|0|2|1|8|\nS. Ibaka|21:43|9-12|1-1|1-1|+9|1|4|1|2|0|1|5|20|\nN. Powell|10:42|0-1|0-0|0-0|+6|0|1|1|0|1|0|0|0|\nP. McCaw|1:54|0-0|0-0|0-0|-3|0|0|0|0|0|0|0|0|\nO. Anunoby|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Loyd|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nM. Miller|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nC. Boucher|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Lin|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Meeks|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nE. Moreland|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nTotals|240|36-85(.424)|23-24(.958)|10-32(.313)|-|5|37|22|4|12|9|21|105|\n\n**[](/GSW) GSW**|**Min**|**FG**|**FT**|**3PT**|**+/-**|**OR**|**Reb**|**A**|**Blk**|**Stl**|**TO**|**PF**|**Pts**|\n|:---|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|\nD. Cousins|14:50|3-6|0-1|0-0|-4|1|4|1|1|0|4|2|6|\nS. Curry|42:59|9-22|7-8|2-9|-9|0|4|6|0|1|3|4|27|\nK. Thompson|42:10|11-18|0-0|6-11|-5|1|3|2|0|0|0|3|28|\nD. Green|40:34|3-6|4-4|0-1|-11|0|9|12|2|1|5|4|10|\nA. Iguodala|37:57|1-6|1-2|0-3|-4|0|4|3|2|3|2|3|3|\nK. Looney|20:24|5-8|0-2|0-0|-6|3|6|1|0|0|1|2|10|\nS. Livingston|15:11|2-3|2-2|0-0|-12|1|3|1|0|1|1|0|6|\nA. Bogut|10:45|0-0|0-0|0-0|+6|1|6|0|0|0|1|2|0|\nA. McKinnie|8:30|1-4|0-2|0-1|-4|1|2|0|0|0|0|3|2|\nQ. Cook|6:40|0-5|0-0|0-3|-6|0|1|0|0|0|0|0|0|\nM. Derrickson|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nD. Jones|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Bell|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nD. Lee|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Jerebko|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nK. Durant|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Evans III|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nTotals|240|35-78(.449)|14-21(.667)|8-28(.286)|-|8|42|26|5|6|17|23|92|\n\n||\n|:-:|\n|^[nbaboxscoregenerator.com](http://www.nbaboxscoregenerator.com) ^by ^/u/Obi-Wan_Ginobili| Fred VanVleet: 8 points. 4 rebounds, 6 assists, 7 stitches", "class": "r/nba"}, {"text": "LBJ throws it off the backboard to himself link [Here are replays.](https://streamable.com/jf0sd)", "class": "r/nba"}, {"text": "LeBron - a side by side comparison link Make a Lelbron face mosaic of Lelbron faces", "class": "r/nba"}, {"text": "Curry blows the open dunk and then airballs the 3 link ### **Replays/alternate angles**\n                \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Masai Ujiri's reaction to Lowry lifting up the Larry O'Brien trophy link I loved how it didn't count when the owner hoisted to the trophy, it was quiet and the players looked a little bored. Then as soon as Lowry had it the real celebration began.", "class": "r/nba"}, {"text": "Bang Bros is about to bid $10 Million for the naming rights of the Miami Heat’s arena. link It’s not going to happen but it would be so Miami", "class": "r/nba"}, {"text": "[Charania] Cleveland and Boston have agreement on deal to send Kyrie Irving to the Celtics for Isaiah Thomas package to Cavs, sources tell The Vertical link Deal as we understand it is: \n\n**BOS sends:** \n\n* Isaiah Thomas\n* Jae Crowder\n* Ante Zizic\n* 2018 Brooklyn Nets 1st Round Pick\n\n**CLE sends:**\n\n* Kyrie Irving\n\n_____\n\nThe Brooklyn Nets pick is unprotected and is estimated to convey in the top 5 of next year's draft. ", "class": "r/nba"}, {"text": "Ben Simmons “missing” poster in Brooklyn link This would've been better if he didn't crush us in game 2 but I'm excited nonetheless", "class": "r/nba"}, {"text": "[Wojnarowski] Toronto has reached agreement in principle to acquire San Antonio's Kawhi Leonard for package that includes DeMar DeRozan, league sources tell ESPN. Trade is larger on both sides, and players are still being informed of their inclusion in the deal. Trade call with league today link Wow, after he wanted to be the best Raptor ever...", "class": "r/nba"}, {"text": "Derrick Rose is reduced to tears after his teammates swarm him. He had the game-saving block as well. link Sonship with Jimmy Butler over. Rose is my dad now.", "class": "r/nba"}, {"text": "JR Smith runs out the clock while the Cavs arent up. link There’s absolutely no excuse for a professional basketball player in the biggest game of the season to not know the score. WTF ", "class": "r/nba"}, {"text": "Rex Chapman goes for the dunk. link Mark Eaton didn't even fucking jump, ffs", "class": "r/nba"}, {"text": "Dame hits the game winner at the buzzer | TNT link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Number of NBA Championships by team link Hawks on the board. Context is irrelevant.", "class": "r/nba"}, {"text": "Giannis Antetokounmpo is the 2019 NBA Most Valuable Player [Source](https://twitter.com/BenGolliver/status/1143357239308120065): \n\n>**The 2019 NBA MVP is, officially, Bucks forward Giannis Antetokounmpo.**\n\n>**- East all-star captain, unanimous all-nba first team, all-defensive first team**\n\n>**- First Bucks winner since Kareem Abdul-Jabbar in 1971.**\n\n---\n\nThis capped off a historic and truly international awards class. Giannis Antetokounmpo (Greece) joined Defensive Player of the Year Rudy Gobert (France), Rookie of the Year Luka Doncic (Slovenia) and Most Improved Player Pascal Siakam (Cameroon) as foreign-born winners of major awards tonight. The state of Wisconsin has two reigning MVPs, and neither of them play for the Packers.\n\nWhat a time to be alive.", "class": "r/nba"}, {"text": "[Highlight] Ben Simmons with the corner 3 link **Replays/alternate angles**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "[James] U bum @StephenCurry30 already said he ain't going! So therefore ain't no invite. Going to White House was a great honor until you showed up! link Hi everyone,\n\nObviously this is a very sensitive issue, as most political posts are. As we've mentioned in the past, politics-related posts that directly relate to the NBA and/or its players are allowed within our rules.\n\nWith that being said, we are frequently forced to lock political threads because of the high volume of comments that violate our rules (personal attacks and flamebaiting being the biggest offenders). We don't want to do that, so we're asking everyone to remain civil. Please report any rule-breaking comments you see. We'll be closely monitoring this thread. If the level of discussion degrades to the point of excessive personal attacks, we may lock the thread.", "class": "r/nba"}, {"text": "LeBron James passes to himself and dunks link [deleted]", "class": "r/nba"}, {"text": "People don't talk enough about how awful the Hornets are * One of only 6 teams in the NBA/NFL/MLB/NHL that's never even made a conference finals. They're the second oldest of those 6 teams behind the Clippers.\n\n* They've only drafted 4 All-Stars that went on to play for them despite being around since 1988: Alonzo Mourning, Larry Johnson, Baron Davis, and Kemba Walker. And they've had the most chances to draft All-Stars too: the Hornets rank #1 with the lowest average draft spot in that time.\n\n* Then-coach Steve Clifford wanted the Hornets to draft Donovan Mitchell in 2017, but Rich Cho overruled him and drafted Malik Monk instead.\n\n* The Hornets were seriously looking to draft Pascal Siakam in 2016, but decided to trade their pick for Marco Belinelli who spent one year with the team before being traded to Atlanta in the Dwight Howard trade.\n\n* The Hornets were offered three first-round picks by the Celtics for the #9 pick in 2015. Michael Jordan turned the offer down to pick Frank Kaminsky. Kaminsky was always in the coach's doghouse here, his family hated Charlotte, and Kaminsky signed with Phoenix this offseason.\n\n* After having the worst record in NBA history in 2012, the Bobcats lost out on the #1 pick which was going to be Anthony Davis. They then selected Michael Kidd-Gilchrist with the #2 pick instead of Bradley Beal. In the same draft, they selected Jeffery Taylor with their 2nd round pick, just ahead of Draymond Green and Khris Middleton.\n\n* They did select Kemba Walker in 2011, but they also gave Stephen Jackson, Shaun Livingston, and the pick that would turn into Tobias Harris so they could jump up and draft Bismack Biyombo. They selected Biyombo instead of the player that had been mocked to them in several mock drafts: Kawhi Leonard. They also had Klay Thompson on the board.\n\n* The second best draft pick they've had since their 2004 rebirth has been Emeka Okafor.\n\n* They haven't won a playoff series since April 2002 when LeBron was in high school, Zion was 1 year old, The Scorpion King was #1 at the box office, Ashanti had the #1 song in America, and Hollywood Hogan was WWE Champion. The closest they've come to winning a series since then was the Purple Shirt Guy game when they were up 3-2 vs. the Heat and had cut a 9 point Heat lead to 2 with 1:30 left. A Hornets fan known as Purple Shirt Guy started inexplicably jawing with Dwyane Wade who proceeded to drop a quick 5 points to tie the series up. The Hornets would go on to lose Game 7 in Miami by 27 points.\n\n* Despite letting their best player ever walk for nothing, they're hard-capped at the moment. They'll be hard-capped this season with a starting 5 of Terry Rozier, Cody Zeller, Nic Batum, Dwayne Bacon, and Miles Bridges. Bismack Biyombo will be making $17 million off the bench, Marvin Williams will be making $15 million off the bench, and Michael Kidd-Gilchrist will be making $13 million off the bench. Nic Batum (who has turned into a completely worthless player) will be entering the 4th year of a 5 year deal (final year a player option) that will pay him $25.5 million. He'll almost certainly use that player option in 2020 and will be making $27.1 million.\n\n* The Hornets hired a new radio play-by-play guy before the start of the 2018-19 season that grew up a Hornets fan and was a beloved radio host in Charlotte. He was fired in the middle of a week in March with no explanation and no explanation has come out since.\n\n* Michael Jordan hasn't given an interview where he's discussed the Hornets in any detail (besides Kemba Walker) since 2014.\n\nSo as you bitch and complain about how your team hasn't done anything in a long time or how you only have one All-Star and you're disappointed you didn't get another, remember that things could always be worse. That is a long and damning list of failures.\n\nHorrible asset management.", "class": "r/nba"}, {"text": "I sold Josh Hart a Switch in 2017. And he still owes me. (Repost from /Lakers) #UPDATE: http://imgur.com/gallery/c8btRei\n\nJustice is served! Josh reach out and sent me this.\nThank you everyone for you help and turning this into a success story!!!!!\n\nBack in the summer of 2017, we drafted Josh Hart out of Villanova with the 30th pick. I loved the pick cause I knew the kid was a baller and gave us some nice depth.\nHe made a tweet that summer while he was in Vegas getting ready for the summer league, about wanting to buy a Nintendo Switch. My little brother jokingly replied to him without expecting a response, but to our surprise, he did.\nThe conversation went as follows:\n\n http://imgur.com/gallery/WkSFMJm\n\nWe agreed on 200 dollars, tickets to a future game and the chance to meet with him for a Switch and Zelda Breath of the Wild. I shipped it to him overnight. As a life long Laker fan (I have a tattoo so I'm not playing around) I was ecstatic at having some kind of connection to a Laker, let alone one I genuinely liked.\n\nHe did PayPal me the 200 right when he got it, and he did reach out to me about what tickets I wanted. I asked him for the December 18th game...which was Kobe Bryant's jersey retirement. I knew the odds of getting those tickets were slim, but of course I'm going to shoot my shot at that game.\n\nThat was the last I heard from him. I have reached out to him through my personal Twitter, and my brother has attempted to as well. He reads the message, but never replies. I have joined his Twitch live streams and tried to get his attention there too, and he seems to ignore me there too.\n\nI have no ill will towards the man, I just want what we had agreed upon and not be ghosted. I feel waiting 2 seasons and still no tickets is pretty absurd at this point, and the lack of communication is the real ball buster.\n\nSo please Josh....just pay up bro.\n\nEDIT: http://imgur.com/gallery/mbNQqig \n\nSome personal DMs from me to him. I forgot I tried to invite him to my wedding 🤣🤣🤣🤣 no wonder no one wants to give this guy high 5s", "class": "r/nba"}, {"text": "LeBron James on Donald Trump disinviting the Eagles: “It’s typical of him. I’m not surprised. ... I know no matter who wins this series no one wants to get invited to go.” link Better, full-length video: https://streamable.com/5deyg\n\nAnd as always, follow the rules.", "class": "r/nba"}, {"text": "Tyronn Lue abruptly stops barking out orders after a weird ring falls out of his mouth link Why is everything about this team so fucking weird?", "class": "r/nba"}, {"text": "With Derrick Rose still in FA, I made a collection of photos of how Rose would look on each NBA team. With Rose still looking for a suitor, I wanted to help by showing what Rose would do for each NBA team. \n\n[Here is the collection.](https://imgur.com/gallery/JWqXG)\n\nEdit: this was not a mean spirited post. I was doing this for Rose's best interest. Guy truly is a winner on the court and in the court. Please sign him.\n\nEdit2: in 24 hours, r/nba has given me as much gold as Rose has won in FIBA. Thank you.\n\nEdit3: after numerous requests... [Here is Drose on the Seattle Supersonics.](https://imgur.com/gallery/zskdr) Holy fuck, Rose on crutches as a Blazer is just savage", "class": "r/nba"}, {"text": "We did it! NBA Awards Ratings: Down 27%. link I didn’t not watch it in protest. I didn’t watch it because it’s incredibly dumb\n\nEdit for the people from r/all asking why the award show is dumb:\n\nBasically the NBA tries to make everything a spectacle. The last game of the regular season was on April 11th. That’s about the same time the voting for the awards took place. Instead of revealing it when they knew the results, they waited until after the playoffs and the draft and had the award show a few days ago. It shoehorned in celebrities and musical acts to push viewership outside of NBA fans to maximize advertising dollars. To make it worse the Coach of the year Award went to a guy who got fired after his team lost in the playoffs. He had to go up and make a speech. I get that it’s a business/financial move because advertisers will pay a ton of money but fans are mad they wait so long to reveal the results solely for the benefit of the NBA. \n\nTL;DR: Awards are good. Making them into a spectacle 2.5 months after voting is not. ", "class": "r/nba"}, {"text": "Ernie Johnson states on TNT that Shaquille O’Neal’s sister has passed away at the age of 40 from cancer. So sad to hear about someone passing away at such a young age. Shaq is beloved by the community for being crazy and hilarious, so sad that he is going through this. \n\nHopefully he takes enough time away from TNT to get over his loss.\n\nEdit: [Video of Ernie, Chuck, Kenny. ](https://youtu.be/TJCMkntBD38) \nThis video is the only one I could find, from a random youtube account. For those who wanted to see how emotional the crew was for Shaq. Death of a sibling is something you don’t get over. You move past it, sure, but it’s always there. RIP.", "class": "r/nba"}, {"text": "Is Lebron DENNIS systeming the cavs? He already:\n\nDemonstrated value by playing amazing basketball since his first game in the NBA \n\nEngaged them physically by spending his first 7 years playing with them and taking them to their first finals\n\nNurtured their dependence by assembling a team that depended on him to be successful (just look how the same team that won 60+ games in 09 became a lottery team a year later)\n\nNeglected them emotionally with The Decision \n\nInspired hope by coming back and winning them their first championship\n\nnow all that’s left is to...\n\nSeparate entirely\n\nEdit: Whoever gilded this, thank you! You are a real golden god!!! IT getting all buddy buddy with dan gilbert so he can \n\nMove in\n\nAfter\n\nCompletion", "class": "r/nba"}, {"text": "LeBron ties it up with an INSANE 3 link Let the record show that was a 75-foot chest pass from Kevin Love. ", "class": "r/nba"}, {"text": "LeBron James no longer King James for Hong Kong protesters - AP News link He’s chairman James now", "class": "r/nba"}, {"text": "Peyton Manning's KD joke (h/t:@_marcusd2_) link His mom was even laughing ", "class": "r/nba"}, {"text": "Wilt Chamberlain's one-step vertical reach caught in a photographer's flash. link This picture is some paranormal shit", "class": "r/nba"}, {"text": "My gf Asur spent 20hrs in two days doing these. Hope r/nba will like it! link Tell her that she does a fantastic job and our day is better because of her work. We appreciate all of the time and effort she puts into this work and thank her for showcasing her talent.", "class": "r/nba"}, {"text": "Russell Westbrook makes history as he sets the new NBA-record for most triple-doubles in a single season with his 42nd triple-double of the season * With his [10th assist of the game](https://streamable.com/x5f2q), Brodie passes Oscar Robertson (41 triple-doubles in 1961-62 season) for the most number of triple-doubles recorded in a single season.\n\n* He also passes Wilt Chamberlain (78 career triple-doubles) to move into fourth place of all-time career triple-doubles list with 79 career triple-doubles.\n\n* He finished the game with a [game-winning buzzer-beater from way downtown!](https://streamable.com/2wb1f) That gave him another 50-point triple-double, his third in his career. MVP? Russell Westbrook is the only player to ever hit a game-winning shot at the end of their 42nd triple double. ", "class": "r/nba"}, {"text": "[Highlight] Shaq's take on the China Situation link **Replays/alternate angles**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Next time a fan/owner/media cries about loyalty. Look at what happened to Avery Bradley today. Dude did everything to be loyal to Boston.  Played his heart out. Never complained. Was a true professional.\n\nThen he gets traded to Detroit.\n\nLoyalty?  There is no loyalty in the NBA.  Just mutually beneficial relationships.  When a player/owner/team can get into a better situation they will do it, loyalty damned.\n\nSo next time a Free Agent leaves a team, don't blame them. Owners are disloyal constantly. Yet is anyone in the media saying the Celtics are disloyal? Hell no.  The double standard is ridiculous. same goes with companies and their employees tbh. \n\neverytime a player gets traded they are forced to say \"its just business\"\n\nbut when they chose what team they play for they are called disloyal", "class": "r/nba"}, {"text": "How my NBA experience turned into a nightmare thanks to StubHub - They denied my chance to see the final ever game at Sleep Train Arena last night by selling me invalid tickets. **4/11 - Here is an update since I don't think it is right to not give StubHub the positive publicity as well when they have reached out and offered to make it up to me.**\n___________________________________\n\nStubHub has reached out to me and advised me that, in keeping with their Buyer Guarantee of offering equal or better seats, they will get me tickets to the home opener next year.\n\nThe rep was extremely professional and apologetic for the situation. I told him they really should provide some kind of safeguards for buyers. He assured me that they aggressively go after any sellers who break their rules.\nI'd have rather got in to the final game, but I am happy with the outcome.\n__________________________________\n\n\n\n**TL:DR – StubHub sold my wife and I invalid tickets to the final game ever at Sleep Train Arena (ARCO Arena) – they did not notify me the tickets were bad, I found out when we got denied by the scanner at the door.  Then they kept me on hold for over 40 minutes outside the venue.  I missed the game and it could happen to you.**\n_______________\n\nLet me preface this by saying I do not blame the Kings or NBA for this situation, however I do think that they need to be aware of what one of their major resellers is doing to their fans.\n\nI am a Sacramento Kings fan - through thick and thin.  I scream about hating them, complain, and bemoan our lack of defense, lack of wins, lack of… everything.  We don’t have much.  We haven’t been to the playoffs in 10 years – the second longest drought in the NBA (behind the Wolves who I guarantee break that streak soon).  We have a superstar who teases us with his brilliance and then punishes us with his attitude and demeanor.  We went through an absolute nightmare of an ownership that tried not once, not twice, but three times to steal our team and take them to another city.  We just celebrated breaking thirty wins for the first time in nine years.  Yet I love the team to the core.\n\nI’ve watched this team since I was a kid.  In the fourth grade, I had a Kings ruler with pictures of Danny Ainge, Wayman Tisdale, and Kenny Smith.  I had, and still have, only seen NBA games in a structure that has all of the sex appeal of a giant flat office building – Sleep Train Arena (it will always be ARCO to me).  \n\nThe entire basketball nation probably knows the plight of our dilapidated arena – tarps falling from the ceiling, leaks when it rains, toilets that don’t work.  Yet we Kings fans love the place.  We always have.  It’s the only real arena we have ever had – we don’t have any other major league sports in our city and this place is just cozy and fits us.  \n\nIt is the perfect arena for a bunch of rabid fans in a city that Phil Jackson infamously called a “cow town” – unwittingly unleashing the birth of the very loud Kings cowbells.\n\nAfter all of the disasters of the previous ownership group, we finally were blessed by a man willing to save our team – Vivek Ranadive.  While we can argue his basketball knowledge and his hands on approach to basketball operations, we cannot argue that he saved the Sacramento Kings and ponied up a lot of money to build us a brand new arena in downtown Sacramento.\n\nWith that very arena scheduled to open this October, many of us Kings fans circled April 9, 2016 on our calendar; the final game at the “old barn” after 28 years.\n\nI was one of those people.  I frequently purchase my tickets from a variety of sources – Kings.com, eBay, StubHub, Craigslist, etc.  Where ever the best deal lies.  Some are obviously more risky than others – Craigslist comes to mind.  \n\nI would not fret about buying tickets from StubHub – I’ve done it before plenty of times.  I hear their commercials all of the time on the radio.  I had no reason to believe that there was any risk buying tickets from their website.\n\nUnfortunately, I found out that I was completely wrong last night.\n \nYesterday, I bought tickets to the final game at Sleep Train with a scheduled tip off against the OKC Thunder at 7:30 pm.  I looked through StubHub and found a great dead for two tickets for my wife and I in Row H of the lower bowl.  The total price was $356.00 – expensive for a meaningless basketball game, but not for a once-in-a-lifetime event.  \n\nThe Kings were going to do it up big; tons of free giveaways, meet and greets with former players that spanned the entire Sacramento era, the opportunity to go out on the court and shoot a free throw and take pictures – it was going to be an amazing close to our shabby, but loved, arena.\n\nI [purchased the tickets a little after 5:00 pm yesterday from StubHub](https://imgur.com/COW0Khe).  At 5:22 pm, I received my email confirmation with the tickets.  I immediately took [screenshots](http://imgur.com/22fIc9n) of [both tickets](https://imgur.com/gvpW9B0) to scan at the door on my phone.  My wife and I got ready and we were on our way to drive the 30 or so miles to the arena.\n\nWe arrived at approximately 7:00 pm and by this point could see all of the news trucks, concession stands, and hear the music playing.  We were getting excited.  The parking lot was as full as I’ve ever seen it.\n\nWe made our way past the security check point and walked up to the self-scanner at the door where I pulled up the screenshots of my tickets.  I scanned the first one at the turnstyle:  REFUND flashed on the screen.  I stood there for a second thinking maybe it didn’t register so I tried again.  REFUND.\n\nAt this point, people were piling up behind me so I stepped aside feeling a little embarrassed – like I was some scammer or didn’t know how to use the scanner.  This was where I felt my first pang of panic.  \n\nI pulled up the second ticket and slid back in line to try again.  REFUND.  I flagged down a door attendant who tried his hand scanner on both tickets: REFUND, REFUND.  It was 7:05 pm and I was in full on panic mode now.  \n\nThe door attendant advised me to go to the box office so we tore off in that direction. I desperately did not want to miss the last ever player introductions at this arena.  Inside the box office, I was sympathetically told by the attendant, “I’m so sorry, this is a StubHub problem and we can’t help you – you need to call them but they’re very good at refunds.”\n\nREFUND.  There’s that word again.  \n\nI don’t want a refund – I want to see this game!  And time is tick, tick, ticking away.  I grab my phone and literally type StubHub into google as fast as my fingers will let me.  I find the number and call.  After the automated message, the voice tells me the first thing I was dreading to hear, “all of our representatives are assisting other callers – we will be with you shortly.”\n\nI am basically beside myself by now – I am down to about 15 minutes to tip off and I have no way through the door.  At 7:25pm, while still on hold, I got desperate and went back to the box office.  I asked the representative what the cheapest tickets were just to get in the building.  He tells me $160.00 each for nosebleed upper bowl tickets – plus fees.  \n\nI can’t believe what I am hearing.  I still don’t know the status of my StubHub tickets so now I am faced with the choice of buying these tickets in front of me for more than the lower bowl tickets that I should already have in my possession or continuing to wait on hold.\n\nI don’t know if I am getting a refund or not for the StubHub tickets, since no one will answer the phone, and am afraid of buying four tickets.  The box office rep says to me, “man, I’m so sorry – we’ve been seeing this all night from StubHub.”\n\n7:25 pm, 7:30 pm, 7:40 pm, 7:45 pm\n\nBy 7:45 pm, I came to the realization that I was not going to see this game.  My wife and I started the most depressing, dejected walk back to our car imaginable.  About halfway there, the StubHub rep finally came on the line – after 40+ minutes on hold.  I calmly (as possible) explained my situation to him and asked him exactly what had happened.\n\nHe was unable to explain why my tickets would not work.  I asked him point blank, “Did the guy who sold me these tickets also sell them to someone else.”  He would not answer, just saying that sometimes there are issues with the tickets.  I kept pressing him, asking him why I was not notified that my tickets would not work before I got to the door.  At least then I would have had an opportunity to get different ones.  [The only email I received at that point was my confirmation](https://imgur.com/si3xBbk).  He told me that they do not monitor the transactions so if there is an issue, you will not know until you get denied at the door.\n\nI couldn’t believe that I was not getting an answer as to why my tickets would not work.  I explained to him that this was not just any game – this is a one-time event.  I could tell that he was starting to understand the gravity of my situation.  I kept pushing him about the seller and how this happened.  That’s when he dropped the bomb on me.\n\nHe said, and I quote, **“I probably shouldn’t tell you this, but the seller you bought these tickets from is already under investigation for selling bad tickets.”**\n\nSo there it is – StubHub knew that this guy is selling bad tickets on their site.  Or at the very least, he is selling the same tickets to multiple people.  The rep told me that he would be investigated which mean absolutely nothing to me standing in the parking lot.  \n\nHe told me he would issue a refund for the price of the tickets and offered me 20% off of my next purchase.  It wasn’t then, and it’s not now, about the money.  We missed something that we had our heart set on.\n\nWe went to a nearby restaurant and watched the game on TV which honestly felt more painful.  It was basically everything we knew it would be; a great halftime show featuring the past players, sentimental videos, the roar of the sell-out crowd as the game came down to the final shot – with the Kings winning it with 1 second on the clock.  But it wasn’t about the game on the court, it was about the atmosphere in the building.  And we missed it.\n\nThe final kick in the teeth came on the drive home as I listened to the post-game on AM radio.  During a commercial break there was a StubHub ad talking about their “guarantee” to get you in the game.  I couldn’t believe it.  \n\nAs soon as I got home, I fired off an email to StubHub explaining what happened [PART 1](https://imgur.com/CsPS7id) and [PART 2](https://imgur.com/xhxoupa).  This morning, [I got the response which was basically a form letter](https://imgur.com/05E42wK) with some things changed in it.  They ask me to call them back so that they can further investigate.  I called them and the rep I spoke to had no idea why I was calling in, saying, “oh they already are looking into the seller.  They probably just wanted you to call to verify you received your refund.”  I knew I got my refund last night!  \n\nI asked him if he at least saw the 20% discount on my account for my next purchase and he said, “No I don’t see it but I will make sure I add it right now.  It’s actually a 20% credit based on the purchase price of the tickets you already bought.”  At this point, whatever.  So he tells me based on the price of $356.00, my credit on my account will be $71.20.  Not nearly what I think I should get for what I missed but I know I’m not going to get anywhere with this guy.  He thanks me for using StubHub (!) and the call ends.\n\nA couple of minutes later, [an email comes through showing the credit issued to my account](https://imgur.com/Wjryil1).  $17.80.  Only missed the mark by $53.   At this point, I am at a loss for words.  \n\nI have sent off yet another email re-explaining everything and asking the questions:\n\n* Why does the seller retain control over tickets that he sold and [received money for](https://imgur.com/AlpkvTh)?\n\n* Why does StubHub not warn it’s buyers that you will not make it in to your event if the seller chooses to take his tickets back and resell them to someone else?\n\n* Why was I never advised before I made it to the gate that I was not going to get in?  Had I been advised with enough time, I could have received my refund and still bought other tickets.  By the time I found out I wasn’t getting in and then waited on hold for 40 minutes, I missed my chance to get in.\n\n- Why was the offer of equal or better seats never given to me at the time?  I would have been mad at missing the first quarter, but at least I would have seen the final three quarters.\n\n* Why is there not some sort of seller feedback system to warn buyers of fraudulent sellers similar to eBay?  By their own representative’s admission, this seller was known to StubHub to be a potentially fraudulent seller.  Had I known this guy had issues, I obviously would have avoided the listing.\n\nHere is StubHub’s guarantee [straight from their website](http://www.stubhub.com/fanprotect-update/):\n\n**Summary of StubHub guarantee to Buyers:**\n\n* *You will get your tickets in time for the event*\n\n* *Your tickets will be valid for entry*\n\n* *Your tickets will be the same as those you ordered*\n\n*If any of these things do not occur and you comply with applicable policies and timelines, we will find you comparable or better tickets to the event, or offer you a refund or FanCode for future purchase*\n\n\nI was never, at any point last night, offered comparable or better tickets.  Even though at that point, I would have been mad as I had already missed the first quarter.\n\n\nI apologize for the exceptionally long post.  I want to warn people about StubHub and tell everyone that this company is no better than buying from some stranger on Craigslist.  I hope this gains some traction so that no one else has to go through something as bad as this. I'm so sorry man. I myself intentionally didn't buy tickets for this game because I've heard stories in the past about how bad they are when it's a desirable game (so I only use them for random, non-important games), and I absolutely regretted not trying to get some tickets last night when I watched it on TV. \n\nAs a Kings fan of so many years, I would be absolutely devastated. I grew up with them, and I was kicking myself last night for not watching them leave Arco in person. I know it's not about the money. It's about not being able to say goodbye to your childhood home.\n\nI'm sorry that it happened to you.", "class": "r/nba"}, {"text": "Lonzo Ball released more songs on spotify (21), than he made free throws last season (20). I saw a joke on twitter that Lonzo has more songs than made free throws and checked the stats and it is true.. he went 20/48 from the line last season and he has 21 songs on spotify. I‘ll say that it’s pretty impressive that he has 21 songs and that he’s a pretty good rapper too. How the fuck does an NBA guard shoot 20/48 from the line?", "class": "r/nba"}, {"text": "[x-post from r/warriors] Klay Thompson signed my toaster. So I went to a Klay Thompson autograph signing in SF a couple days ago. I had him sign a GSW toaster that I've had for a while.\n\nhttps://imgur.com/gallery/rbe1A\n\nAnd here's Klay looking intensely into a toaster.\nhttps://imgur.com/gallery/Jw48q\n\nEdit: Wow gold. Never thought Klay looking at a toaster would get this huge. [If you gaze long into an abyss, the abyss will gaze back into you.](https://i.imgur.com/iQ655Kt.jpg)", "class": "r/nba"}, {"text": "Tim Duncan's leadership link If he spoke I think I’d listen too tbh", "class": "r/nba"}, {"text": "[Mark Medina] Draymond Green on when people say \"stick to sports\" and not speak about politics. Draymond: \"That’s funny because I see everyone thinks they can speak basketball.\" link [removed]", "class": "r/nba"}, {"text": "2 GOAT rebounders battle it out. link What an awesome sequence.", "class": "r/nba"}, {"text": "All-NBA name teams. **The All-NBA Most Likely to be Mispronounced team**\n\nPG- Giannis Antetokounmpo\n\nSG- Frank Ntilikina\n\nSF- Kostas Papanikolaou\n\nPF- Ersan Ilyasova\n\nC- Jonas Valanciunas\n\n\n**The All-NBA \"They misspelled my name again\" team**\n\nPG- Anfernee Hardaway\n\nSG- Dwyane Wade\n\nSF- Antawn \"But for real, call me Antwan\" Jamison\n\nPF- Marreese Speights\n\nC- Juwan Howard\n\n**The All-NBA \"I look exactly like my name sounds\" team**\n\nPG- Pablo Prigioni\n\nSG- Popeye Jones\n\nSF- Slick Watts\n\nPF- Dirk Nowitzki\n\nC- Kelly Olynyk\n\n\n\n**The All-NBA middle name team**\n\nPG- Rajon Pierre Rondo\n\nSG- Kobe Bean Bryant\n\nSF- Kevin Wayne Durant (If KD changed his number to 40 his new nickname could be WD40)\n\nPF- Tyson Cleotis Chandler\n\nC- Steven Funaki Adams\n\n\n**The All-NBA \"Thank God for my middle name\" team**\n\nPG- Wardell Stephen Curry\n\nSG- Walter Ray Allen\n\nSF- Kehinde Babatunde Victor Oladipo\n\nPF- Holdyn Jerian Grant \n\nC- Hyland DeAndre Jordan\n\n**The All-NBA Prophet Team**\n\nPG- Ishmael Smith\n\nSG- Fred Christ\n\nSF- Jesusemilore Ojeleye\n\nPF- Moses Malone\n\nC- Joakim Noah\n\n**The All-NBA Speed Team**\n\nPG- Speedy Claxton\n\nSG- Bob Quick\n\nSF- Brandon Rush\n\nPF- Kareem Rush\n\nC- Stromile Swift\n\n\n**The All-NBA Toon Squad**\n\nPG - Pepe Sanchez\n\nSG - Pooh Richardson\n\nSF - Barney Cable\n\nPF - Popeye Jones\n\nC - Mickey Johnson\n\n\n\n\n**The All-NBA Servile Team**\n\nPG- Daequan Cook\n\nSG- Dion Waiters\n\nSF- Otto Porter\n\nPF- Caron Butler\n\nC- Wilt Chamberlain\n\n**The All-NBA Pornstar Name Team**\n\nPG- Fat Lever\n\nSG- Magic Johnson\n\nSF- Dick Van Arsdale\n\nPF- Chubby Cox\n\nC- Tiago Splitter\n\n**The All-NBA Female Pornstar Name Team**\n\nPG- Courtney Lee\n\nSG- Jodie Meeks\n\nSF- Kim English\n\nPF- Diamond Stone \n\nC- Alexis Ajinca\n\n\n\n\n**All-NBA Nerdy Name Team**\n\nPG-Vernon Maxwell\n\nSG- Kennard Winchester\n\nSF- Quincy Pondexter\n\nPF- Clarence Weatherspoon\n\nC- Olden Polynice \n\n\n**The All-NBA \"We Barely Escaped Having Nerdy Names and Instead Have Quite Distinguished Names\" Team**\n\nPG- Langston Galloway\n\nSG- Clyde Drexler\n\nSF- Perry Worthington\n\nPF- Worthington R. Patterson\n\nC- Charles Shackleford\n\n\n\n**The All-NBA \"Names that sound distinguished and ghetto at the same time\" team**\n\nPG- Chauncey Billups\n\nSG- Kentavious Caldwell-Pope\n\nSF- Martell Webster\n\nPF- Rondae Hollis-Jefferson\n\nC- Sindarius Thornwell\n\n\n\n\n\n**The All-NBA \"Shouldn't The Last Name and the First Name Be Switched Around?\" Team**\n\nPG- Jarrett Jack\n\nSG- Walker Russell\n\nSF- Carmelo Anthony\n\nPF- Kornel David\n\nC- Randolph Morris\n\n\n**The All-NBA Anatomical Name Team**\n\nPG- Maurice Cheeks\n\nSG- Jason Hart\n\nSF- Luther Head\n\nPF- Foots Walker\n\nC- BJ Armstrong\n\n\n**The All-NBA Animal Kingdom of a Name Team**\n\nPG- Rory Sparrow\n\nSG- Rick Fox\n\nSF- Larry Bird\n\nPF- Bison Dele\n\nC- Matt Fish\n\n\n**The All-NBA Exploring the Wonders of Nature Team**\n\nPG- Royal Ivey\n\nSG- Austin Rivers\n\nSF- Jamario Moon\n\nPF- Cherokee Parks\n\nC- Tree Rollins\n\n\n\n**The All-NBA Most Colorful Names in the Game Team**\n\nPG- Jo Jo White\n\nSG- Blue Edwards\n\nSF- Norman Black\n\nPF- Sidney Green\n\nC- Stuart Gray\n\n\n**The All-NBA Inanimate Objects as Names Team**\n\nPG- John Wall\n\nSG- Raja Bell\n\nSF- Keith Van Horn \n\nPF- Cedric Ball\n\nC- Greg Kite\n\n**The All-NBA Flora Team**\n\nC- Tree Rollins\n\nPF- Charles Oakley\n\nSF- Royal Ivey\n\nSG- Zach LaVine\n\nPG- Derrick Rose\n\n**The All-NBA \"Does my name make anyone else here hungry?\" team**\n\nPG- Steph Curry\n\nSG- O. J. Mayo\n\nSF- Glen Rice\n\nPF- Channing Frye\n\nC- Ron Baker I just kept scrolling, and OP just kept giving.", "class": "r/nba"}, {"text": "Harden drops Johnson then hits the three! link [Houston broadcast and Replays](https://streamable.com/5cf4z)\n\nCredit: /u/dragonballa", "class": "r/nba"}, {"text": "[Highlight] James Harden hits himself in the face after slamming the ball in frustration link **Replays/alternate angles**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Don't let these huge trades distract you from the fact that Elfrid Payton tweeted yesterday \"if you ain't good, you gone\" and was subsequently traded today for a 2nd round pick How can he recover from this / what hairstyle will he grieve with in Phx he spoke it into existence the absolute madman ", "class": "r/nba"}, {"text": "A Lakers Fan Raised Almost $43k to Hand Out “Stand with Hong Kong” T-Shirts at the Season Opener link lmao that game is going to be a cluster fuck. Who are they playing against.", "class": "r/nba"}, {"text": "Bradley Beal reacts to fan telling him he sucks link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Max Kellerman speaking up about Lebron's shilling is now the #1 all-time post of /r/nba, completing his redemption arc after \"fartgate\" He has now eclipsed both the original gaseous post, and Paul Pierce becoming the Truth when he confessed about his own, more solid excrement. Meaning the top post in /r/nba is not literally a shit post anymore, but instead a principled stand for freedom.\n\nTruly, a glorious day.\n\nedit: Kellerman basically telling Lebron \"I fart in your general direction (towards continental China)\" Max comes out smelling like roses this time around.", "class": "r/nba"}, {"text": "In H.S, Jeremy Lin had a 4.2 GPA, averaged 15/7/6 and 5 steals, made first-team all state and won a California State Championship. He was offered zero athletic scholarships. His team defeated nationally ranked Mater Dei, the [#2 nationally ranked High School athletic program](https://en.m.wikipedia.org/wiki/Mater_Dei_High_School_(Santa_Ana,_California), to win the CIF title after 23 consecutive wins for Mater Dei.\n \nLin was the North Cali division 2 player of the year, and first team all California is a huge deal. \n\nHe sent his Resume and DVD to several schools including UCLA, Stanford, UC Berkeley, and Arizona State.\n\nHis academic achievements eventually got him into Harvard, where the basketball coach was hesitant to give him a role until he saw him play. \n\nHis senior year, he was a nominee for both the John Wooden award and the Bob Cousy award. \n\nHe went undrafted. http://www.espn.com/blog/high-school/california/post/_/id/631/jeremy-lin-and-the-2006-all-state-team\n\n\nAs a state finalist, Ryan Anderson, James Harden, Chase Budinger were also finalists along GM side Lin.\n", "class": "r/nba"}, {"text": "When Melo pranked fans at the wax museum... link Melo used to be so elite, I want to go back", "class": "r/nba"}, {"text": "ESPN/ABC should take note of what Tony Romo did in the booth last night and replace Mark Jackson with someone who actually provides insight and perspective during a nationally televised NBA game. Last night Tony Romo added beautiful color commentary to the Chiefs/Patriots game last night. As a former Quarterback he provided great insight as to what play the other team may or may not run, and why. He even predicted quite a few plays. \n\nWhat we get for nationally televised NBA games during the Conference Finals and NBA finals from Mark Jackson is nothing short of crap. Jackson offers no insight as a former point guard. Instead he spends most of the game poking fun at JVG and talking about absolute nonsense and quite frankly I’m sick of it. He distracts the fans and ruins the experience, especially when it’s a game when there’s so much on the line.  But where else will we get: “Mama, there goes that man!!” 4 times a game?", "class": "r/nba"}, {"text": "Gordon Hayward Breaks His Leg *GRAPHIC* link >Hayward has broken his leg\n\n>Hayward has broken his leg\n\n>Hayward has broken his leg\n\n\nDamn you could hear the shock in Kevin Harlans voice.", "class": "r/nba"}, {"text": "the Lebron to D-Wade alley oop, 2017 link Wade: “Lets get this highlight”\n\nWade’s knees: “Nah”", "class": "r/nba"}, {"text": "[Charania] Magic Johnson has stepped down from President of Basketball Ops of the Lakers. link [[Wojnarowski] Since taking over as president of the Lakers, Magic Johnson never fully committed to the job. Often he was traveling and away from the team. His office hours were limited. He didn't do a lot of scouting. Running an NBA team takes a tremendous commitment of time and energy.](https://www.twitter.com/wojespn/status/1115781512639799296)\n\n[[Ganguli] Luke Walton is asked if there’s any anxiety for him about his future. “No anxiety. But call me later tonight and the answer might be different,” he says, smiling.](https://twitter.com/taniaganguli/status/1115779613223833600?s=21)\n\n[[McMenamin] Magic Johnson is conducting an impromptu press conference and just stepped down as Lakers president. He said he loves Jeanie Buss like a sister.](https://twitter.com/mcten/status/1115780677608173568?s=21)\n\n[[Haynes] Magic Johnson says he likes to be free to congratulate players such as Russell Westbrook when he hit the 20–20-20 mark. Says he couldn’t be himself and he hasn’t informed Jeanie Buss yet.](https://twitter.com/ChrisBHaynes/status/1115781979138547712?s=20)\n\n[[Oram]Stunning. Magic says he has not told Jeanie his decision.   “Somebody’s going to have to tell my boss because I knew I couldn’t be face-to-face and tell her. ... I couldn’t stand to tell her.”   Says what she had in him was someone she could trust and be loyal.](https://twitter.com/billoram/status/1115781948780175360?s=19)\n\n[[Oram] Magic says the Ben Simmons situation hurt him because it made him “look like the bad guy.” Wants to be able to mentor people around the league. “Hopefully I can go back to who I was before I took this job.”](https://twitter.com/billoram/status/1115781533074243584?s=19)\n\n[[Oram] Magic said this decision was not about the decision with Luke Walton, but has now said it made him uncomfortable to be in a position between Jeanie and Luke.](https://twitter.com/billoram/status/1115783107255328769?s=21)\n\n[[McMenamin] Magic Johnson said he will return to community work and reaching out to players around the league to help in their development: “I’m a free bird and I can’t be handcuffed ... This is a good day.”](https://twitter.com/mcten/status/1115784020741087232)\n\n[[Shelburne] Nobody and I mean nobody had a sense Magic was gonna do this today.](https://twitter.com/ramonashelburne/status/1115783407202590720?s=19)\n\n[[Wojnarowski] Lakers coaching staff fully expected to be fired in hours after the final game of the season. They had believed they were gone for months. Now? Magic quits in public, saying he's too scared to tell Jeanie Buss face-to-face. What an embarrassing episode for a historic franchise.](https://www.twitter.com/wojespn/status/1115784544089780229)\n\n[[Ganguli] It’s hard when you love an organization like I love this organization,” Magic Johnson says as he starts to cry. “It’s hard when you love a person like I love Jeanie.” Talks about how much Jeanie loves Luke too.](https://twitter.com/taniaganguli/status/1115784430218403840)\n\n[[McMenamin] Magic Johnson did not endorse anyone to fill his position but said Jeanie Buss will undoubtedly field dozens of phone calls from interested parties.](https://twitter.com/mcten/status/1115785746227449856)\n\n[[Oram] Magic is still going. On his infamous early-season meeting with Luke: “I think everybody blew that up. They overblew it. ... We had a tough meeting and after that we’ve been fine ... We haven’t had any problems.”](https://twitter.com/billoram/status/1115786598543572992)\n\n[[Oram] Magic: “Do I think Rob is the right GM? That’s a decision Jeanie has to make.](https://twitter.com/billoram/status/1115786973145325568?s=20)\n\n[[Ganguli] Magic Johnson indicates he didn’t want to put himself or Jeanie Buss in a position where he’d have to fire Luke Walton.](https://twitter.com/billoram/status/1115786973145325568?s=20)\n\n[[Ganguli] Magic talks about D’Angelo Russell and says congratulations to him. He adds he couldn’t say that before or it would have been tampering. Also says Russell matured and that’s why he’s an All Star now.](https://twitter.com/taniaganguli/status/1115787813205602305)\n\n[[McMenamin] This press conference is 35 minutes and counting. ](https://twitter.com/mcten/status/1115789173305176064)", "class": "r/nba"}, {"text": "[Fenno] BREAKING: California's state Senate unanimously passed a bill to allow college athletes to profit from their name, image and likeness. Gov. Gavin Newsom has 30 days to sign or veto the bill. link How does this work with the NCAA's own rules?", "class": "r/nba"}, {"text": "Giannis jumps over Tim Hardaway Jr. for the alley-oop link title isn’t even an exaggeration ", "class": "r/nba"}, {"text": "Curry bounces it high for the Giannis slam | TNT link ### **Replays/alternate angles**\n                \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "The Outrage of NBA Fans is Disproportionate. I'd like to preface this by stating that what GSW part-owner Mark Stevens did in game 3 was unacceptable. He pushed Kyle Lowry and deserves to be fined and suspended from attending games.\n\n&nbsp;\n\nHowever, it is my opinion that the outcry has been wildly disproportionate to other acts of violence in the NBA.\n\n&nbsp;\n\nI realise that it was less about the fact that the 60 year old Silicon Valley venture capitalist might've hurt Lowry with his left handed push and was more just the fact that he laid his hands on a player in an unfriendly way. \n\n&nbsp;\n\nThe public outcry has been intense. People are calling for a lifetime ban and demanding that he be forced to sell his shares in the team. The incident is already written on his Wikipedia page.\n\n&nbsp;\n\nPeople are out for blood with Kyle Lowry leading the charge.\n\n&nbsp;\n\n>\"A guy like that, showing his true class, and he shouldn't be a part of our league. There's just no place for that.\"\n\n&nbsp;\n\n>\"The support I've gotten from fellow players, the league, has been unbelievable. With that being said, I think more should be done.\"\n\n&nbsp;\n\n>\"I have 2 young children and being able to hold myself to a certain standard. Which I do. I hold myself to a high, high standard.\"\n\n&nbsp;\n\nThese are all quotes from Kyle Lowry. The same Kyle Lowry who in 2012 pled guilty to the battery of a female referee at a charity basketball game. \n\n&nbsp;\n\nThis was one of his quotes on that day:\n\n&nbsp;\n\n>\"B****, meet me outside. I will kick your a**!\"\n\n&nbsp;\n\nHe then proceeded to throw a basketball at her for a second time, as hard as he could. He (potentially) received a fine of up to $1,000 and was suspended for 0 games. 500 times less than Mark Stevens got for his push. The fine was from a judge in a courtroom and not even from the league. The league did nothing. There is no mention of this on Lowry's wikipedia page. \n\n&nbsp;\n\nIf Lowry thinks $500,000 and a year ban is soft for Mark Stevens then I wonder what he thought about his $0, 0 game punishment for battery of a woman in 2012?\n\n&nbsp;\n\nIn August of 2010, beloved NBA clown Lance Stephenson pushed his pregnant girlfriend down a staircase and then proceeded to bash her head against the stairs. \n\n&nbsp;\n\nTwo years prior to this he sexually assaulted a 17 year old girl at his high school.\n\n&nbsp;\n\nHe went on to play over 500 NBA games and earn over $35 million dollars. \n\n&nbsp;\n\nAt the time of the staircase attack, he hadn't played a single NBA game. 9 years later, he's still in the league. \n\n&nbsp;\n\nI was a fan of Lance but only because I'd never heard this mentioned in a single one of his games. I even paid actual money to buy his Charlotte Hornets jersey. I wore his name and number on my back. Call me old fashioned, but I think that the second you bash your pregnant girlfriend's head against some stairs, you should forfeit the privilege of playing NBA basketball.\n\n&nbsp;\n\nOJ Mayo and Tyreke Evans were both given 2 year bans for violating the NBA anti-drug program. The NBA is prohibited from disclosing what type of drugs they were found to have taken but reports suggest the violations were related to \"drugs of abuse\" which implies they were recreational and not performance enhancing.\n\n&nbsp;\n\nJason Kidd was fined $200 (by a judge) for abusing his wife. He was suspended for 0 games.\n\n&nbsp;\n\nDarren Collison, Jason Kidd, Jason Richardson. The NBA has a history of letting abusers off lightly. All just because they're good at basketball.\n\n&nbsp;\n\nI'm a firm believer in forgiveness and giving people second chances but if Kyle Lowry and NBA fans think Mark Stevens should be banned for life then Kyle Lowry should've never become a Raptor, Jason Kidd should not be the league's highest paid assistant coach and Lance Stephenson should've never played a minute in the NBA. \n\n&nbsp; thanks for this OP i had no clue about any of these except kidd", "class": "r/nba"}, {"text": "[Charania] Spurs legend Tim Duncan has joined Gregg Popovich's coaching staff as an assistant coach. link SAN ANTONIO RUNS ON DUNCAN", "class": "r/nba"}, {"text": "Mamba mood link Dont know why but kobe looks like a roman official, or even emperor", "class": "r/nba"}, {"text": "Yao Ming on the state of Chinese basketball: \"If 10 years from now we still use Yao Ming to represent China, it's a failure on my job. We need a new star to rise up.\" link > Yao was unveiled to the world at the 2000 Sydney Games, where expectations clearly preceded him, considering the $1 million bounty promised by members of Team USA to anyone who posterized him during a prelim matchup. **(\"I was [almost] 20, I can't speak English,\" he says. \"Otherwise I would say, 'Anybody want half-million dollars? Just let me know.'\")**\n\nHeh heh", "class": "r/nba"}, {"text": "Kawhi's Game 7 shot is already immortalized outside of Scotiabank Arena. link I dunno about immortalized but they've definitely put up a poster.", "class": "r/nba"}, {"text": "[Post Game Thread] The Toronto Raptors defeat the Golden State Warriors 114-110 in Game 6 to win their first NBA Championship **[](/TOR) TOR**|**Min**|**FG**|**FT**|**3PT**|**+/-**|**OR**|**Reb**|**A**|**Blk**|**Stl**|**TO**|**PF**|**Pts**|\n|:---|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|\nM. Gasol|26:34|0-5|3-4|0-2|-7|3|9|4|0|0|1|4|3|\nP. Siakam|46:09|10-17|3-4|3-6|0|2|10|3|1|1|2|2|26|\nK. Lowry|41:41|9-16|4-6|4-7|+14|2|7|10|0|3|3|5|26|\nK. Leonard|41:08|7-16|5-6|1-5|-4|1|6|3|1|2|2|4|20|\nD. Green|17:44|0-0|0-0|0-0|+7|0|1|3|0|1|1|1|0|\nF. VanVleet|33:47|6-14|5-5|5-11|-12|1|2|0|0|1|1|1|22|\nS. Ibaka|22:06|7-12|1-2|0-1|+7|2|3|2|0|0|1|4|15|\nN. Powell|10:46|0-2|0-0|0-1|+5|0|1|0|0|0|1|2|0|\nO. Anunoby|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nP. McCaw|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Loyd|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nM. Miller|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nC. Boucher|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Lin|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Meeks|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nE. Moreland|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nTotals|240|39-82(.476)|21-27(.778)|13-33(.394)|-|11|39|25|2|8|12|23|112|\n\n**[](/GSW) GSW**|**Min**|**FG**|**FT**|**3PT**|**+/-**|**OR**|**Reb**|**A**|**Blk**|**Stl**|**TO**|**PF**|**Pts**|\n|:---|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|\nK. Looney|26:55|3-7|0-0|0-0|-4|2|3|3|1|1|1|2|6|\nD. Green|44:11|5-10|0-2|1-4|+2|4|19|13|2|3|8|4|11|\nS. Curry|41:52|6-15|6-6|3-9|+1|1|3|7|1|2|3|3|21|\nA. Iguodala|32:13|9-15|1-5|3-6|-3|0|2|2|1|0|1|2|22|\nK. Thompson|32:00|8-12|10-10|4-6|+5|1|5|0|0|2|2|3|30|\nD. Cousins|18:39|4-9|4-7|0-1|0|1|5|2|1|0|0|3|12|\nS. Livingston|16:01|3-5|0-0|0-0|-1|0|0|0|0|1|1|1|6|\nQ. Cook|12:26|1-4|0-0|0-3|-14|0|1|0|0|0|0|2|2|\nA. McKinnie|10:29|0-1|0-0|0-1|+4|2|3|0|0|0|0|2|0|\nA. Bogut|2:50|0-1|0-0|0-0|-1|0|1|0|0|0|0|0|0|\nJ. Jerebko|2:19|0-0|0-0|0-0|+1|0|0|0|0|0|0|0|0|\nM. Derrickson|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nD. Jones|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Bell|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nD. Lee|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nK. Durant|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Evans III|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nTotals|240|39-79(.494)|21-30(.700)|11-30(.367)|-|11|42|27|6|9|16|22|110|\n\n||\n|:-:|\n|^[nbaboxscoregenerator.com](http://www.nbaboxscoregenerator.com) ^by ^/u/Obi-Wan_Ginobili| Doris about to bring up ex wives here in a second", "class": "r/nba"}, {"text": "[Wojnarowski] Oklahoma City is trading All-Star Paul George to the Los Angeles Clippers for a record-setting collection of draft choices, league sources tell ESPN. link We have to play warriors, clippers, and Lakers how many times next year?", "class": "r/nba"}, {"text": "Trae Young doesn’t even hit the rim on deep 3-pointer attempt link Ah you got me ", "class": "r/nba"}, {"text": "I do in-game media for the Dallas Mavericks and after two years of asking they finally let me do an Overwatch video! Please enjoy MAVERWATCH! link The way Harrison Barnes says \"it's high noon\" is fucking hilarious ", "class": "r/nba"}, {"text": "Derrick Rose gets MVP chants in the United Center link ### Replays/alternate angles\nIf this post is a highlight, reply to this comment with replays, alternate angles, and other accompanying media. \nIf your highlight is removed or doesn't show up in the new queue, it was probably removed because it didn't meet our highlight quality standards or is a duplicate of another highlight.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "LeBron with the ridiculous and 1 link That's going on the career highlight reel", "class": "r/nba"}, {"text": "Board Man celebrates link Man that is a legendary photo.", "class": "r/nba"}, {"text": "There was literally only two NBA games last night and ESPN First Take did not talk about the Raptors/ Pelicans game at all Pretty interesting although not surprising how they did not discuss the banner and ring night or how the reigning champs are looking. Guess it’s back to status quo now.\n\nEdit: DONT LET THIS GET TO THE TOP OF R/NBA OR I WILL KEEP POSTING MY DUMB OPINIONS\n\nEdit2: ESPN IS A BUNCH OF WASTEMANS\n\nEsit3:YOU KNOW WHO IS NOT A WASTEMAN? THE PERSON WHO GAVE ME GOLD 🙏🏽 The only reason first take even exists anymore is to get funny Stephen A clips that people will use in twitter replies.", "class": "r/nba"}, {"text": "My Next Chapter | By Kevin Durant link Somewhere in middle America, JR smith just put his shirt back on.", "class": "r/nba"}, {"text": "NBA officially proposes lowering draft age to 18 link Huh, I always thought it wasn’t an age thing, but a requirement to be 1 year removed from High School", "class": "r/nba"}, {"text": "[Wojnarowski] New York has agreed with Dallas on trade that includes Kristaps Porzingis, Courtney Lee, Tim Hardaway Jr., for Wesley Matthews, Dennis Smith Jr. and DeAndre Jordan, league sources tell ESPN. Players and agents are being notified of particulars. Deal may include more draft assets. link Yes officer this trade right here", "class": "r/nba"}, {"text": "Charles Barkley: \"I don't like the fan's vote. What happened last time when we let them make a big decision? White House.\" link Civil discussion as always guys, bans will be handed out where appropriate.\n\nHad to lock, sorry guys.", "class": "r/nba"}, {"text": "The Big 3 together one more time! link Manu’s like “these fuckers didn’t even try to dress up for TV”", "class": "r/nba"}, {"text": "Toronto fans cheering as KD goes down hurt link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Report: Warriors' Durant expected to miss entire 2019-20 season link >Golden State Warriors superstar Kevin Durant is expected to miss the entire 2019-20 season after undergoing surgery for a ruptured right Achilles tendon, reports ESPN’s Adrian Wojnarowski.\n\n>The two-time NBA Finals MVP and 2014 regular-season MVP revealed the severity of his injury in an Instagram post Wednesday, two days after getting hurt during the Warriors’ Game 5 win over the Toronto Raptors. It was his first game in more than a month after being sidelined with a right calf strain.\n\n\n>Despite the news, Wojnarowski cited league sources indicating that the Brooklyn Nets and the New York Knicks remain interested in signing soon-to-be free agents Durant and Kyrie Irving into max salary slots.", "class": "r/nba"}, {"text": "[Feldman] 7-foot-5 Tacko Fall entered concussion protocol because he hit his head on 'low ceiling' link This is an incredible headline that is totally expected for someone that is Tacko's height, but also hilarious.", "class": "r/nba"}, {"text": "Melo just lays on the court, nobody gives a fuck and play goes on. link I watched that twice and didn't notice Melo at all.", "class": "r/nba"}, {"text": "[Wojnarowski] Sacramento has agreed to trade DeMarcus Cousins to the New Orleans Pelicans, league source tells @TheVertical. link So my roommate is a kings fan. How do I ask him for march rent before he kills himself?", "class": "r/nba"}, {"text": "[Wojnarowski] Golden State’s Klay Thompson has suffered a torn ACL in his left knee, his agent Greg Lawrence tells ESPN. link At this rate it's almost better there wasn't a Game 7; Curry would have been hit by a bolt of lightning.", "class": "r/nba"}, {"text": "[Wojnarowski] Kevin Durant is planning to sign with the Brooklyn Nets, league sources tell ESPN. link Kyrie to KD: what does the word government mean to you?\n\nKD: I’ve made a huge mistake", "class": "r/nba"}, {"text": "[Wojnarowski] New York has agreed to a deal to send Carmelo Anthony to OKC for Enes Kanter, Doug McDermott and a draft pick. link Kanter: \"OKC is the best organization in the NBA.\"\n\n*OKC trades him*", "class": "r/nba"}, {"text": "Max Kellerman on Lebron: \"It's called selling out. It's very easy to take a stand when there is low to no cost. When there is a real price to pay, then who will stand up? Mohammad Ali did. Not Lebron James\" link Mohammad Ali is the perfect example. Dude lost years of his prime over protesting what he thought was right. I mean, shit, he took it to the US Supreme Court since he was the one with the money and could afford to take a stance against the US Government.", "class": "r/nba"}, {"text": "Carmelo puts OKC up by 1 before Wiggins wins it at the buzzer link that crowd went 100 to 0 real fucking quick", "class": "r/nba"}, {"text": "Kobe to Shaq alley-oop, Game 7 of the 2000 Western Conference Finals. link Pippen should have gone back to being invisible after getting crossed up that bad", "class": "r/nba"}, {"text": "Every Phoenix Suns player starts running at the exact same moment link 9-2 is such a promising start, i wonder how the rest of the game went", "class": "r/nba"}, {"text": "[Wojnarowski] The Clippers have agreed to a deal to send Blake Griffin to the Detroit Pistons, league sources tell ESPN. link Trade as we know it currently: \n\n**Clippers send:** \n\n* Blake Griffin (PF)\n* Willie Reed (C) \n* Brice Johnson (PF)\n\n**Pistons send:** \n\n* Tobias Harris (F)\n* Avery Bradley (SG)\n* Boban Marjonovic (C)\n* 2018 1st Round Pick ^[1](https://twitter.com/wojespn/status/958121789179203585)\n* 2019 2nd Round Pick", "class": "r/nba"}, {"text": "Pop has the most total wins as a head coach with 1,413. Here's his reaction after he got the first one, on December 14, 1996. link Pop was a crazy lad. Fired the head coach back then and said I've got this", "class": "r/nba"}, {"text": "[Rovell] Girl named Riley Morrison asks @StephenCurry30 why his sneakers don’t come in girls sizes. Steph responds. link My man really said #RUINTHEGAME lmao ", "class": "r/nba"}, {"text": "New NBA fan with a question. I was watching the Cavs practice tonight, why were there some people running around in Celtics jerseys? Hey sorry if it's a dumb question, I was just wondering why the practice was getting interrupted and no one was doing anything about it? It didn't really seem to mess them up though which is why I guess security didn't do anything. You know it's bad when we have off season level shitposting during the conference finals.", "class": "r/nba"}, {"text": "DeAndre Ayton forgot to change his sample text link \"I hate this fucking game #BlackOps4 #CallofDutyPartner\"", "class": "r/nba"}, {"text": "LeBron forgets he's not on the Heat anymore link If Norris Cole passes him the ball off that screen do you think he takes the shot?\n\nThat'd be the funniest moment in NBA history.", "class": "r/nba"}, {"text": "Kawhi sents Raptors to ECF - SNET = link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "[Wright] Spurs coach Gregg Popovich was asked why he thinks it’s important to give back to the community: “Because we’re rich as hell and we don’t need it all, and other people need it. Then, you’re an ass if you don’t give it. Pretty simple.” link He always tips waiters thousands of bucks whenever the spurs are in town ", "class": "r/nba"}, {"text": "Lebron James response to Kyle Lowry and Warriors part-owner incident link The face of the NBA has spoken. This will now be dealt with properly by Silver.", "class": "r/nba"}, {"text": "With 4 minutes and 20 seconds left in the 4th quarter this was the score during the Warriors vs. Clippers summer league game : link Why has nobody pointed out it was a COX Scoreboard? ", "class": "r/nba"}, {"text": "Lou Williams eats nachos after dropping 36 points in the biggest comeback in NBA Playoff history link Na-cho night dubs fans", "class": "r/nba"}, {"text": "Kareem Abdul-Jabbar is auctioning off his championship rings and MVP trophies for charity: \"When it comes to choosing between storing a championship ring or trophy in a room, or providing kids with an opportunity to change their lives, the choice is pretty simple. Sell it all.\" link Can you fuckin imagine having Kareem’s MVP trophy sitting in your display case", "class": "r/nba"}, {"text": "Paul Pierce admits to shitting his pants in the NBA finals against the Lakers, and faking a knee injury to go to the bathroom [VIDEO] link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Dirk Nowitzki’s Full Page Thank You to Dallas in Today’s Paper link 21 fucking seasons with the same team. Props to the front office not fucking that up, absolute class act and loyalty all around.", "class": "r/nba"}, {"text": "[Windhorst] Kyrie Irving asked the Cavs to trade him in a meeting last week, sources told ESPN. link Shit they just said on NBA radio that Kyrie doesn't want to play with LeBron anymore. Holy shit ", "class": "r/nba"}, {"text": "Body Worn Camera Video Release of Sterling Brown Arrest link EDIT: 14 hours is long enough. Comment quality has degraded to the point where we're going to close it down. \n\nWe know this is a hot button topic, as it should be. We ask that commenters  follow [our rules](http://www.reddit.com/r/NBA/wiki/rules) and act respectful towards each other. \n\nRule breaking comments may result in a suspension. \n\n_____\n\n[Milwaukee Police Press Release](http://imgur.com/1mqt3YW)\n\n[Sterling Brown Press Release](https://pbs.twimg.com/media/Dd6kQ2hV4AA8ZKA.jpg)\n\n[Milwaukee Bucks Press Release](https://www.nba.com/amp/bucks/news/bucks-organization-statement-sterling-brown)", "class": "r/nba"}, {"text": "[Klein] Hawks are all-in on fan experience.. 1st NBA team to offer fan friendly concession prices: $1 Chips; $2 Candy, pretzel's, bottled water; $3 Fries, hot dogs, nachos $4 pizza, bottomless popcorn, bottomless soda; $5 beer link So living in LA, it would almost be cheaper to fly to Atlanta to go to a game.  OK OK", "class": "r/nba"}, {"text": "After the departure of Phil Jackson from the Lakers in 2004, Shaq went on TV and declared \"If a coach takes a team to the Finals 4 out of 5 years, I'll kiss his feet. With cheese on it. I will. It'll never be done again.\" Since then, Steve Kerr has taken the Warriors to 5 straight Finals. link **Replays/alternate angles**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Lakers/Raptors fans should turn the Kawhi situation into something positive. Winning team's fan base makes donations to other city's children's hospital? Toronto and Boston had something like this going during the NHL playoffs. Could be something nice coming out of all this increased attention.\n\nWow this blew up quick. I'm going to turn off mailbox replies lol.\n\nI'm a Toronto fan so I'll be making a $20 donation to https://www.chla.org/ if Kawhi signs with Toronto. I hope others do the same.\n\nToronto's Childrens Hospital is Sick Kids Hospital - https://www.sickkids.ca/\n\nI've cross posted this to both /r/torontoraptors and /r/lakers as well to get more eyes on it.\n\nFINAL EDIT: \n\nSo this is a turn of events. Clippers got him. I honestly thought they weren't really in the running anymore and it was a toss up between Lakers and Raptors. As I've said in comments I never meant any disrespect to Clippers fans and congrats to them! When they were brought up I really didn't know how to do a 3 way deal between 2 cities. Now that here here though...\n\nThe spirit of the wager was the winning team donates to the other teams kids hospital. Clippes fans have wanted to be in this so much I'm hoping now they step up. I'd suggest donating to either city's kids hospital. You want to keep your donation local give to CHLA, want to show Toronto some love give to Sick Kids in Toronto. for Lakes and Raptors fans I'm suggesting they each give to the other charity. As a Raptors fan I'm still going to give to CHLA. There is no reason not to in my mind.\n\nI'm glad my post could bring people together in a positive way and I know some good has come out of it.\n\nFINAL FINAL EDIT:\n\nI know this post is old now but I wanted to show that I put my money where my mouth is:\n\nhttps://imgur.com/FgGVGgL\n\nI hope others did as well. So you implying clippers dont even have fans? lol", "class": "r/nba"}, {"text": "Damian Lillard quotes Sun Tzu's The Art of War “It is the unemotional, reserved, calm, detached warrior who wins, not the hothead seeking vengeance and not the ambitious seeker of fortune.” [https://www.instagram.com/p/BwpUza1gmIc/](https://www.instagram.com/p/BwpUza1gmIc/) Damian Lillard, they're already dead", "class": "r/nba"}, {"text": "Michael Jordan hits a Triple Clutch Layup link My favorite part about this was the Net’s bench reaction", "class": "r/nba"}, {"text": "Charles: I really feel sad for Russell Westbrook. This kid gives 150% every single game and all he does is get criticized.. Is he the perfect basketball player, no. But that guy gives maximum effort every single night. And as an old player and a fan, I'm going to always admire that man link imagine telling r/nba a week ago that Rocket fans would be defending and complimenting Westbrook in the near future", "class": "r/nba"}, {"text": "Bad officiating calls in Warriors-Rockets G7 Strap in boys, it's gonna be a ride. So I've basically reviewed the whole game last night, and here are the questionable plays which I thought should have been calls/were called wrongly.\n\n#Calls going against Rockets:\n\n1. [Wrong travelling call against Capela](https://streamable.com/cso98), didn't lift up his pivot foot.\n\n2. [Slight push on PJ Tucker no call, KD gets the call on the other end](https://streamable.com/boqtv). Probably a superstar call.\n\n3. [Harden might have gotten shoved in the back by Looney](https://streamable.com/7189z), no call.\n\n4. [Capela called for a goaltend for what seemed to be a clean block](https://streamable.com/qtz8u).\n\n5. [Harden fouled on the landing](https://streamable.com/4d9r6), no call. [Slowmo](https://streamable.com/s06jh)\n\n6. [Harden fouled on three attempt](https://streamable.com/bzjys), no call. [Slowmo](https://streamable.com/alpcm)\n\n7. [Ref disallows continuation on Harden's three](https://streamable.com/vhads). [Slowmo](https://streamable.com/lydp2)\n\n8. [Eric Gordon fouled by Draymond](https://streamable.com/zynw6), no call.\n\n#Calls going against Warriors:\n\n1. [Klay gets called for an early 2nd foul which didn't look like much contact](https://streamable.com/e0s94), looked like ball just slipped out of EG's hands.\n\n2. [Curry's hip gets pushed by Gerald Green](https://streamable.com/o4nk6), even falls on the ground. No call.\n\n3. [Jordan Bell raked across the arm by Harden](https://streamable.com/s2n6m), no call. (pro tip: right click and select 1/4 speed to see the contact)\n\n4. [Klay gets hand checked by Tucker and loses the ball](https://streamable.com/pqylu). No call. [Slowmo](https://streamable.com/j8f9c)\n\n5. [KD gets pushed into Harden by Ryan Anderson](https://streamable.com/n27zm), foul on KD. Similar to [this play](https://streamable.com/nhcep), albeit less egregious by Anderson.\n\n6. [Klay gets a point removed by Scott Foster](https://streamable.com/0nhtk).\n\nA major theme which showed itself was the fact that Ryan Anderson literally (I'm not kidding) hand checked Curry every time he was switched onto him. And the Warriors forced that switch A LOT. Here's ALL the plays where Anderson guarded Curry:\n\nhttps://streamable.com/el34r\n\nhttps://streamable.com/vtmzu\n\nhttps://streamable.com/uv829\n\nhttps://streamable.com/9fqlg\n\nhttps://streamable.com/junss\n\nhttps://streamable.com/2peej\n\nhttps://streamable.com/53mhy\n\nhttps://streamable.com/cuojo\n\nhttps://streamable.com/07r5o\n\nBonus Harden trying to draw foul when there was none & just looking like a fool:\n\nhttps://streamable.com/ca5v5\n\nhttps://streamable.com/jffyc\n\nOh and, inb4 Rockets fans accuse me of bias again, and calling me a Warriors fan. Would a Warrior fan post these?\n\nhttps://www.reddit.com/r/nba/comments/8lyh34/ariza_gets_called_for_a_blocking_foul_on_durant/\n\nhttps://www.reddit.com/r/nba/comments/8ly16n/curry_draws_3_free_throws_from_capela/\n\nhttps://www.reddit.com/r/nba/comments/8lfvoo/draymond_going_back_to_his_bad_habits/\n\nThe entire game is freely available online, if you're so angry why don't you make your own compilation? And u/unklebuckets, still waiting for [your refs lowlights thread](https://www.reddit.com/r/nba/comments/8mf8tv/post_game_thread_the_golden_state_warriors_33/dzn4mpy/?context=3), or any of the 1+ million subscribers to make one.\n\nEdit: [Summary of the night](https://i.imgur.com/fHlyNne.jpg) lol. Credits to u/wetjumpshot\n\n Although this might get deleted because ref bashing, nice amount of research done here. Kudos\n\nEdit: Still up, wew", "class": "r/nba"}, {"text": "[Highkin] Awful news from San Antonio: Spurs announce that Gregg Popovich's wife, Erin, passed away today. link [Spurs GM RC Buford on the passing of Erin Popovich: \"We mourn the loss of Erin. She was a strong, wonderful, kind, intelligent woman who provided love, support and humor to all of us.\"](https://twitter.com/wojespn/status/986762877959884800)\n\n[Full statement from the Spurs](https://pbs.twimg.com/media/DbGtlf0WsAEvCEp.jpg)", "class": "r/nba"}, {"text": "Donald Trump just called Warriors head coach Steve Kerr a \"little boy\" for not calling out China No idea what to think but this should be left up as a thread on the sub. It's related to basketball & honestly, as much as I hate to say it but he does have a point\n\n[streamable link here to the video](https://streamable.com/lnlia) As with every thread, please be mindful of the [rules](https://www.reddit.com/r/nba/wiki/rules). All are still in effect, and bans will be handed out where necessary.\n\nHad to lock, as thread is getting brigaded and comments straying from relevance.", "class": "r/nba"}, {"text": "J.R. Smith runs out the clock and then keeps running link Sometimes I wish I was alive for Picasso, Van Gogh, or Michelangelo. Then I see posts like this and realize that great art is still among us", "class": "r/nba"}, {"text": "Joe Harris comments on the financial implications of Darryl Morey’s tweet: “I already get paid too much to play a game...” Full quote:\n\n\nJoe Harris on whether or not he is worried about the financial implications of Daryl Morey’s tweets: “I already get paid too much to play a game. So, not really.”\n\nPer Malika Andrews: \nhttps://twitter.com/malika_andrews/status/1184541643229335553?s=21\n\nJoe Harris is a man of the people and he presumably supports democracy. Joe Harris has a rocking beard and slangin dong\n\nEdit: for those of you in this thread comparing Joe to Lebron, here’s a YES Network side by side comparison of the two roughly 2 years ago. \nhttps://www.reddit.com/r/nba/comments/872u4d/yes_network_side_by_side_comparison_of_lebron/?utm_source=share&utm_medium=ios_app&utm_name=iossmf Bolder than 90% of the nba players and coaches", "class": "r/nba"}, {"text": "[BR] Adam Silver on Daryl Morey: \"We were being asked to fire him by the Chinese government. … We said there’s no chance that’s happening. There’s no chance we’ll even discipline him.\" (via @TIME) link Who knew China was such a little bitch ?", "class": "r/nba"}, {"text": "[Spears] “I believe he was misinformed and not educated on the situation,” LeBron James said on the Morey tweet. LeBron added Morey’s tweet was dangerous. LeBron said he is uncertain about the future ramifications of the Morey tweet with the NBA and players. link [[Spears]LeBron James was referring to the ramifications of Daryl Morey’s tweet on China and the events it unleashed when the Lakers star said the Rockets GM was misinformed, a source told Undefeated](https://twitter.com/MarcJSpearsESPN/status/1183924147958640642)\n\n[[Oram] LeBron just addressed the team’s trip to China, including saying he felt Daryl Morey was misinformed. He later clarified he meant “misinformed” of the ramifications of such a comment as opposed to the issue of Hong Kong’s sovereignty.](https://twitter.com/billoram/status/1183923098627657729?s=21)\n\n\n[[Faigan] Here is LeBron on his belief that Daryl Morey \"wasn't informed\" on the situation in China, and his thoughts on the consequences that come with free speech](https://twitter.com/hmfaigen/status/1183920065499942912?s=21) Transcript of what LeBron said", "class": "r/nba"}, {"text": "Caller on Stephen A. Smith's show mentions that all is not lost for the Knicks because Carmelo Anthony is available. Stephen A. Smith replies: \"Oh go to hell. Bye\", and drops the phone call link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Doncic sends the game in OT link LEBRON DINNER WITH DONCIC CONFIRMED", "class": "r/nba"}, {"text": "Kobe Bryant wins the Oscar for \"Dear Basketball\" in the animated short film category. link [Kobe's acceptance speech video](https://streamable.com/ytq4n)", "class": "r/nba"}, {"text": "James Harden gives the Rockets a one point lead with one second left! - TNT link ### Replays/alternate angles\n\nIf this post is a highlight, reply to this comment with replays, alternate angles, and other accompanying media. \n\nIf your highlight is removed or doesn't show up in the new queue, it was likely removed as a duplicate or for failing to meet quality standards.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Why LeBron would sign with every NBA team **Atlanta Hawks**\n\nLeBron is secretly a huge Twister fan. He will join the Hawks so he can film Twister 2 with their owner’s wife on their off days.\n\n**Boston Celtics**\n\nLeBron misses Kyrie. He wants to play basketball with his friend and that means playing for the Celtics.\n\nOR\n\nLeBron wants to troll Kyrie. He will go to Boston management and ask them to trade Kyrie back to Cleveland if they want him to join. Danny Ainge will agree because he has no heart.\n\n**Brooklyn Nets**\n\nLeBron loves NY. He will go to New York to sign with the Knicks to play in historic Madison Square Garden. However, during the drive to the stadium, his driver makes a wrong turn and they end up in Brooklyn. LeBron realizes the mistake, but shrugs his shoulders and signs with the Nets instead, because he will have the same results with either the Knicks or Nets.\n\n\n**Charlotte Hornets**\n\nLeBron wants to prove he’s better than Michael Jordan. He will sign with the Hornets to taunt MJ directly. He will win the Finals in 2019 with the Hornets and won’t let MJ touch the trophy. After the season, LeBron will buy out MJ’s shares and he will become majority owner. He will then trade himself to a better team because Dwight is too annoying and nobody will agree to LeBron’s trade proposals involving Dwight.\n\n**Chicago Bulls**\n\nLeBron wants to prove he’s better than Michael Jordan. He will sign with the Bulls so he can win 7 championships to pass what MJ did.\n\n\n**Cleveland Cavaliers**\n\nLeBron loves Cleveland as much as he hates moving. LeBron will re-sign with the Cavs, because it’s more convenient than moving to a different city.\n\n**Dallas Mavericks**\n\nLeBron is still haunted by the 2011 Finals. He will go to Dallas to learn from the true GOAT Dirk Nowitzki. There, LeBron will lead the Mavs all the way to the number 1 seed in the West, only to lose to the Warriors in the first round after KD leaves for India to re-join his snek charmer friend.\n\n**Denver Nuggets**\n\nLeBron loves chicken nuggets. He will sign with Denver, only to be disappointed. He then will retire and start his own chicken nugget company.\n\n**Detroit Pistons**\n\nLeBron will become the new Pistons President of Basketball Operations. His first act in his new role will be to sign himself as the head coach/starting SF. His second transaction will be to trade Blake Griffin to the Cavs for the 8th pick in the draft and salary filler, because LeBron will blackmail Dan Gilbert into doing it.\n\n**Golden State Warriors**\n\nLeBron wants all the ringz. He will sign with the Warriors for the veteran minimum so he can win not 1, not 2, not 3, not 4, not 5, not 6, not 7, not 8, not 9, but 10 championships.\n\n**Houston Rockets**\n\nLeBron loves space. He will sign with the Rockets so he can go to NASA and fly an actual rocket into space to find better competition on other planets. Mike Dan Tony will be confused why LeBron doesn’t show up to their games. Mike, he’s in space, deal with it.\n\n**Indiana Pacers**\n\nLeBron loves pace. He will sign with the Pacers so he can out-pace the other NBA players and win a championship. He will also become best friends with Lance Stephenson and the two will call out plays to each other by blowing in each other’s rear, I mean ear.\n\n**LA Clippers**\n\nLeBron wants to live in Hollywood, but doesn’t want to be under the shadow of Laker greats. If he can just lead the Clippers to the conference finals, they would rename their franchise LeBron’s Clippers.\n\n**LA Lakers**\n\nLeBron wants to live in Hollywood, but doesn’t want to be under the shadow of Clipper goods. He also wants to learn from the great Lavar Ball on how to play basketball as good as him.\n\n**Memphis Grizzlies**\n\nLeBron will not sign with the Memphis Grizzlies.\n\n**Miami Heat**\n\nLeBron will go back to Miami because he left his white headband there and wants it back.\n\n**Milwaukee Bucks**\n\nLeBron loves freaks. He will join the Greek Freak and sign with the Bucks. Then they will sign Rick James to preform every halftime so he can sing LeBron’s favorite song “Super Freak”\n\n**Minnesota Timberwolves**\n\nLeBron wants to learn from former MVP Derrick Rose. He also wants to torture his body and allow Coach Thibs to play him all 48 minutes for all 82 games.\n\n**New Orleans Pelicans**\n\nLeBron loves smoothies. He will join the Brow and sign with the Pelicans, so he can get unlimited smoothies at the Smoothie King Center.\n\n**New York Knicks**\n\nLeBron loves NY. He will go to New York to sign with the Knicks to play in historic Madison Square Garden. During the drive to the stadium, his driver makes the correct turn and they end up in MSG. LeBron realizes this and signs with the Knicks.\n\n**OKC Thunder**\n\nLeBron will sign with the Thunder so he can play with Russell Westbrook for one season, then leave after that and become an even better player.\n\n**Orlando Magic**\n\nLeBron will take his talents to Central Florida. He will sign with the Magic and lead them to another Finals lost.\n\n**Philadelphia 76ers**\n\nLeBron will sign with the 76ers because he trusts the process. LeBron will single handedly play bad for 3 seasons and tank so that the 76ers will get more draft picks to add to their squad. Then by age 37, LeBron will have what he needs to win another Eastern Conference Finals.\n\n**Phoenix Suns**\n\nLeBron loves hot-related teams. He will sign with the Suns and win 2 championships to prove to Pat Riley that he isn’t so special with his so called “Heat” for the “Suns” are the hottest thing in the universe.\n\n**Portland Trail Blazers**\n\nLeBron loves Nike. He will sign with the Blazers so that he can spend his off days at Nike headquarters creating new shoes.\n\n**Sacramento Kings**\n\nLeBron is the King. He will sign with the Kings, because that’s where he belongs.\n\n**San Antonio Spurs**\n\nLeBron loves Coach Pop. He will sign with the Spurs to learn from him, only to find out Coach Pop actually has no idea what he’s doing and is just really lucky. LeBron will use that luck to convince Kawhy? To stay and they will win a championship every other year in 2019, 2021, and 2023.\n\n**Toronto Raptors**\n\nLeBron will sign with the Raptors just to check up on them and make sure they are ok.\n\n**Utah Jazz**\n\nLeBron loves jazz. He will sign with Utah only to find out they don’t actually have jazz. He will then force a trade to New Orleans to be close to real jazz and because he remembered that he loves smoothies.\n\n**Washington Wizards**\n\nLeBron loves politics. He will sign with the Wizards so he can play basketball and also become the next president of the United States in 2020.\n\n\n\n**EDIT**\n\nSome of you have been asking for this, so here you go...\n\n**Seattle Supersonics**\n\nLeBron won't sign with this team because it doesn't exist. >doesn’t want to be under the shadow of Laker greats\n\n>doesn’t want to be under the shadow of Clipper goods", "class": "r/nba"}, {"text": "[Charania] San Antonio Spurs legend Manu Ginobili has retired from the NBA. Hall of Famer link Statement from Tim Duncan on his best friend retiring. “Nice.”", "class": "r/nba"}, {"text": "[Enes Kanter] -Haven’t seen or talked to my family 5 years -Jailed my dad -My siblings can’t find jobs -Revoked my passport -International arrest warrant -My family can’t leave the country -Got Death Threats everyday -Got attacked, harassed -Tried to kidnap me in Indonesia FREEDOM IS NOT FREE Lebron's comments have garnered a lot of reaction tonight, and Enes Kanter is amongst the many who have something to say about them. Having been victimized by injustice over the course of his life, he was caught off-guard by Lebron's comments and has been tweeting about them as a result. This tweet is just one of them. \n\nhttps://twitter.com/EnesKanter/status/1183949336901816326 By the way,  FBI agents have issued him a communications device that allows him to  contact the organization at a moment's notice due to credible threats  against his life", "class": "r/nba"}, {"text": "[DMitchell] A sign of an insecure human being is one who attacks others to make themselves feel better... im just sad that young kids have to see stupid tweets like these and grow up thinking it’s okay... forget everything else Donald your setting a bad example for kids😑 our future 🤡 link Remember when Melania's goal was to combat cyberbullying? I don't either.", "class": "r/nba"}, {"text": "Counsins and Embiid engage in an ass-slapping competition link SLAP ASSSSS", "class": "r/nba"}, {"text": "[Highlight] Adams throws a full-court hail mary to Schröder to send the game to overtime link **Replays/alternate angles**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Klay Thompson is now 0-5 when talking trash during the NBA Finals Warriors lost their next 3 after the \"its a man's game\" remark towards lebron james, and lost 2 since he trash talked drake \"See you in the bay aubrey\" \"Klay Thompson needs to stfu and start winning\" -TotallyNotKDsBurner35", "class": "r/nba"}, {"text": "Donavon Mitchell breaks out Webster's Dictionary for his response to Ben Simmons link Holy shit is this real", "class": "r/nba"}, {"text": "Dennis Rodman just posted this on Instagram link ### **Replays/alternate angles**\n                \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "[Haynes] Free agent forward Kawhi Leonard will sign with the Los Angeles Clippers, league sources tell Yahoo Sports. link  kawhi: yo danny i’m going to LA \n\ndanny: say no more \n\n**kawhi signs with clippers** \n\n**danny signs with lakers** \n\ndanny: wait what", "class": "r/nba"}, {"text": "Simmons hits the three! link Taking this momentous occasion to remind y’all to tag your highlights with [Highlight], as found in our [new rules](https://www.reddit.com/r/nba/comments/czl1us/announcement_rnba_new_rules_updates/) \n\nPost replays in reply to this comment.", "class": "r/nba"}, {"text": "Let’s name it free throw. link Shaq so insecure he frantically doing research to go at this guy ", "class": "r/nba"}, {"text": "‘Stand With Hong Kong’? Not When N.B.A.’s Chinese Fortune Is on the Line link For direct links to articles, please title them verbatim from the article. If you are quoting from the article, please post as a self post with the context from the piece in the body of your post, as well as a link to the full article. These rules exist to prevent the spread of fake news, and are very important for situations like this. Thanks", "class": "r/nba"}, {"text": "The Onion is savage AF link [They are always roasting him.](http://www.theonion.com/search?q=derrick+rose) Funny as fuck.", "class": "r/nba"}, {"text": "Why isn't LeBron taking the same criticism for joining the Lakers that KD got when he joined GSW? KD joined GSW after blowing a 3-1 lead to them in the West Finals. \n\nLeBron joined the Lakers after they won the Summer League title.\n\nWhat's with the double standard?  You fuckin boomed us", "class": "r/nba"}, {"text": "Warriors fan who shoved Raptors player is a part owner link Looks like he invested about $50 million for a 6% stake in 2013.", "class": "r/nba"}, {"text": "[Wojnarowski] The Oklahoma City Thunder have agreed to trade Russell Westbrook to the Houston Rockets for Chris Paul, first-round picks in 2024 and 2026, pick swaps in 2021 and 2025, league sources tell ESPN. link Someday ill tell my kids about the great offseason of 2019", "class": "r/nba"}, {"text": "Nurse Can't Believe the Call - TSN link [13 second version from TNT](https://streamable.com/37vr0)", "class": "r/nba"}, {"text": "Curry misses the dunk link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "The Wizards had bring your dog to work day. link an improvement from bring your guns to work day", "class": "r/nba"}, {"text": "[Withers] LeBron signing with Lakers. link Confirmed by Woj and Klutch Sports. \n\n[4 years, $154 million deal](https://twitter.com/wojespn/status/1013574987909824512?s=19)\n\n[Link to Klutch press release](https://twitter.com/KlutchSports/status/1013574315411849216?s=19)", "class": "r/nba"}, {"text": "James Harden has the first ever 60 point triple double in NBA history Harden has ended the game with 60 points, 10 rebounds, 11 assists, 4 steals, and 1 block. 19-30 FG, 5-14 from 3, and 17-18 FT. Only 5 turnovers in his 46 minutes of play\n\nEdit: He topped Westbrook's 57 triple double for most points in a triple double. Harden's previous high for points in a triple double was 53 [When you see you're one rebound short.](https://i.imgur.com/Z9rPROp.jpg)", "class": "r/nba"}, {"text": "Miami's Alternate Jersey link Getting a Haslem one or a custom Wade one fuck it. Don't think any of our present guys are gonna be super long term.", "class": "r/nba"}, {"text": "U.S. presidential candidate Yang blasts Chinese response to Rockets link this post is like reddit crack", "class": "r/nba"}, {"text": "[The Onion] LeBron James credits teammates with providing four bodies necessary to avoid forfeiture against Pacers [Link](https://sports.theonion.com/lebron-james-credits-teammates-with-providing-4-bodies-1825658316?utm_content=SP&utm_campaign=SF&utm_source=Facebook&utm_medium=SocialMarketing)\n\nI'm not sure if satire is allowed on here, but I thought people might find this one funny.   My favorite line:\n\n> [James] admitted that Cleveland would’ve swept Indiana if NBA rules had not mandated the presence of four superfluous players.", "class": "r/nba"}, {"text": "Isaiah Thomas likes tweet: \"Boston dumped Isaiah Thomas after he ruined his hip carrying the Celtics in the Playoffs day's after his sister died. Read that sentence again. Kobe ripped his Achilles off the bone and the Lakers gave him 50 million dollars. Some companies take care of their stars.\" Isaiah Thomas likes tweet: \n\n> \"Boston dumped Isaiah Thomas after he ruined his hip carrying the Celtics in the Playoffs day's after his sister died. Read that sentence again. Kobe ripped his Achilles off the bone and the Lakers gave him 50 million dollars. Some companies take care of their stars.\"\n\n\n[Source](https://pbs.twimg.com/media/Dyb7udYWsAEtUVK.jpg) i’m very conflicted. not only is this shitting on the celtics, it’s praising the lakers. i really don’t know how to feel. ", "class": "r/nba"}, {"text": "[Charania] Free agent DeMarcus Cousins has agreed to a deal with the Golden State Warriors. link what the fuck\n\n___\n\n[Woj on Twitter: Cousins will sign a one-year, $5.3M deal with Warriors, league source tells ESPN.](https://twitter.com/wojespn/status/1013944449750261760)\n\n[Woj on Twitter: So GM Bob Myers has replaced JaVale McGee with ...  Boogie Cousins. The $5.3M represents the taxpayer mid-level exception. Cousins is hopeful to return to the court by December/January off his torn Achilles. There will be no rush with Warriors.](https://twitter.com/wojespn/status/1013945409591496704)\n\n[Story on Yahoo Sports by Shams Charania](https://sports.yahoo.com/sources-demarcus-cousins-agrees-deal-warriors-003552151.html)\n\n[Shams on Twitter: The Warriors also partly didn't believe in Cousins' mutual interest at first. Agreement developed fairly quickly Monday -- after a few phone conversations -- with the reigning champions.](https://twitter.com/ShamsCharania/status/1013963282762301441)", "class": "r/nba"}, {"text": "I bring to you, the 2017-18 Orlando Magic season link Watching this at work was a mistake", "class": "r/nba"}, {"text": "[Highlight] Lavine wins the game with his 13th three link **Replays/alternate angles**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "[Wojnarowski] Portland is signing Carmelo Anthony, league source tells ESPN. link [[Wojnarowski] Deal is non-guaranteed, per source.](https://twitter.com/wojespn/status/1195158222795165697)", "class": "r/nba"}, {"text": "[Wojnarowski] Golden State and Brooklyn have agreed on a sign-and-trade, sending D’Angelo Russell to the Warriors on a four-year, $117M maximum contract, league sources tell ESPN. link Of all the possible realities this one seemed most unlikely", "class": "r/nba"}, {"text": "[Wojnarowski] The Pelicans have agreed to a deal to trade Anthony Davis to the Lakers for Lonzo Ball, Brandon Ingram, Josh Hart, and three first-round picks – including the No. 4 overall in 2019 Draft, league sources tell ESPN. link That poor guy who gave Josh Hart the Switch is going to get Pelicans tickets instead of Lakers tickets.", "class": "r/nba"}, {"text": "Lebron’s cutscene in NBA 2k20 is just plain sad after recent events https://streamable.com/jxkz0\n\nIn the cutscene he talks about speaking up for those without a voice. \n\n“Those people, those kids, they exist on every corner of the globe, and they’re all deserving of a chance”\n\n“I believe no one person is capable of turning the tide, but we all have an obligation”\n\nLike... dude\n\nEdit: Forgot to mention that Lebron’s production company Springhill Entertainment helped produce and write the story for 2k20 - these are his own words\n\nedit2: [Credit to Chris Smoove for the footage](https://www.youtube.com/watch?v=kpYB24wDYkE) that's incredibly funny is a really dark way", "class": "r/nba"}, {"text": "Max Kellerman tries to cover up a fart with an awkward cough link Shoutout to Stephen A for being a bro. Told the producers to put on a video so Max could get control of himself lmao", "class": "r/nba"}, {"text": "A small demonstration of LeBron's incredible basketball IQ - 30 seconds from Game 4 link Watching that live I was shocked at how wide open JR was for seemingly no reason.  I can see some reads like this in real time but overall I'm sure my BBIQ is probably pretty low.  Quality content like this helps OP.", "class": "r/nba"}, {"text": "Craig Sager Passes Away link if only everyone had as much fun at their jobs as he did at his. RIP", "class": "r/nba"}, {"text": "Wilt Chamberlain secretly dominated professional basketball at age 16 under a false identity. Scoring as much as 46 points against pros in the Eastern U.S. with a team record of 36-1. By age 17 he was averaging 40.5ppg. This is the first time I'm sharing this research: [Wilt Chamberlain Dominating Professional basketball leagues at age 16, and 17](http://imgur.com/vNZZsm5)\n\nCalculated averages for 17 year old Wilt as a Quakertown Fay:\n\n* 40.5ppg in 9 regular season games (according to one of the articles)\n\n* 74ppg in 6 playoff games (according to the math... not sure it's even possible but who knows)\n\n* 53.9ppg in 15 total games (according to a Quakertown book)\n\n* Worth mentioning he won the MVP award in that league\n\n[Image 2](http://imgur.com/NmbZnL8.jpg)\n\n[Image 3](http://imgur.com/2nhBTqC.jpg)\n\n[Image 4](http://i.imgur.com/BBnYsYc.jpg)\n\n[Image 5](http://i.imgur.com/ecuUBnC.png)\n\nWilt Chamberlain, or as he was first known, \"George Marcus\", secretly dominated professional basketball under that assumed identity at age 16 for the Pittsburgh Raiders. Even as a kid against 6-11 men his own size playing professionally (such as former Harlem Globetrotters!) he averaged 53.9ppg by age 17. I found game recaps of multiple 46 point performances for the Quakertown Fay's at age 17, and at least one 44 point game even at age 16 for the Pittsburgh Raiders.\n\nThis is not only not often talked about, it's NEVER talked about. I've seen only a few references to his professional career that predated college basketball. When I researched this I found out it got him into potential trouble with the NCAA and so it was kept hushed and perhaps left to be forgotten.\n\n*EDIT* Allow me to plug one other researcher who I've come to learn first shared the photographs of Wilt playing for the Fay's a few years ago. I found him on Twitter, and here's a link to a fascinating video he produced!\n\nhttps://twitter.com/storyrd\n\nhttps://www.youtube.com/watch?v=un5HPRWW4Yk\n\n*EDIT*\n\nIMPORTANT UPDATE - According to a Quakertown book (researched by [bardown](http://www.bardown.com/under-a-fake-identity-wilt-chamberlain-dominated-pro-basketball-when-he-was-16-and-17-1.757398) staff) Wilt actually averaged 53.9ppg in all 15 games as a Quakertown Fay! He \"only\" averaged 40.5ppg in 9 regular season games but with playoffs combined his 15 game average shoots up to 53.9ppg! This means 74ppg in the 6 playoff games as a Fay. I'm not sure if this is even possible so please take with a grain of salt. Though he did score 90 points in high school and 100 in the NBA including 5 other 70+ point games so who knows. This being against former pros his own size too including 6-11 former Globetrotter Andy Maddox! inb4 some website steals /u/dantheman9758's post and takes credit for it", "class": "r/nba"}, {"text": "Lebron James game winning three! - TNT link lebron too old for OT.\n\n", "class": "r/nba"}, {"text": "Is it me or does Ben Simmons resemble Mona Lisa? See pic for comparison http://imgur.com/a/UwExx\n\nEvery now and then if he gets the same facial expression at the iconic angle he looks really similar. Same eyes that you can't tell if they're kind or laughing at you or know something. \n\nEDIT: thanks for gold [mirror if imgur overloads](http://imageshack.com/a/img923/9697/DSu0fM.png) Ben Simmons' face looks like it was rendered on Runescape", "class": "r/nba"}, {"text": "Possibly the best video of the Rondo spitting incident link What rondo worked on this offseason:\n\n1. shooting\n\n2. spitting like a cobra", "class": "r/nba"}, {"text": "[Post Game Thread] The Toronto Raptors (4-2) defeat the Milwaukee Bucks (2-4), 100-94, advancing to the NBA Finals for the first time in franchise history **[](/MIL) MIL**|**Min**|**FG**|**FT**|**3PT**|**+/-**|**OR**|**Reb**|**A**|**Blk**|**Stl**|**TO**|**PF**|**Pts**|\n|:---|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|\nB. Lopez|34:02|5-12|8-9|0-3|-11|2|9|1|4|0|1|1|18|\nG. Antetokoun|40:31|7-18|5-10|2-5|+3|3|11|4|3|2|2|4|21|\nK. Middleton|40:29|5-13|0-0|4-8|0|1|4|0|0|0|2|3|14|\nM. Brogdon|31:27|3-6|2-2|2-5|-7|1|3|2|0|1|3|3|10|\nE. Bledsoe|30:19|3-9|1-2|1-3|-12|1|5|7|0|1|2|3|8|\nG. Hill|31:59|4-10|1-2|1-4|0|1|2|3|0|2|1|2|10|\nE. Ilyasova|21:30|3-7|5-6|2-5|-6|3|6|1|0|0|0|4|13|\nP. Connaughto|9:41|0-0|0-0|0-0|+3|0|2|1|1|1|0|2|0|\nD.J. Wilson|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nB. Colson|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nS. Brown|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nN. Mirotic|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nT. Snell|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nT. Frazier|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nP. Gasol|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nD. DiVincenzo|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nTotals|240|30-75(.400)|22-31(.710)|12-33(.364)|-|12|42|19|8|7|11|22|94|\n\n**[](/TOR) TOR**|**Min**|**FG**|**FT**|**3PT**|**+/-**|**OR**|**Reb**|**A**|**Blk**|**Stl**|**TO**|**PF**|**Pts**|\n|:---|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|\nM. Gasol|26:18|2-3|0-0|2-2|+1|0|3|2|1|1|0|5|6|\nP. Siakam|41:29|7-17|3-4|1-3|+8|2|4|0|1|1|2|2|18|\nK. Leonard|41:25|9-22|8-11|1-8|+7|4|17|7|2|2|6|3|27|\nK. Lowry|41:05|6-10|2-2|3-4|0|0|5|8|0|1|1|5|17|\nD. Green|14:25|0-4|0-0|0-4|-7|0|2|1|0|2|0|2|0|\nF. VanVleet|33:50|5-6|0-0|4-5|+12|0|0|2|0|0|0|2|14|\nS. Ibaka|24:53|4-7|1-2|0-0|+3|0|3|0|0|0|0|4|9|\nN. Powell|16:31|3-5|2-3|1-1|+6|0|4|0|0|0|1|1|9|\nO. Anunoby|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nP. McCaw|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Loyd|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nM. Miller|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nC. Boucher|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Lin|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nJ. Meeks|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nE. Moreland|0:00|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\nTotals|240|36-74(.486)|16-22(.727)|12-27(.444)|-|6|38|20|4|7|10|24|100|\n\n||\n|:-:|\n|^[nbaboxscoregenerator.com](http://www.nbaboxscoregenerator.com) ^by ^/u/Obi-Wan_Ginobili| Dad Van Vleet takes the kids to the Finals", "class": "r/nba"}, {"text": "[Post Game Thread] The Cleveland Cavaliers defeat the Golden State Warriors 93-89, winning the series 4-3 and claiming their first NBA championship in franchise history |\n|\n\n||\n|:-:|\n|[](/CLE) **93 - 89** [](/GSW)|\n|**Box Score: [NBA](http://www.nba.com/games/20160619/CLEGSW/gameinfo.html#nbaGIboxscore)**|\n\n||||||||||||||||\n|:---|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|\n**[](/CLE) Cavaliers**|**MIN**|**FGM-A**|**3PM-A**|**FTM-A**|**+/-**|**ORB**|**DRB**|**REB**|**AST**|**PF**|**STL**|**TO**|**BLK**|**PTS**|\nL. James|46:49|9-24|1-5|8-10|+4|1|10|11|11|1|2|5|3|27|\nK. Love|30:02|3-9|0-3|3-4|+19|4|10|14|3|2|2|1|0|9|\nT. Thompson|31:49|3-3|0-0|3-4|+2|0|3|3|0|4|0|0|2|9|\nJ. Smith|38:55|5-13|2-8|0-0|+7|0|4|4|2|3|1|2|0|12|\nK. Irving|43:00|10-23|2-5|4-4|+10|3|3|6|1|3|1|2|1|26|\nR. Jefferson|25:30|1-4|0-0|0-0|-8|1|8|9|0|1|1|0|0|2|\nI. Shumpert|19:10|1-3|1-3|3-3|-9|0|1|1|0|0|0|0|0|6|\nM. Williams|04:45|1-3|0-1|0-0|-5|0|0|0|0|1|0|1|0|2|\nM. Dellavedova|-|-|-|-|-|-|-|-|-|-|-|-|-|-|\nC. Frye|-|-|-|-|-|-|-|-|-|-|-|-|-|-|\nD. Jones|-|-|-|-|-|-|-|-|-|-|-|-|-|-|\nJ. Jones|-|-|-|-|-|-|-|-|-|-|-|-|-|-|\nT. Mozgov|-|-|-|-|-|-|-|-|-|-|-|-|-|-|\nTotal|240|33-82|6-25|21-25| |9|39|48|17|15|7|11|6|93|\n\n||||||||||||||||\n|:---|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|---:|\n**[](/GSW) Warriors**|**MIN**|**FGM-A**|**3PM-A**|**FTM-A**|**+/-**|**ORB**|**DRB**|**REB**|**AST**|**PF**|**STL**|**TO**|**BLK**|**PTS**|\nH. Barnes|29:24|3-10|2-4|2-2|-6|0|2|2|1|4|1|0|0|10|\nD. Green|46:54|11-15|6-8|4-4|-1|1|14|15|9|3|2|2|0|32|\nF. Ezeli|10:45|0-4|0-0|0-0|-9|0|1|1|1|2|0|0|0|0|\nK. Thompson|42:17|6-17|2-10|0-0|-11|1|1|2|2|2|1|3|0|14|\nS. Curry|39:16|6-19|4-14|1-1|-3|0|5|5|2|4|1|4|1|17|\nA. Iguodala|37:53|2-6|0-3|0-2|+3|2|7|9|4|3|2|0|2|4|\nA. Varejao|08:29|0-1|0-0|1-2|-9|0|0|0|1|3|0|0|0|1|\nS. Livingston|16:04|3-7|0-0|2-2|+8|1|0|1|2|1|0|1|0|8|\nL. Barbosa|04:24|1-2|1-1|0-0|+5|0|0|0|0|1|0|0|0|3|\nM. Speights|04:34|0-2|0-1|0-0|+3|2|2|4|0|0|0|0|2|0|\nI. Clark|-|-|-|-|-|-|-|-|-|-|-|-|-|-|\nJ. McAdoo|-|-|-|-|-|-|-|-|-|-|-|-|-|-|\nB. Rush|-|-|-|-|-|-|-|-|-|-|-|-|-|-|\nTotal|240|32-83|15-41|10-13| |7|32|39|22|23|7|10|5|89|\n\n||\n|:-:|\n|^Generator: [^Excel](https://drive.google.com/file/d/0B81kEjcFfuavUmUyUk5OLVAtYzg/view?usp=sharing) ^by ^/u/imeanYOLOright  ^&  ^Web(nbaboxscoregenerator ^.tk) ^by ^/u/jorgegil96| What if Varejao came out in Cavs gear right now\n\n\"hey guys what I miss?\"", "class": "r/nba"}, {"text": "ESPN is misquoting its own reporter Brian Windhorst in the video title for the sake of getting more views. Amazing professional journalism. Brian Windhorst says: \"I kinda feel like judging the Lakers moves right now is still a little half-baked, so to speak, because we really don't know what they're gonna be [...]\"\n\nESPN names the video: \"Windhorst: Lakers' moves after signing LeBron James are 'a little half-baked' | First Take | ESPN\"\n\nSeriously?! FOH. I clicked on the video to hear his analysis and not because of the title and get this gem of a clickbait title.\n\nI just wanted to try to get to the top so a little exposure on their conduct can be shown. I'm not putting the link for the video, obviously. ESPN is the worst. I remember the days when I would wake up EXCITED to watch sportscenter every morning", "class": "r/nba"}, {"text": "It is absurd to me that the NBA removed the All Star game for Charlotte for the bathroom issue (which is a real issue) but plays multiple games in China which imprisons millions while stealing their organs Like where the fuck are your moral priorities? The bathroom thing is an issue but the things China does is so much fucking worse. Adam Silver is a bald fraud of a shill who doesn't and has never cared about real social justice. Only prop it up when it helps your business and reputation. This is absolutely disgusting and absurd Priorities of the NBA:   \n1. Money", "class": "r/nba"}, {"text": "Brandon Roy shot in leg while shielding children from gunfire link Fuck basketball, this is some real life \"give that man a medal\" hero type shit.\n\nBrandon Roy is awesome.", "class": "r/nba"}, {"text": "Nike claims the ninja style headbands \"unprofessional\" for NBA basketball, yet Rafael Nadal is rocking one in the US Open Men's final... with a Nike logo on it. Talk about a double standard, Nike. Calling a headband style unprofessional in one sport. Meanwhile one of the best tennis players of our time is rocking one with a Nike logo on it...and I dont hear anyone complaining about it. It would be a damn shame to ruin the otherwise business formal attire of a sleeveless jersey and gym shorts imo", "class": "r/nba"}, {"text": "James Harden runs out of bounds with 15 seconds left in the game because he was expecting a foul call link ### **Replays/alternate angles**\n                \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "[Highlight] Cameraman pans away from \"Free Hong Kong\" T-shirt | TNT link **Replays/alternate angles**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Durant tells a fan to “Watch the fucking game and shut the fuck up” link Westbrook: [Just sit down with your wife and shut the fuck up.](https://www.youtube.com/watch?v=yk4hGketcdQ)\n\nKD: Watch the fucking game and shut the fuck up.\n\nI wonder how Harden will continue this tradition lmao", "class": "r/nba"}, {"text": "[Stotts]: \"As an American, I believe in free speech and democracy, and it's kinda what we stand for\" link Guess we know what team won't be playing in China any time soon", "class": "r/nba"}, {"text": "Reddit users spent a total of $227.26 on gilding r/nba's #1 top post, \"Paul Pierce admits shitting his pants\" As of today, the thread \"Paul Pierce admits shitting his pants\" has: 8 Platinum, 10 Most Valuable, 17 Gold, 5 Quality OC, 37 Historic Highlight, 32 Crying MJ, 6 Apt Analysis, and 52 Silver.\n\nThis equates to 57,100 Reddit Coins, or $227.26. This does not take into account bulk purchasing. That makes it... *counts* the 11th most lucrative pants shitting in the history of the USA.", "class": "r/nba"}]