[{"text": "NBA officially proposes lowering draft age to 18 link Huh, I always thought it wasn’t an age thing, but a requirement to be 1 year removed from High School", "class": "r/nba"}, {"text": "[Wojnarowski] New York has agreed with Dallas on trade that includes Kristaps Porzingis, Courtney Lee, Tim Hardaway Jr., for Wesley Matthews, Dennis Smith Jr. and DeAndre Jordan, league sources tell ESPN. Players and agents are being notified of particulars. Deal may include more draft assets. link Yes officer this trade right here", "class": "r/nba"}, {"text": "Charles Barkley: \"I don't like the fan's vote. What happened last time when we let them make a big decision? White House.\" link Civil discussion as always guys, bans will be handed out where appropriate.\n\nHad to lock, sorry guys.", "class": "r/nba"}, {"text": "The Big 3 together one more time! link Manu’s like “these fuckers didn’t even try to dress up for TV”", "class": "r/nba"}, {"text": "Toronto fans cheering as KD goes down hurt link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Report: Warriors' Durant expected to miss entire 2019-20 season link >Golden State Warriors superstar Kevin Durant is expected to miss the entire 2019-20 season after undergoing surgery for a ruptured right Achilles tendon, reports ESPN’s Adrian Wojnarowski.\n\n>The two-time NBA Finals MVP and 2014 regular-season MVP revealed the severity of his injury in an Instagram post Wednesday, two days after getting hurt during the Warriors’ Game 5 win over the Toronto Raptors. It was his first game in more than a month after being sidelined with a right calf strain.\n\n\n>Despite the news, Wojnarowski cited league sources indicating that the Brooklyn Nets and the New York Knicks remain interested in signing soon-to-be free agents Durant and Kyrie Irving into max salary slots.", "class": "r/nba"}, {"text": "[Feldman] 7-foot-5 Tacko Fall entered concussion protocol because he hit his head on 'low ceiling' link This is an incredible headline that is totally expected for someone that is Tacko's height, but also hilarious.", "class": "r/nba"}, {"text": "Melo just lays on the court, nobody gives a fuck and play goes on. link I watched that twice and didn't notice Melo at all.", "class": "r/nba"}, {"text": "[Wojnarowski] Sacramento has agreed to trade DeMarcus Cousins to the New Orleans Pelicans, league source tells @TheVertical. link So my roommate is a kings fan. How do I ask him for march rent before he kills himself?", "class": "r/nba"}, {"text": "[Wojnarowski] Golden State’s Klay Thompson has suffered a torn ACL in his left knee, his agent Greg Lawrence tells ESPN. link At this rate it's almost better there wasn't a Game 7; Curry would have been hit by a bolt of lightning.", "class": "r/nba"}, {"text": "[Wojnarowski] Kevin Durant is planning to sign with the Brooklyn Nets, league sources tell ESPN. link Kyrie to KD: what does the word government mean to you?\n\nKD: I’ve made a huge mistake", "class": "r/nba"}, {"text": "[Wojnarowski] New York has agreed to a deal to send Carmelo Anthony to OKC for Enes Kanter, Doug McDermott and a draft pick. link Kanter: \"OKC is the best organization in the NBA.\"\n\n*OKC trades him*", "class": "r/nba"}, {"text": "Max Kellerman on Lebron: \"It's called selling out. It's very easy to take a stand when there is low to no cost. When there is a real price to pay, then who will stand up? Mohammad Ali did. Not Lebron James\" link Mohammad Ali is the perfect example. Dude lost years of his prime over protesting what he thought was right. I mean, shit, he took it to the US Supreme Court since he was the one with the money and could afford to take a stance against the US Government.", "class": "r/nba"}, {"text": "Carmelo puts OKC up by 1 before Wiggins wins it at the buzzer link that crowd went 100 to 0 real fucking quick", "class": "r/nba"}, {"text": "Kobe to Shaq alley-oop, Game 7 of the 2000 Western Conference Finals. link Pippen should have gone back to being invisible after getting crossed up that bad", "class": "r/nba"}, {"text": "Every Phoenix Suns player starts running at the exact same moment link 9-2 is such a promising start, i wonder how the rest of the game went", "class": "r/nba"}, {"text": "[Wojnarowski] The Clippers have agreed to a deal to send Blake Griffin to the Detroit Pistons, league sources tell ESPN. link Trade as we know it currently: \n\n**Clippers send:** \n\n* Blake Griffin (PF)\n* Willie Reed (C) \n* Brice Johnson (PF)\n\n**Pistons send:** \n\n* Tobias Harris (F)\n* Avery Bradley (SG)\n* Boban Marjonovic (C)\n* 2018 1st Round Pick ^[1](https://twitter.com/wojespn/status/958121789179203585)\n* 2019 2nd Round Pick", "class": "r/nba"}, {"text": "Pop has the most total wins as a head coach with 1,413. Here's his reaction after he got the first one, on December 14, 1996. link Pop was a crazy lad. Fired the head coach back then and said I've got this", "class": "r/nba"}, {"text": "[Rovell] Girl named Riley Morrison asks @StephenCurry30 why his sneakers don’t come in girls sizes. Steph responds. link My man really said #RUINTHEGAME lmao ", "class": "r/nba"}, {"text": "New NBA fan with a question. I was watching the Cavs practice tonight, why were there some people running around in Celtics jerseys? Hey sorry if it's a dumb question, I was just wondering why the practice was getting interrupted and no one was doing anything about it? It didn't really seem to mess them up though which is why I guess security didn't do anything. You know it's bad when we have off season level shitposting during the conference finals.", "class": "r/nba"}, {"text": "DeAndre Ayton forgot to change his sample text link \"I hate this fucking game #BlackOps4 #CallofDutyPartner\"", "class": "r/nba"}, {"text": "LeBron forgets he's not on the Heat anymore link If Norris Cole passes him the ball off that screen do you think he takes the shot?\n\nThat'd be the funniest moment in NBA history.", "class": "r/nba"}, {"text": "Kawhi sents Raptors to ECF - SNET = link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "[Wright] Spurs coach Gregg Popovich was asked why he thinks it’s important to give back to the community: “Because we’re rich as hell and we don’t need it all, and other people need it. Then, you’re an ass if you don’t give it. Pretty simple.” link He always tips waiters thousands of bucks whenever the spurs are in town ", "class": "r/nba"}, {"text": "Lebron James response to Kyle Lowry and Warriors part-owner incident link The face of the NBA has spoken. This will now be dealt with properly by Silver.", "class": "r/nba"}, {"text": "With 4 minutes and 20 seconds left in the 4th quarter this was the score during the Warriors vs. Clippers summer league game : link Why has nobody pointed out it was a COX Scoreboard? ", "class": "r/nba"}, {"text": "Lou Williams eats nachos after dropping 36 points in the biggest comeback in NBA Playoff history link Na-cho night dubs fans", "class": "r/nba"}, {"text": "Kareem Abdul-Jabbar is auctioning off his championship rings and MVP trophies for charity: \"When it comes to choosing between storing a championship ring or trophy in a room, or providing kids with an opportunity to change their lives, the choice is pretty simple. Sell it all.\" link Can you fuckin imagine having Kareem’s MVP trophy sitting in your display case", "class": "r/nba"}, {"text": "Paul Pierce admits to shitting his pants in the NBA finals against the Lakers, and faking a knee injury to go to the bathroom [VIDEO] link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Dirk Nowitzki’s Full Page Thank You to Dallas in Today’s Paper link 21 fucking seasons with the same team. Props to the front office not fucking that up, absolute class act and loyalty all around.", "class": "r/nba"}, {"text": "[Windhorst] Kyrie Irving asked the Cavs to trade him in a meeting last week, sources told ESPN. link Shit they just said on NBA radio that Kyrie doesn't want to play with LeBron anymore. Holy shit ", "class": "r/nba"}, {"text": "Body Worn Camera Video Release of Sterling Brown Arrest link EDIT: 14 hours is long enough. Comment quality has degraded to the point where we're going to close it down. \n\nWe know this is a hot button topic, as it should be. We ask that commenters  follow [our rules](http://www.reddit.com/r/NBA/wiki/rules) and act respectful towards each other. \n\nRule breaking comments may result in a suspension. \n\n_____\n\n[Milwaukee Police Press Release](http://imgur.com/1mqt3YW)\n\n[Sterling Brown Press Release](https://pbs.twimg.com/media/Dd6kQ2hV4AA8ZKA.jpg)\n\n[Milwaukee Bucks Press Release](https://www.nba.com/amp/bucks/news/bucks-organization-statement-sterling-brown)", "class": "r/nba"}, {"text": "[Klein] Hawks are all-in on fan experience.. 1st NBA team to offer fan friendly concession prices: $1 Chips; $2 Candy, pretzel's, bottled water; $3 Fries, hot dogs, nachos $4 pizza, bottomless popcorn, bottomless soda; $5 beer link So living in LA, it would almost be cheaper to fly to Atlanta to go to a game.  OK OK", "class": "r/nba"}, {"text": "After the departure of Phil Jackson from the Lakers in 2004, Shaq went on TV and declared \"If a coach takes a team to the Finals 4 out of 5 years, I'll kiss his feet. With cheese on it. I will. It'll never be done again.\" Since then, Steve Kerr has taken the Warriors to 5 straight Finals. link **Replays/alternate angles**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Lakers/Raptors fans should turn the Kawhi situation into something positive. Winning team's fan base makes donations to other city's children's hospital? Toronto and Boston had something like this going during the NHL playoffs. Could be something nice coming out of all this increased attention.\n\nWow this blew up quick. I'm going to turn off mailbox replies lol.\n\nI'm a Toronto fan so I'll be making a $20 donation to https://www.chla.org/ if Kawhi signs with Toronto. I hope others do the same.\n\nToronto's Childrens Hospital is Sick Kids Hospital - https://www.sickkids.ca/\n\nI've cross posted this to both /r/torontoraptors and /r/lakers as well to get more eyes on it.\n\nFINAL EDIT: \n\nSo this is a turn of events. Clippers got him. I honestly thought they weren't really in the running anymore and it was a toss up between Lakers and Raptors. As I've said in comments I never meant any disrespect to Clippers fans and congrats to them! When they were brought up I really didn't know how to do a 3 way deal between 2 cities. Now that here here though...\n\nThe spirit of the wager was the winning team donates to the other teams kids hospital. Clippes fans have wanted to be in this so much I'm hoping now they step up. I'd suggest donating to either city's kids hospital. You want to keep your donation local give to CHLA, want to show Toronto some love give to Sick Kids in Toronto. for Lakes and Raptors fans I'm suggesting they each give to the other charity. As a Raptors fan I'm still going to give to CHLA. There is no reason not to in my mind.\n\nI'm glad my post could bring people together in a positive way and I know some good has come out of it.\n\nFINAL FINAL EDIT:\n\nI know this post is old now but I wanted to show that I put my money where my mouth is:\n\nhttps://imgur.com/FgGVGgL\n\nI hope others did as well. So you implying clippers dont even have fans? lol", "class": "r/nba"}, {"text": "Damian Lillard quotes Sun Tzu's The Art of War “It is the unemotional, reserved, calm, detached warrior who wins, not the hothead seeking vengeance and not the ambitious seeker of fortune.” [https://www.instagram.com/p/BwpUza1gmIc/](https://www.instagram.com/p/BwpUza1gmIc/) Damian Lillard, they're already dead", "class": "r/nba"}, {"text": "Michael Jordan hits a Triple Clutch Layup link My favorite part about this was the Net’s bench reaction", "class": "r/nba"}, {"text": "Charles: I really feel sad for Russell Westbrook. This kid gives 150% every single game and all he does is get criticized.. Is he the perfect basketball player, no. But that guy gives maximum effort every single night. And as an old player and a fan, I'm going to always admire that man link imagine telling r/nba a week ago that Rocket fans would be defending and complimenting Westbrook in the near future", "class": "r/nba"}, {"text": "Bad officiating calls in Warriors-Rockets G7 Strap in boys, it's gonna be a ride. So I've basically reviewed the whole game last night, and here are the questionable plays which I thought should have been calls/were called wrongly.\n\n#Calls going against Rockets:\n\n1. [Wrong travelling call against Capela](https://streamable.com/cso98), didn't lift up his pivot foot.\n\n2. [Slight push on PJ Tucker no call, KD gets the call on the other end](https://streamable.com/boqtv). Probably a superstar call.\n\n3. [Harden might have gotten shoved in the back by Looney](https://streamable.com/7189z), no call.\n\n4. [Capela called for a goaltend for what seemed to be a clean block](https://streamable.com/qtz8u).\n\n5. [Harden fouled on the landing](https://streamable.com/4d9r6), no call. [Slowmo](https://streamable.com/s06jh)\n\n6. [Harden fouled on three attempt](https://streamable.com/bzjys), no call. [Slowmo](https://streamable.com/alpcm)\n\n7. [Ref disallows continuation on Harden's three](https://streamable.com/vhads). [Slowmo](https://streamable.com/lydp2)\n\n8. [Eric Gordon fouled by Draymond](https://streamable.com/zynw6), no call.\n\n#Calls going against Warriors:\n\n1. [Klay gets called for an early 2nd foul which didn't look like much contact](https://streamable.com/e0s94), looked like ball just slipped out of EG's hands.\n\n2. [Curry's hip gets pushed by Gerald Green](https://streamable.com/o4nk6), even falls on the ground. No call.\n\n3. [Jordan Bell raked across the arm by Harden](https://streamable.com/s2n6m), no call. (pro tip: right click and select 1/4 speed to see the contact)\n\n4. [Klay gets hand checked by Tucker and loses the ball](https://streamable.com/pqylu). No call. [Slowmo](https://streamable.com/j8f9c)\n\n5. [KD gets pushed into Harden by Ryan Anderson](https://streamable.com/n27zm), foul on KD. Similar to [this play](https://streamable.com/nhcep), albeit less egregious by Anderson.\n\n6. [Klay gets a point removed by Scott Foster](https://streamable.com/0nhtk).\n\nA major theme which showed itself was the fact that Ryan Anderson literally (I'm not kidding) hand checked Curry every time he was switched onto him. And the Warriors forced that switch A LOT. Here's ALL the plays where Anderson guarded Curry:\n\nhttps://streamable.com/el34r\n\nhttps://streamable.com/vtmzu\n\nhttps://streamable.com/uv829\n\nhttps://streamable.com/9fqlg\n\nhttps://streamable.com/junss\n\nhttps://streamable.com/2peej\n\nhttps://streamable.com/53mhy\n\nhttps://streamable.com/cuojo\n\nhttps://streamable.com/07r5o\n\nBonus Harden trying to draw foul when there was none & just looking like a fool:\n\nhttps://streamable.com/ca5v5\n\nhttps://streamable.com/jffyc\n\nOh and, inb4 Rockets fans accuse me of bias again, and calling me a Warriors fan. Would a Warrior fan post these?\n\nhttps://www.reddit.com/r/nba/comments/8lyh34/ariza_gets_called_for_a_blocking_foul_on_durant/\n\nhttps://www.reddit.com/r/nba/comments/8ly16n/curry_draws_3_free_throws_from_capela/\n\nhttps://www.reddit.com/r/nba/comments/8lfvoo/draymond_going_back_to_his_bad_habits/\n\nThe entire game is freely available online, if you're so angry why don't you make your own compilation? And u/unklebuckets, still waiting for [your refs lowlights thread](https://www.reddit.com/r/nba/comments/8mf8tv/post_game_thread_the_golden_state_warriors_33/dzn4mpy/?context=3), or any of the 1+ million subscribers to make one.\n\nEdit: [Summary of the night](https://i.imgur.com/fHlyNne.jpg) lol. Credits to u/wetjumpshot\n\n Although this might get deleted because ref bashing, nice amount of research done here. Kudos\n\nEdit: Still up, wew", "class": "r/nba"}, {"text": "[Highkin] Awful news from San Antonio: Spurs announce that Gregg Popovich's wife, Erin, passed away today. link [Spurs GM RC Buford on the passing of Erin Popovich: \"We mourn the loss of Erin. She was a strong, wonderful, kind, intelligent woman who provided love, support and humor to all of us.\"](https://twitter.com/wojespn/status/986762877959884800)\n\n[Full statement from the Spurs](https://pbs.twimg.com/media/DbGtlf0WsAEvCEp.jpg)", "class": "r/nba"}, {"text": "Donald Trump just called Warriors head coach Steve Kerr a \"little boy\" for not calling out China No idea what to think but this should be left up as a thread on the sub. It's related to basketball & honestly, as much as I hate to say it but he does have a point\n\n[streamable link here to the video](https://streamable.com/lnlia) As with every thread, please be mindful of the [rules](https://www.reddit.com/r/nba/wiki/rules). All are still in effect, and bans will be handed out where necessary.\n\nHad to lock, as thread is getting brigaded and comments straying from relevance.", "class": "r/nba"}, {"text": "J.R. Smith runs out the clock and then keeps running link Sometimes I wish I was alive for Picasso, Van Gogh, or Michelangelo. Then I see posts like this and realize that great art is still among us", "class": "r/nba"}, {"text": "Joe Harris comments on the financial implications of Darryl Morey’s tweet: “I already get paid too much to play a game...” Full quote:\n\n\nJoe Harris on whether or not he is worried about the financial implications of Daryl Morey’s tweets: “I already get paid too much to play a game. So, not really.”\n\nPer Malika Andrews: \nhttps://twitter.com/malika_andrews/status/1184541643229335553?s=21\n\nJoe Harris is a man of the people and he presumably supports democracy. Joe Harris has a rocking beard and slangin dong\n\nEdit: for those of you in this thread comparing Joe to Lebron, here’s a YES Network side by side comparison of the two roughly 2 years ago. \nhttps://www.reddit.com/r/nba/comments/872u4d/yes_network_side_by_side_comparison_of_lebron/?utm_source=share&utm_medium=ios_app&utm_name=iossmf Bolder than 90% of the nba players and coaches", "class": "r/nba"}, {"text": "[BR] Adam Silver on Daryl Morey: \"We were being asked to fire him by the Chinese government. … We said there’s no chance that’s happening. There’s no chance we’ll even discipline him.\" (via @TIME) link Who knew China was such a little bitch ?", "class": "r/nba"}, {"text": "[Spears] “I believe he was misinformed and not educated on the situation,” LeBron James said on the Morey tweet. LeBron added Morey’s tweet was dangerous. LeBron said he is uncertain about the future ramifications of the Morey tweet with the NBA and players. link [[Spears]LeBron James was referring to the ramifications of Daryl Morey’s tweet on China and the events it unleashed when the Lakers star said the Rockets GM was misinformed, a source told Undefeated](https://twitter.com/MarcJSpearsESPN/status/1183924147958640642)\n\n[[Oram] LeBron just addressed the team’s trip to China, including saying he felt Daryl Morey was misinformed. He later clarified he meant “misinformed” of the ramifications of such a comment as opposed to the issue of Hong Kong’s sovereignty.](https://twitter.com/billoram/status/1183923098627657729?s=21)\n\n\n[[Faigan] Here is LeBron on his belief that Daryl Morey \"wasn't informed\" on the situation in China, and his thoughts on the consequences that come with free speech](https://twitter.com/hmfaigen/status/1183920065499942912?s=21) Transcript of what LeBron said", "class": "r/nba"}, {"text": "Caller on Stephen A. Smith's show mentions that all is not lost for the Knicks because Carmelo Anthony is available. Stephen A. Smith replies: \"Oh go to hell. Bye\", and drops the phone call link **Replays/alternate angles**\n                        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Doncic sends the game in OT link LEBRON DINNER WITH DONCIC CONFIRMED", "class": "r/nba"}, {"text": "Kobe Bryant wins the Oscar for \"Dear Basketball\" in the animated short film category. link [Kobe's acceptance speech video](https://streamable.com/ytq4n)", "class": "r/nba"}, {"text": "James Harden gives the Rockets a one point lead with one second left! - TNT link ### Replays/alternate angles\n\nIf this post is a highlight, reply to this comment with replays, alternate angles, and other accompanying media. \n\nIf your highlight is removed or doesn't show up in the new queue, it was likely removed as a duplicate or for failing to meet quality standards.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nba) if you have any questions or concerns.*", "class": "r/nba"}, {"text": "Why LeBron would sign with every NBA team **Atlanta Hawks**\n\nLeBron is secretly a huge Twister fan. He will join the Hawks so he can film Twister 2 with their owner’s wife on their off days.\n\n**Boston Celtics**\n\nLeBron misses Kyrie. He wants to play basketball with his friend and that means playing for the Celtics.\n\nOR\n\nLeBron wants to troll Kyrie. He will go to Boston management and ask them to trade Kyrie back to Cleveland if they want him to join. Danny Ainge will agree because he has no heart.\n\n**Brooklyn Nets**\n\nLeBron loves NY. He will go to New York to sign with the Knicks to play in historic Madison Square Garden. However, during the drive to the stadium, his driver makes a wrong turn and they end up in Brooklyn. LeBron realizes the mistake, but shrugs his shoulders and signs with the Nets instead, because he will have the same results with either the Knicks or Nets.\n\n\n**Charlotte Hornets**\n\nLeBron wants to prove he’s better than Michael Jordan. He will sign with the Hornets to taunt MJ directly. He will win the Finals in 2019 with the Hornets and won’t let MJ touch the trophy. After the season, LeBron will buy out MJ’s shares and he will become majority owner. He will then trade himself to a better team because Dwight is too annoying and nobody will agree to LeBron’s trade proposals involving Dwight.\n\n**Chicago Bulls**\n\nLeBron wants to prove he’s better than Michael Jordan. He will sign with the Bulls so he can win 7 championships to pass what MJ did.\n\n\n**Cleveland Cavaliers**\n\nLeBron loves Cleveland as much as he hates moving. LeBron will re-sign with the Cavs, because it’s more convenient than moving to a different city.\n\n**Dallas Mavericks**\n\nLeBron is still haunted by the 2011 Finals. He will go to Dallas to learn from the true GOAT Dirk Nowitzki. There, LeBron will lead the Mavs all the way to the number 1 seed in the West, only to lose to the Warriors in the first round after KD leaves for India to re-join his snek charmer friend.\n\n**Denver Nuggets**\n\nLeBron loves chicken nuggets. He will sign with Denver, only to be disappointed. He then will retire and start his own chicken nugget company.\n\n**Detroit Pistons**\n\nLeBron will become the new Pistons President of Basketball Operations. His first act in his new role will be to sign himself as the head coach/starting SF. His second transaction will be to trade Blake Griffin to the Cavs for the 8th pick in the draft and salary filler, because LeBron will blackmail Dan Gilbert into doing it.\n\n**Golden State Warriors**\n\nLeBron wants all the ringz. He will sign with the Warriors for the veteran minimum so he can win not 1, not 2, not 3, not 4, not 5, not 6, not 7, not 8, not 9, but 10 championships.\n\n**Houston Rockets**\n\nLeBron loves space. He will sign with the Rockets so he can go to NASA and fly an actual rocket into space to find better competition on other planets. Mike Dan Tony will be confused why LeBron doesn’t show up to their games. Mike, he’s in space, deal with it.\n\n**Indiana Pacers**\n\nLeBron loves pace. He will sign with the Pacers so he can out-pace the other NBA players and win a championship. He will also become best friends with Lance Stephenson and the two will call out plays to each other by blowing in each other’s rear, I mean ear.\n\n**LA Clippers**\n\nLeBron wants to live in Hollywood, but doesn’t want to be under the shadow of Laker greats. If he can just lead the Clippers to the conference finals, they would rename their franchise LeBron’s Clippers.\n\n**LA Lakers**\n\nLeBron wants to live in Hollywood, but doesn’t want to be under the shadow of Clipper goods. He also wants to learn from the great Lavar Ball on how to play basketball as good as him.\n\n**Memphis Grizzlies**\n\nLeBron will not sign with the Memphis Grizzlies.\n\n**Miami Heat**\n\nLeBron will go back to Miami because he left his white headband there and wants it back.\n\n**Milwaukee Bucks**\n\nLeBron loves freaks. He will join the Greek Freak and sign with the Bucks. Then they will sign Rick James to preform every halftime so he can sing LeBron’s favorite song “Super Freak”\n\n**Minnesota Timberwolves**\n\nLeBron wants to learn from former MVP Derrick Rose. He also wants to torture his body and allow Coach Thibs to play him all 48 minutes for all 82 games.\n\n**New Orleans Pelicans**\n\nLeBron loves smoothies. He will join the Brow and sign with the Pelicans, so he can get unlimited smoothies at the Smoothie King Center.\n\n**New York Knicks**\n\nLeBron loves NY. He will go to New York to sign with the Knicks to play in historic Madison Square Garden. During the drive to the stadium, his driver makes the correct turn and they end up in MSG. LeBron realizes this and signs with the Knicks.\n\n**OKC Thunder**\n\nLeBron will sign with the Thunder so he can play with Russell Westbrook for one season, then leave after that and become an even better player.\n\n**Orlando Magic**\n\nLeBron will take his talents to Central Florida. He will sign with the Magic and lead them to another Finals lost.\n\n**Philadelphia 76ers**\n\nLeBron will sign with the 76ers because he trusts the process. LeBron will single handedly play bad for 3 seasons and tank so that the 76ers will get more draft picks to add to their squad. Then by age 37, LeBron will have what he needs to win another Eastern Conference Finals.\n\n**Phoenix Suns**\n\nLeBron loves hot-related teams. He will sign with the Suns and win 2 championships to prove to Pat Riley that he isn’t so special with his so called “Heat” for the “Suns” are the hottest thing in the universe.\n\n**Portland Trail Blazers**\n\nLeBron loves Nike. He will sign with the Blazers so that he can spend his off days at Nike headquarters creating new shoes.\n\n**Sacramento Kings**\n\nLeBron is the King. He will sign with the Kings, because that’s where he belongs.\n\n**San Antonio Spurs**\n\nLeBron loves Coach Pop. He will sign with the Spurs to learn from him, only to find out Coach Pop actually has no idea what he’s doing and is just really lucky. LeBron will use that luck to convince Kawhy? To stay and they will win a championship every other year in 2019, 2021, and 2023.\n\n**Toronto Raptors**\n\nLeBron will sign with the Raptors just to check up on them and make sure they are ok.\n\n**Utah Jazz**\n\nLeBron loves jazz. He will sign with Utah only to find out they don’t actually have jazz. He will then force a trade to New Orleans to be close to real jazz and because he remembered that he loves smoothies.\n\n**Washington Wizards**\n\nLeBron loves politics. He will sign with the Wizards so he can play basketball and also become the next president of the United States in 2020.\n\n\n\n**EDIT**\n\nSome of you have been asking for this, so here you go...\n\n**Seattle Supersonics**\n\nLeBron won't sign with this team because it doesn't exist. >doesn’t want to be under the shadow of Laker greats\n\n>doesn’t want to be under the shadow of Clipper goods", "class": "r/nba"}]